{
  "comments": [
    {
      "date": "10 August 2011 16:39",
      "html": "Just curious, when one references &quot;Large L2 network&quot; does it mean broadcast domain with large number of switches (&gt;50) and not so large number of nodes on that domain (&lt; 200), or does it simply mean large number of nodes (dense domains)and large number of switches ? I don&#39;t believe SPs were successful addressing the latter scenario w/o link state protocols. Surely it&#39;s possible to engineer stable network with large number of switches with multiple broadcast domains that are sparsely populated using STP but I&#39;m not so sure about large number of switches with really large &amp; dense population of nodes per broadcast domain.<br /><br />And to Ivan&#39;s point if you have to use link-state on L2 to scale broadcast domains lots of switches and pack them with lot more systems per domain, it does look like re-inventing wheel, though of course as AC pointed out, developers are not going to change their habits so might as well re-invent it.",
      "id": "8482027645811512941",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ulan Mamytov",
      "profile": null,
      "pub": "2011-08-10T16:39:54.669+02:00",
      "ref": "5211592658206815642",
      "type": "comment"
    },
    {
      "date": "10 August 2011 17:20",
      "html": "The &quot;layer&quot; based differentiation between the stereotypic concepts of &quot;bridging&quot; and &quot;routing&quot; is, in fact, misleading. Major advantage of so-called &quot;L2 Ethernet&quot; network that makes it so attractive is flat name space. It&#39;s just historically packet routing in &quot;flat&quot; Ethernet networks were based on simple flooding models, emulating the shared cable. This routing model could be properly redesigned without modifying the &quot;access&quot; method itself, eliminating any scaling differences between the so-called &quot;L2&quot; and &quot;L3&quot;. In fact, if you think of it, the OSI/ARPA &quot;layering&quot; models were probably biggest obstacles on the way to understanding the protocol design, due to their rigid structure. Another huge problem, of course, is tremendous networking industry inertia, that hinders the innovation progress.",
      "id": "541248250030585633",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2011-08-10T17:20:59.777+02:00",
      "ref": "5211592658206815642",
      "type": "comment"
    },
    {
      "date": "10 August 2011 19:52",
      "html": "How did you guess the topic of one of upcoming blog posts? Scary ...  ;)",
      "id": "4527493360802285522",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ivan Pepelnjak",
      "profile": null,
      "pub": "2011-08-10T19:52:37.895+02:00",
      "ref": "5211592658206815642",
      "type": "comment"
    },
    {
      "date": "10 August 2011 19:56",
      "html": "Will try to get more details, but there are few generic tricks you can use:<br /><br />* Don&#39;t mesh the network too much (dual trees work best)<br />* Use 802.1ah (MAC-in-MAC) not 802.1ad (Q-in-Q). With MAC-in-MAC the core switches don&#39;t need to know the customer&#39;s MAC addresses (and you can fine-tune the broadcast domains)<br /><br />Not sure what L2 link-state protocols you have in mind. The first SPB (802.1aq) products have just started to appear.",
      "id": "4312203324699227502",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ivan Pepelnjak",
      "profile": null,
      "pub": "2011-08-10T19:56:51.692+02:00",
      "ref": "5211592658206815642",
      "type": "comment"
    },
    {
      "date": "10 August 2011 21:28",
      "html": "Ulan,<br /><br />I had privilege (luck?) to participate in building a fairly large L2 network (100+ nodes across fairly large geography - probably 150km+ between furthest nodes) in early 2000s. It was built using traditional enterprise switches, and served connectivity between two main hubs and the rest of the nodes with bandwidths around 10-100 Mbit/s per minor node. There was no communication between minor nodes at L2. Each minor node sat on one or more VLANs which terminated at both main nodes. At all sites hand-off to the customer was L2, and it was up to them how to connect it (router or switch). Memory is starting to fail me as I wasn&#39;t involved with operating that network much, but from what I remember there were definitely more than a couple of MACs visible per node in CAM tables, but not hundreds.<br /><br />So to answer your question: in my case it was a large number of switches, a decent number of L2 domains, with not too many MACs in each domain.<br /><br />Network was controlled by MSTP.",
      "id": "5683400375388137188",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Dmitri Kalintsev",
      "profile": null,
      "pub": "2011-08-10T21:28:26.569+02:00",
      "ref": "5211592658206815642",
      "type": "comment"
    },
    {
      "date": "12 August 2011 17:37",
      "html": "Ivan:  Could not agree more with your sentiments in general.  Service-Provider gear has ample network virtualization features!  Read a book, deploy MPLS or Q-in-Q!  Its not that hard!",
      "id": "8797895795058879876",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "ccie15672",
      "profile": null,
      "pub": "2011-08-12T17:37:25.911+02:00",
      "ref": "5211592658206815642",
      "type": "comment"
    },
    {
      "date": "12 August 2011 17:39",
      "html": "Or mac-in-mac!    :)",
      "id": "1837995750453743390",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "ccie15672",
      "profile": null,
      "pub": "2011-08-12T17:39:36.681+02:00",
      "ref": "5211592658206815642",
      "type": "comment"
    }
  ],
  "count": 7,
  "id": "5211592658206815642",
  "type": "post",
  "url": "2011/08/stop-reinventing-wheel-and-look-around.html"
}