{
  "comments": [
    {
      "date": "02 February 2012 09:17",
      "html": "Thanks Ivan for this article.",
      "id": "3277652653899054550",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Olivier Cahagne",
      "profile": null,
      "pub": "2012-02-02T09:17:39.833+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "02 February 2012 15:54",
      "html": "My reading is the same as yours. But Light Reading article called it both &quot;new&quot; and &quot;proprietary&quot; and followed that statement by a quote from Cisco that kind of supported that supposition. I think that&#39;s why it blew up. If you google EVN you get Cisco articles from 2010 and 2011. Hardly &quot;new&quot;. If you read them, it becomes apparent this is VRF-lite re-branded and cleaned up a bit (the configurations look almost identical, actually). The Light Reading article is here: http://www.lightreading.com/document.asp?doc_id=216987",
      "id": "7886262349808167325",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Wildsubnet",
      "profile": null,
      "pub": "2012-02-02T15:54:57.086+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "02 February 2012 17:50",
      "html": "Ironically, I&#39;d followed up on this about an hour before I noticed this blog item among my RSS feeds. The docs say to check Feature Navigator (which I&#39;ve never found very useful when I need it -- and it&#39;s running true to form). <br /><br />Searching it for &quot;EVN&quot; and &quot;Easy Virtual&quot; finds no feature hits. &quot;Easy&quot; comes up with many Easy VPN features -- different technology though. Anyway, that&#39;s exhausted my short list of obvious names for the feature in Feature Navigator. Knowing how well-implemented it is across platforms and in which code versions would certainly be useful.  <br /><br />I&#39;m interested because saving typing / simplification might be useful. We&#39;ve deployed large-scale VRF-Lite (many devices, up to 10 VRF&#39;s) for some hospitals that need to isolate some gear, also a couple of L3 rural provider nets. Skills or skills depth and costs were drivers for VRF-Lite. Simplified CLI is a big deal. OTOH, old wine, new bottle, agree re the comments about dates on documents, etc.",
      "id": "8640811750066858094",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Pete Welcher",
      "profile": null,
      "pub": "2012-02-02T17:50:40.504+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "03 February 2012 05:27",
      "html": "I&#39;m thinking it was announced today for its ability to *automate* virtual networks. Hehe.  Fewer commands will auto-magically make it easy to configure multi-VRF now.  Interesting day for announcement, however, I do think it will be valuable for the market.  I don&#39;t think you agree, but with 6-7 VRFs required and deployed down to routed access layers...let&#39;s say 15 access switches.  It will streamline configs without introducing MPLS in the campus.  Don&#39;t ask what the problem with MPLS in the campus is ;)",
      "id": "282662313481522271",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "@jedelman8",
      "profile": null,
      "pub": "2012-02-03T05:27:43.946+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "03 February 2012 10:23",
      "html": "Marketing...",
      "id": "3080450774638539295",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Antonio Pezuela",
      "profile": null,
      "pub": "2012-02-03T10:23:40.648+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "07 February 2012 06:47",
      "html": "So if I get you right EVN is basically Multi-VRF in the core over VLAN interfaces. Is my understanding correct?",
      "id": "5144243699221142831",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Vishwas Manral",
      "profile": null,
      "pub": "2012-02-07T06:47:44.991+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "07 February 2012 09:10",
      "html": "Yes.",
      "id": "3934335004387365316",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ivan Pepelnjak",
      "profile": null,
      "pub": "2012-02-07T09:10:37.842+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "07 February 2012 19:45",
      "html": "FYI, I am a Cisco Employee working on EVN. EVN comes with a few very new things. One of them is Route Replication. It allows shared services between VRF in a more powerful way than BGP. It allows routes to be shared between the Global route table and other VRFs without limitations. BGP can only share 5 VRFs with 1000 routes per VRF in this situation. <br /><br />EVN has also improved the traceroute capability so that it will return the name of the VRF and VNET TAG on a hop by hop basis through the network. This uses some optional objects in ICMP defined by RFC4884. <br /><br />One of the reasons we say it is an alternative to MPLS is that it will run on platforms that don&#39;t support MPLS - such as the Catalyst 4500.  <br /><br />If you want to read about these and the other options go to http://www.cisco.com/go/evn   - or just google - Easy Virtual Network.",
      "id": "5956779336563099817",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Andy Kessler",
      "profile": null,
      "pub": "2012-02-07T19:45:13.767+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "08 February 2012 08:08",
      "html": "Andy, thanks for the excellent feedback!<br /><br />I did under-emphasize the fact that global routing table became just another RIB that behaves the same way as any othe (fixed) ... but then there were good reasons it did not when MPLS/VPN was used primarily in the Service Provider world.<br /><br />However I can&#39;t understand where you got the &#39;5 VRFs with 1000 routes per VRF&#39;. This is definitely not an architectural limitation of MPLS/VPN (as I have running networks doing the same thing on an order-of-magnitude higher numbers). Is it a platform-specific issue that you encountered?<br /><br />The improved traceroute capability is another nice feature that will definitely help enterprise network engineers.<br /><br />BTW, are there any plans to have EVN on non-IOS-XE platforms? I can see cases where it would be a perfect fit for small remote sites.<br /><br />Last but definitely not least, if you&#39;d like to have a more in-depth conversation, why don&#39;t you contact me directly? http://www.ipspace.net/Contact",
      "id": "6677161845236896261",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ivan Pepelnjak",
      "profile": null,
      "pub": "2012-02-08T08:08:27.643+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "08 February 2012 09:28",
      "html": "Hi Ivan, <br /><br />Yes, the &#39;5 vrf 1000 routes&#39; is not a MPLS/VPN limitation - its an IOS issue. Yes, it was a restriction requested by SP customers and we never removed it. Go ahead and google &#39;1000 routes 5 vrf&#39; and you&#39;ll see a Cisco doc. The doc I just read says only 5 VRFs but that the 1000 routes can  be increased - I&#39;ll have to double check that. <br /><br />Yes, it would be nice to get EVN on non-IOS-XE platforms. If we get enough customer demand we can build the business case. Please mail to evn@cisco.com and request it ;-)<br /><br />I&#39;d be happy to have an in-depth conversation. <br />Lets set that up. <br />Right now I need to go to sleep 8-)<br /><br />Andy",
      "id": "8884068264136069714",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Andy Kessler",
      "profile": null,
      "pub": "2012-02-08T09:28:23.678+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "08 February 2012 17:29",
      "html": "Ivan, <br /><br />Thanks for the update. The last point that I would comment on is about &#39;new-ness&#39;. Yes, EVN shipped on the ASR1000 back in Nov 2010. That was mainly due to all the multiple variables associated with our release process - the ASR1000 team was ready and aggressive to ship EVN. But the fact is - is that EVN is really a technology focused on switched campus networks. What is new about the announcement last week is that EVN is now shipping on the Cat6500 and Cat4500. That is new and a much bigger deal and we can say that EVN has now &#39;Arrived&#39;. <br /><br />We have been talking about EVN for years - but now - this week - it much more useful. And thats why we had press releases and announced it. Call it marketing if you want - but it is reality and timing. <br /><br />Andy",
      "id": "8195608357781288655",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Andy Kessler",
      "profile": null,
      "pub": "2012-02-08T17:29:24.449+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "08 February 2012 19:44",
      "html": "Ah, that one. Unless I&#39;m grossly mistaken, the limits you mention apply only to import from global table into VRFs (which is a kludge anyway), and if I read between the lines correctly, the use case is global blackhole routing.<br /><br />If I would be a Service Provider leaking routes from global into VRF, I&#39;d want to have some hard limits as well, otherwise the full Internet table could accidentally leak into numerous VRFs (fat fingers at work), blowing up the RIB and FIB.",
      "id": "1873000018932151358",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ivan Pepelnjak",
      "profile": null,
      "pub": "2012-02-08T19:44:42.354+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "10 February 2012 02:50",
      "html": "These are excellent inputs Andy. Helps clarify things perfectly. Great job!!",
      "id": "3574766709887219988",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Vishwas Manral",
      "profile": null,
      "pub": "2012-02-10T02:50:45.035+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "21 June 2012 01:13",
      "html": "I just wanted to add that EVN sounds very interesting to me from a multi-layer campus design perspective.  We are looking for ways to isolate certain networks so that we can provide a centralized point of control, such as for point-of-sale systems.<br /><br />MPLS is not really feasible in our environment, as it could only run between a few core 6500s.  We would still need to provision VRFs on all distribution routers (3750/4500) and use VRF-lite to connect them to VRFs on the core 6500s.  EVN will greatly simplify these links, without the need to run MPLS and BGP. <br /><br />Lastly, the benefits of better troubleshooting with the &quot;routing-context&quot; command encourages me to implement VRFs also at the edge of our network (as opposed to buying twice the gear).  This &quot;routing-context&quot; provides some of the same benefits as virtual-device-contexts (VDC) on the Nexus 7000.",
      "id": "4137221240220110782",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Unknown",
      "profile": "https://www.blogger.com/profile/02097705840321191138",
      "pub": "2012-06-21T01:13:42.209+02:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "11 August 2012 16:53",
      "html": "does anyone see EVN appearing on the Nexus 5548/96 platform with the L3 card ?",
      "id": "5184023248213167128",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2012-08-11T16:53:26.934+02:00",
      "ref": "4982829128305026228",
      "type": "comment"
    },
    {
      "date": "23 November 2012 05:42",
      "html": "My AM &amp; SE pointed me at the 4500-x 16 port 10G switch to replace the old 3750G-12S in my distribution layer.  With the enterprise license it now supports EVN and MPLS.  So it&#39;s both cheaper and better then the 3560E-12D-E.  Oh, how nice, there is now an EOL announcement for the 3560E-12D...<br /><br />I&#39;m still very nervous about doing an MPLS campus deployment, but EVN doesn&#39;t help support isolating stupidly vulnerable medical systems, credit card systems, etc on my metro ethernet network.  I really don&#39;t want to deploy EVN for the 30 campus sites and then have the same guys have to learn MPLS anyhow to support the clinics.",
      "id": "2247125073921383076",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Kevin",
      "profile": null,
      "pub": "2012-11-23T05:42:08.122+01:00",
      "ref": "4982829128305026228",
      "type": "comment"
    }
  ],
  "count": 16,
  "id": "4982829128305026228",
  "type": "post",
  "url": "2012/02/easy-virtual-network-nothing-new-under.html"
}