{
   "comments": [
      {
         "comments": [
            {
               "date": "26 March 2024 09:53",
               "html": "<p>&gt; to reflect reality more accurately</p>\n\n<p>OK, I&#39;m biting ;) There are (at least) three aspects to the OSI model:</p>\n\n<ol>\n<li>The split of functionality into layers and grouping of functions by layers.</li>\n<li>The API between layers</li>\n<li>The implementation of individual layers (protocols)</li>\n</ol>\n\n<p>I think we can agree that #2 and #3 are obsolete. Now, which part of #1 do you think does not reflect reality?</p>\n",
               "id": "2163",
               "name": "Ivan Pepelnjak",
               "pub": "2024-03-26T09:53:18",
               "ref": "2162",
               "type": "comment"
            },
            {
               "date": "27 March 2024 05:28",
               "html": "<p>I would need to sit down and spend hours (months) if I were to actually propose a formal (or informal) revision to the OSI spec with all the proper thought out processes and paradigms in the picture &mdash; Something that most people definitely wouldn&#39;t be willing to do, as the ROI is practically nil (unless some big names in the industry work together to make it happen, maybe).</p>\n\n<p>That being said:\n&quot;The split of functionality into layers and grouping of functions by layers.&quot;\nThat&#39;s what formal document states to my understanding, but we often just group protocol to layers instead of function to layers. This can be evident based on the fact that BGP is a &quot;layer 7&quot; protocol, even though, it&#39;s actual functionalities spans the various layers (as you said so yourself).</p>\n\n<p>This type of confusion/debate could probably be cleared up once and for all in a revised version of the OSI model.</p>\n\n<p>&quot;The API between layers&quot;\nI&#39;m not sure I understand what you mean here. The OSI model doesn&#39;t define the software/programming aspect of an OSI stack to my knowledge, and seems to be supported here from day one:\nhttps://en.wikipedia.org/wiki/OSI_model#Programming_interfaces</p>\n\n<p>Programming/implementation (writing code, firmware, hardware etc) has always been independent of the OSI model and spec altogether. As the OSI is supposed to be a &ldquo;reference model&rdquo; for an &ldquo;abstraction&rdquo; of the network functionality in a hierarchical fashion.</p>\n\n<p>&quot;The implementation of individual layers (protocols)&quot;\nThis ties in with the first point, a protocol may span the layers, for various functionalities.</p>\n\n<p>So maybe, a revised version of the OSI, could instead of saying &quot;BGP is layer 7 protocol&quot;, it could be more like &quot;BGP function A, B, C etc are in layer 3,4 ,5 ,6 ,7 respectively&quot;. Or maybe the &quot;7 layer&quot; needs to be re-done completely, and it could be more than 7 or less, I don&#39;t know&hellip; As this require months worth of time investment to properly form a coherent proposal. Just speaking out my thoughts on this, may or may not be accurate/realistic.</p>\n",
               "id": "2164",
               "name": " Daryll Swer",
               "pub": "2024-03-27T17:28:05",
               "ref": "2163",
               "type": "comment"
            }
         ],
         "date": "26 March 2024 08:39",
         "html": "<p>Let&#39;s settle on is-is is layer 3 adjacent!</p>\n\n<p>But really, I strongly believe the OSI model is due for a 2024 revision of the standard, to reflect reality more accurately.</p>\n",
         "id": "2162",
         "name": " Daryll Swer",
         "pub": "2024-03-26T08:39:39",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "02 April 2024 06:20",
               "html": "<p>Thanks a million. Another must-read article!</p>\n",
               "id": "2170",
               "name": "Ivan Pepelnjak",
               "pub": "2024-04-02T18:20:54",
               "ref": "2169",
               "type": "comment"
            }
         ],
         "date": "02 April 2024 01:03",
         "html": "<p>Rexford, Zave authored this great paper. We hwve to remember when OSI worked on the layering model a lot was not well understood about how services would evolve over packet networks. </p>\n\n<p>https://cacm.acm.org/research/the-compositional-architecture-of-the-internet/</p>\n",
         "id": "2169",
         "name": " Gary B",
         "pub": "2024-04-02T01:03:59",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2024/03/routing-protocols-osi-layers.html"
}
