{
   "comments": [
      {
         "date": "09 February 2022 04:50",
         "html": "<p>Yes, standardization is the hard part and basically to happen to get the benefit of automation, but you can&#39;t expect an active shop to complete standardization before automation. You can definitely clean up a lot of cruft, but sometimes you need to chip away at the block.</p>\n\n<p>In my current role, we learned a lot about the shape/size of services as we were automating them and adopting/converting bespoke eBGP services to standardized services. It took a lot of conversations with stakeholders (customers, CRM people, engineers, architects), lots of work extracting data from existing config, and some hard questions of &quot;do you really need this, and why?&quot; some of which we had to compromise on for time-sake.</p>\n\n<p>In the end, I think we wound up with a fairly well designed service template and we made the right thing the easy thing, but also managed to make the necessary thing possible. We were lucky enough and had enough talent to do this during a hardware migration, so we got to chuck the config cruft out the window with <code>request system zeroize</code>. Our change board was also very supportive of us getting stuff from dev into production relatively fast during that rollout.</p>\n\n<p>In a previous life, we worked really hard on standardization, but could never quite graduate past automation tasks because we constantly fought the second law of thermodynamics -- everything slowly decays into the inevitable heat-death of the universe. With the benefit of hindsight, I think we needed to automate the parts we had standardized and make those easy so we weren&#39;t fighting bad habits.</p>\n\n<p>I agree with you, but I think some lip service needs to be paid to iteration. Getting part of something automated has a way of &quot;locking in the automation&quot; that can in and of itself be valuable.</p>\n\n<p>I think what I&#39;m trying to say can be boiled down to &quot;Standardization needs to take place before or [more practically] as part of the automation journey, but you&#39;re never going to find yourself in a better place unless you standardize.&quot;</p>\n",
         "id": "1010",
         "name": " James Harr",
         "pub": "2022-02-09T16:50:35",
         "type": "comment"
      },
      {
         "date": "16 August 2022 10:25",
         "html": "<p>Absolutely. Many an engineer will have been or is planned to be made redundant by a management strategy due to impending automation&hellip;..when really they should be re-deployed to standardise first and be a part of the automation development.</p>\n\n<p>I always remembered a quote on a Juniper blog that pretty much sums this up:\n&ldquo;Rod Michael said, &ldquo;If you automate a mess, you get an automated mess.&rdquo; Automation must follow architecture and accuracy.&rdquo;</p>\n\n<p>https://blogs.juniper.net/en-us/enterprise-cloud-and-transformation/seven-deadly-deceptions-of-network-automation</p>\n\n<p>I can&rsquo;t find the origin of Rod Michaels &ldquo;mess&rdquo; quote but wise words.</p>\n",
         "id": "1345",
         "name": " Simon",
         "pub": "2022-08-16T10:25:56",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2022/02/cleanup-before-automation.html"
}
