{
   "comments": [
      {
         "date": "12 April 2022 12:28",
         "html": "<p>Thank you for such wonderful content, Seriously.</p>\n",
         "id": "1152",
         "name": " Dave N",
         "pub": "2022-04-12T12:28:12",
         "type": "comment"
      },
      {
         "date": "12 April 2022 12:43",
         "html": "Thank you for such wonderful content : )<br />\n\n<p>Joke aside, your site is a holy grail for all the continuously blasted engineers with a slew of crappy stuff, usually in video form. Mainly, I am irritated by &quot;gurus&quot; who preach about passing certification examinations in a month with no prior experience and other such rubbish. Furthermore, video content from well-known learning organizations is so poor that even some of the most popular learning companies embrace the &quot;quantity over quality&quot; strategy. The content they post is rubbish and is not worth the monthly fees they charge.</p>\n",
         "id": "1153",
         "name": " Adis Cato",
         "pub": "2022-04-12T12:43:52",
         "type": "comment"
      },
      {
         "date": "12 April 2022 01:08",
         "html": "<p>Spot on Ivan! Long time reader, first time commenter. </p>\n\n<p>Thanks for all the wonderful content over the years. </p>\n",
         "id": "1154",
         "name": "Brad Searle",
         "pub": "2022-04-12T13:08:02",
         "type": "comment"
      },
      {
         "date": "12 April 2022 05:23",
         "html": "<p>Ivan, your blog is on my daily read-list, usually the first one.  Not every post is relevant to me, but almost all are at least interesting.  And it&#39;s particularly fun on Monday mornings when I discover you posted bonus content over the weekend!</p>\n\n<p>Thanks for your excellent content, your site is one of my go-tos for solid explanation on things.  </p>\n",
         "id": "1156",
         "name": " Merrill",
         "pub": "2022-04-12T17:23:43",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "12 April 2022 08:22",
               "html": "<p>Your blog has always been my favorite!\nHope to enjoy for a long time to be!</p>\n",
               "id": "1159",
               "name": " JeffT",
               "pub": "2022-04-12T20:22:07",
               "ref": "1157",
               "type": "comment"
            }
         ],
         "date": "12 April 2022 06:02",
         "html": "<p>yours is the first blog ever by far.      </p>\n\n<p>Keep producing Ivan please !!!!    </p>\n\n<p>Cheers/Ciao  </p>\n\n<p>Andrea  </p>\n",
         "id": "1157",
         "name": "Andrea Di Donato",
         "pub": "2022-04-12T18:02:39",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "13 April 2022 01:00",
               "html": "<p>Amen to this - especially video as entertainment vs. text for dissemination, speed, search, etc.</p>\n\n<p>Thank you for all the thought-provoking and informative content. I&#39;ve been reading widely on your blog, and even where the topic isn&#39;t relevant to what I work on, there&#39;s a lot gained just from understanding how you approach things. Especially the footnotes. :)</p>\n",
               "id": "1161",
               "name": " Niall Donaghy",
               "pub": "2022-04-13T01:00:56",
               "ref": "1160",
               "type": "comment"
            }
         ],
         "date": "12 April 2022 10:31",
         "html": "<p>If I had to write a comment to tell you your content is great each time, you&#39;ll had considered me as a spammer.\nI consider you a model and often ask myself &quot;What Ivan would have suggested here?&quot;</p>\n",
         "id": "1160",
         "name": "sjdkluytsiyklr",
         "pub": "2022-04-12T22:31:01",
         "type": "comment"
      },
      {
         "date": "13 April 2022 10:16",
         "html": "<p>Daniel is absolutely spot-on. Short attention span and incapacity to focus are 2 of the worst diseases these days. Forget about reading, even watching a 45&#39; documentary is too much for some(many) people. That&#39;s why I&#39;m very pessimistic about science and technology these days. It&#39;s all flash and no substance mostly, with collapsing complexity everywhere you look. A civilization of little character and low spirit, have no WILL to work on the hard problems. Period. Ancient Greeks and Samurai Spirits should be made mandatory topics in schools if we want things to change. </p>\n\n<p>Didn&#39;t you notice already, that the amount of comment on your blog has reduced considerably in the past few years, compared to say, 2017 and before that? That too, is a sign of the times. </p>\n\n<p>But like you said, people who have a passion for writing should still publish, as their loyal readers will still read their content, and it&#39;s these people that count (another application of Sturgeon Law). Plus, above all, they should write for themselves, because that&#39;s what they want, and that&#39;s what they are. If you&#39;ve put a lot of hard work and thought in a blog/article, you don&#39;t need any external validation to know that you have produced something of value. The work will speak for itself.</p>\n\n<p>I have some disagreements with you here and there on the technical aspects, but I always greatly respect your old-school work ethics and conscience, and this one is definitely on-point on all aspects. It applies equally in and out of IT. </p>\n",
         "id": "1162",
         "name": " Minh",
         "pub": "2022-04-13T10:16:29",
         "type": "comment"
      },
      {
         "date": "13 April 2022 11:46",
         "html": "<p>A little anecdote.</p>\n\n<p>I was on a long sabbatical. One day in 2012, some old colleagues told me: &quot;Henk, you need to come back to work. We have this new thing called SDN. Customers want to buy it, VCs want to pour money into it&quot;. So I started googling for &quot;SDN&quot;. In those days, SDN still meant: &quot;OpenFlow&quot;. I read about OpenFlow. I was wondering: &quot;What am I missing here? This can&#39;t be serious? This will never work?&quot;.</p>\n\n<p>I ran into your blog, Ivan. One day there was a post that said: &quot;OpenFlow is just a forwarding-table download-protocol&quot;. That answered all my questions. Yes, they were serious. No, I wasn&#39;t missing anything. And indeed, it never worked.</p>\n\n<p>What I appreciate most about this blog is the honest opinions and direct descriptions. No wish to obfuscate things. No tendency to always use friendly words. Not afraid to say that something is wrong or useless in the real world. This saves us so much time, to not have to wade through marketing bullshit.</p>\n",
         "id": "1163",
         "name": " Henk",
         "pub": "2022-04-13T11:46:36",
         "type": "comment"
      },
      {
         "date": "13 April 2022 07:06",
         "html": "<p>@Dave, Adis, Brad, Merrill, Andrea, Jeff, Niall, LineNoise, Minh and Henk: thanks a million for your kind words ;)</p>\n",
         "id": "1165",
         "name": " Ivan Pepelnjak",
         "pub": "2022-04-13T19:06:01",
         "type": "comment"
      },
      {
         "date": "14 April 2022 05:36",
         "html": "<p>It really depends on why the content is created. Some are for commercials, some to help out (or give back), self-note, learning, or could be just as simple as a lamentation.</p>\n\n<p>If we wrote and expect to monitor readers and likes, this will only go down to one particular path.</p>\n\n<p>The joy of writing and sharing should rise not from the external factor and you&#39;re right mentioning not to expect feedback but yet feedback matters (your own rules, it-depends) especially when it comes from a reputable source. I like the &quot;don&#39;t give up&quot; section which reminds us again why we write.</p>\n\n<p>Nothing wrong with writing vs. video content but I could not comment on which one is better. It just has a different engagement model. One is for your eyes only, and the other is for your eyes and ears. Oh, by the way, the style matters a lot to keep the audience engaged (i.e. RFC 2328 or RFC 1925).  </p>\n",
         "id": "1166",
         "name": " David Sudjiman",
         "pub": "2022-04-14T05:36:32",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "15 April 2022 04:07",
               "html": "<p>I totally agree with you that a video might be the best way to demonstrate GUI or even CLI capabilities... but it takes tons of prep work to make a good video, and most of the stuff out there falls into the &quot;Inspector Clouseau Investigates&quot; category.</p>\n",
               "id": "1171",
               "name": " Ivan Pepelnjak",
               "pub": "2022-04-15T16:07:13",
               "ref": "1170",
               "type": "comment"
            }
         ],
         "date": "15 April 2022 03:50",
         "html": "<p>Prefer to read and have been for many years and appreciate all the blogger who truly selflessly contrbute to our industry by sharing their knowledge, experience that we as technical consumers may not be exposed to at the same time.  A blogger may experience and share a technical solution a year before the consumer of the blog does and the consumer uses that information to help them. The more bloggers who write solid content the more eyes on the fluid and dynamic aspect of our industry are covered and that helps the engineering consumer and our industry as a whole tremendously. </p>\n\n<p>I find the videos are okay for the &quot;how to&quot; on GUI type content.\nPod casts are great if you are on the go but for most part for me the blogger&#39;s written content is still the Rosetta Stone.</p>\n",
         "id": "1170",
         "name": "jsicuran",
         "pub": "2022-04-15T15:50:50",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "20 April 2022 07:30",
               "html": "<p>&quot;I have been a regular passive reader for your blog (I check and read it once a week) - but i have never used watched the Video recording though there are free tier subscription. I prefer reading over Audio / Video for technical contents.&quot;</p>\n\n<p>Thank you for the feedback! Would love to hear what you think about the videos if you ever decide to watch a few of them.</p>\n",
               "id": "1179",
               "name": " Ivan Pepelnjak",
               "pub": "2022-04-20T19:30:29",
               "ref": "1175",
               "type": "comment"
            }
         ],
         "date": "15 April 2022 07:57",
         "html": "<p>Ivan,</p>\n\n<p>I have been a regular passive reader for your blog (I check and read it once a week) - but i have never used watched the Video recording though there are free tier subscription. I prefer reading over Audio / Video for technical contents. I take this moment to thank you for your several great articles over many years. For me personally when someone reads he could try and visualize / imagine - how this might be or work and Video&#39;s you fixed on screen and just had to follow. The joy of reading and learning would be hard to replicate in the video. But we are also moving towards people searching on the you tube instead of google. Continue with your great work of honest view on networking , I am sure there are several thousands who read passively and appreciate what you do. </p>\n",
         "id": "1175",
         "name": " Vimal",
         "pub": "2022-04-15T19:57:47",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "20 April 2022 07:32",
               "html": "<p>&quot;Call me old fashioned, but if it&#39;s got tons of cookies, trackers, links &amp; ads, I usually just close a page or site right away. Quality content usually doesn&#39;t need all that.&quot;</p>\n\n<p>Yeah, I don&#39;t get it either. Why would someone destroy great content just to fund a morning visit to Starbucks (or equivalent) once a month... and thanks a million for spreading the word ;)</p>\n",
               "id": "1180",
               "name": "Ivan Pepelnjak",
               "pub": "2022-04-20T19:32:20",
               "ref": "1177",
               "type": "comment"
            }
         ],
         "date": "20 April 2022 01:20",
         "html": "<p>You and others already summed it up nicely.\nCall me old fashioned, but if it&#39;s got tons of cookies, trackers, links &amp; ads, I usually just close a page or site right away. Quality content usually doesn&#39;t need all that.\nSites/blogs like yours and e.g. lwn.net prove that it might be somewhat more work to stay sustainable, but a working strategy nevertheless. Fewer comments can be a plus, the lot of them are insighful and worthwhile reading material as well.\nEven if we don&#39;t shower you with Likes and Thumbs, we do (like). The number of people I refer to ipspace is my way of Like-ing :-)</p>\n",
         "id": "1177",
         "name": "Albert Siersema",
         "pub": "2022-04-20T13:20:14",
         "type": "comment"
      },
      {
         "date": "03 May 2022 02:17",
         "html": "<p>I&#39;m obviously late to the party here and I rarely comment, here or anywhere else, but this topic is very much deserving of a comment. I wholeheartedly agree with the previous comments made and;</p>\n\n<p>A good piece of written text will always outperform any video or audio piece attempting to cover a technical topic and more importantly as expressed in the post, consume a lot less time. Attempting to glean knowledge from most audio/video postings is stressful at best due to the sheer investment of time required.</p>\n\n<p>@Ivan, I stop by here now and then and really appreciate the content you produce so, thank you!</p>\n",
         "id": "1198",
         "name": " Stefan",
         "pub": "2022-05-03T14:17:52",
         "type": "comment"
      },
      {
         "date": "16 May 2022 02:19",
         "html": "<p>&quot;\nI rarely skip entries in my RSS reader. If I added an RSS feed, it must have been good enough to warrant at least a glance, and if I made a mistake, I&rsquo;ll remove it from the list of feeds I&rsquo;m tracking.\n&quot;\nI&#39;m jealous and want to get good RSS entries in a reader as well. How to get one ? Would someone share a nice list of feeds to start from ? \n:)</p>\n",
         "id": "1239",
         "name": " Habib",
         "pub": "2022-05-16T14:19:18",
         "type": "comment"
      }
   ],
   "count": 15,
   "type": "post",
   "url": "2022/04/keep-blogging.html"
}
