{
   "comments": [
      {
         "comments": [
            {
               "date": "15 April 2022 04:11",
               "html": "<p>Thanks for the feedback.</p>\n\n<p>It&#39;s nice to know I wasn&#39;t too far off the mark, but in this particular case, I&#39;m sorry to hear I got it right :(</p>\n",
               "id": "1172",
               "name": "Ivan Pepelnjak",
               "pub": "2022-04-15T16:11:49",
               "ref": "1169",
               "type": "comment"
            }
         ],
         "date": "15 April 2022 03:39",
         "html": "<p>This blog post is prophetic since I am involved in the final aspects of a managed SD-WAN deployment. \nDepending on the size of the company and how much you want &quot;managed&quot; by the vendor it can still be a good solution vs. rolling your own.\nHowever as with any vendor it can go off the rails quickly if your exposure to how much you give to the vendor to &quot;manage&quot; and your project risk shifts to a dependency you have no control over. </p>\n\n<p>I have a client where we went through a managed SD-WAN deployment, started out great and simple for a 60 site WAN and a few DCs but due to the pandemic and shortage of talent we felt the change in talent turnover, service quality which resulted in mismanagement and the project to be a year late.   Our vendor is pretty good, they were our MPLS provider(where we managed all the sites) and we moved to their Managed SD-WAN solution(where they now manage the site).  However,  issues started to show with the talent turnover and the size of the project.</p>\n\n<p>Plus, be careful on how much you want or need to be managed by the vendor&hellip; For example, you can have managed SD-WAN where the vendor handles all the design, configuration of the appliances and the customer will provide the project management and network circuits(split responsibility = less risk exposure) OR have the SD-WAN vendor cover the entire network design, build and post installation management, order circuits, handle VOIP service for you(responsibility entirely on vendor = higher risk exposure/less control). </p>\n\n<p>In my example one consistent issue was the vendor also covered the ordering of circuits and they were slower and didn&rsquo;t&#39; manage the carriers well which resulted in mis-configuration, multiple visits to sites, schedule delays, re-dos etc. vs. when we handled circuit orders ourselves we were much more efficient and quicker. </p>\n\n<p>So one major lesson for selecting Manage SD-WAN services  is the technical aspect(design/configuration of appliances etc) may be solid, depending on your vendor of course, but the other managed ancillary services for project management, deployment provisioning and build may not and that&rsquo;s where an additional exposure to issues and delays comes in.</p>\n",
         "id": "1169",
         "name": " jsicuran",
         "pub": "2022-04-15T15:39:45",
         "type": "comment"
      }
   ],
   "count": 1,
   "type": "post",
   "url": "2022/04/video-sdwan-services-challenges.html"
}
