{
   "comments": [
      {
         "date": "27 April 2022 10:06",
         "html": "<p>i actually worked there as a designer/implementer.. it was the predecessor of MPLS VPNs.. L2 VPNs using X25 and FR including the precursors to VoiP which was VoFR...   We also built L3 IP VPNs for larger networks using BGP but with standard communities. At the time iirc we were coming towards scaling limit&#39;s and that may have been one of the driving reasons the MPLS/VPNs and RTs.? </p>\n\n<p>The network was known as the biggest Cisco network in the world and also used something called the ALPS protocol suite in the airline VPNs.</p>\n\n<p>The technology over these FR/ATM networks were such things as DLSW, DECNET et al and when IP we used EIGRP vs OSPF as the routing protocol. </p>\n\n<p>One thing sorely lacking there which i discovered in my next engagement was no interaction with he physical layer. It was pure logical design and config. And also a very good place to learn to become a CCIE at the time.</p>\n\n<p>we also ran debug all to learn what we were doing due to lack of decent docs.</p>\n",
         "id": "1184",
         "name": " awful architect",
         "pub": "2022-04-27T10:06:39",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "27 April 2022 09:51",
               "html": "<p>The world of aircraft can be strange. There is also <a href=\"https://en.wikipedia.org/wiki/Avionics_Full-Duplex_Switched_Ethernet\">AFDX</a> - Ethernet made deterministic using ideas from ATM, with a multicast overlay virtualisation which is used as forwarding destinations instead of MAC addresses.</p>\n",
               "id": "1189",
               "name": "Graeme Danielson",
               "pub": "2022-04-27T21:51:38",
               "ref": "1185",
               "type": "comment"
            }
         ],
         "date": "27 April 2022 01:28",
         "html": "<p>X.25 has just been introduced recently in air traffic management for air-ground data links as part of the VDLm2 protocol stack. It uses a special profile of X.25 and OSI on top of it.</p>\n\n<p>It will stay with us up to 2030 as a minimum. It might be upgraded to IPv6 in the network layer, a new standard is under discussion. Or it might be replaced by LDACS. </p>\n\n<p>See also https://www.datalinkservices.eu/</p>\n",
         "id": "1185",
         "name": " Bela Varkonyi",
         "pub": "2022-04-27T13:28:55",
         "type": "comment"
      },
      {
         "date": "27 April 2022 04:07",
         "html": "<p>I remember it was used for POS/payment terminals back in the time.\nA retail customer I was dealing with had an outage in 2012 when they stopped Transpac (the french X25 network that powered the Minitel), because its terminals were using it. We had to think about XOT and find a third party provider... :-)</p>\n",
         "id": "1186",
         "name": " Pierre",
         "pub": "2022-04-27T16:07:58",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "28 April 2022 11:02",
               "html": "<p>It means that a large-enough customer probably focused on aviation industry wanted to replace 3600s with ISRs and told Cisco &quot;there&#39;s no PO without XOT support&quot;</p>\n",
               "id": "1191",
               "name": " Ivan Pepelnjak",
               "pub": "2022-04-28T11:02:16",
               "ref": "1190",
               "type": "comment"
            }
         ],
         "date": "28 April 2022 09:50",
         "html": "<p>Not sure what this means, but it would appear that support for X.25 and XOT was added by Cisco for ISR 4000 in IOS XE 16.10.1a at the end of 2018 ?!</p>\n\n<p>https://www.cisco.com/c/en/us/td/docs/routers/access/4400/release/xe-16-10/isr4k-rel-notes-xe-16-10.html\n&lt;snip&gt;\nNew Software Features in Cisco 4000 Series ISRs Release Cisco IOS XE Gibraltar 16.10.1a\nThe following features are supported by the Cisco 4000 Series Integrated Services Routers for Cisco IOS XE Gibraltar 16.10.1a:\nCisco X.25 &amp; XOT Support on Cisco 4000 Series ISRs&mdash;For detailed information, see the following Cisco document:\nhttps://www.cisco.com/c/en/us/td/docs/ios-xml/ios/wan_smxl/configuration/xe-16-10/wan_smxl_xe16_10_book/wan-smxl-overview.html.\n&lt;/snip&gt;</p>\n",
         "id": "1190",
         "name": " Daniel",
         "pub": "2022-04-28T09:50:30",
         "type": "comment"
      }
   ],
   "count": 4,
   "type": "post",
   "url": "2022/04/x25-still-alive.html"
}
