{
  "comments": [
    {
      "date": "27 March 2017 16:50",
      "html": "Ivan, <br /><br />One has to close the loop, Apps expressing what they desire isn&#39;t enough. That said, Apps shouldn&#39;t be expressing &quot;how&quot; i.e. DSCP markings etc. They should only be expressing &quot;what&quot; they desire and let the network control decide &quot;how&quot;. Our team did initial research on Application-Driven Automated QoS provisioning in SDN. Network Intent as it has since been called. <br /><br />Hope it doesn&#39;t sound like a product plug, but here is an example of how trusted application server (MS Skype for Business) APIs/SDKs can connect with Network control elements (Aruba Controllers) to optimize Network performance and App&#39;s Quality of Experience (not just QoS). http://www.arubanetworks.com/solutions/microsoft-mobile-ucc/<br /><br />Thanks,<br />Puneet<br /><br /><br /><br /><br />Puneet Sharma, Ph.D.<br />IEEE Fellow, ACM Distinguished Scientist<br />Distinguished Technologist &amp; Head, Networked Systems Group<br />Networking, IoT and Mobility Lab, Hewlett Packard Labs<br />Palo Alto, CA<br />@punwitter<br />",
      "id": "212111107140479456",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Puneet Sharma",
      "profile": "https://www.linkedin.com/in/puneetsharma/",
      "pub": "2017-03-27T16:50:26.249+02:00",
      "ref": "1175815808245554042",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "29 March 2017 22:01",
          "html": "Jeff,<br />While there are some similarities to Rspecs, Tspecs etc. from Intserv, ATM etc. there are significant differences also. The key distinction is notion of Intent. While applications need to express intent, it has to be decoupled from network (including control, whether centralized or not) that has the job of translating the intent into actual network configurations and such. Such decoupling is key to optimizing network resource utilization while maximizing the app utility.",
          "id": "448428480757731838",
          "image": "https://resources.blogblog.com/img/blank.gif",
          "name": "Puneet Sharma",
          "profile": "https://www.linkedin.com/in/puneetsharma/",
          "pub": "2017-03-29T22:01:35.266+02:00",
          "ref": "3673935554122469401",
          "type": "comment"
        },
        {
          "date": "30 March 2017 17:05",
          "html": "Understood and the post intent translation process would be great to have. However, the question is how do you fairly arbitrate the expression of intent across application classes(IoT et al)to prevent starvation, an unexpected priority over &quot;intents&quot;, intent overrun or a misunderstood expression of intent of a wayward application?  Think of the original Ethernet CSMA/CD FSM, the CS portion could be considered expressions of &quot;intent&quot; as well as the preamble. Or 802.11e which is just a manipulation of timing to allow that intent to proceed just a nick in time before the others. Do we signal from applications to the central point just for the central point to build/enforce the intent onto the network which could have scaling implications, or continue to let all the applications first come, best effort network access and let the utility plumbing and protocols of the network continue to do what it does well and somewhat fair today?  I think the big challenge is always that first part of arbitration and fairness aspect and not the post portion( with automation these days to send the requisite config changes as well as plenty of bandwidth). If bandwidth continues to increase and get cheaper, at the same time improvements to protocols congestion handling TCP or web protocols http2 and html5 such built into the plumbing protocols advances combined with bandwidth(which is decoupled to begin with) may render the need for a central expression of intent based system to specific use cases only. I believe such as semi-central but decoupled system with a form of expressed intent was available in one form with Token-Ring&#39;s mac fsm coupled with an SNA or APPN solution on top in the past.  Sometimes looking back into older protocols can provide glimpses of future protocols. ",
          "id": "5562101929693621403",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "jsicuran",
          "profile": "https://www.blogger.com/profile/07267516785767923381",
          "pub": "2017-03-30T17:05:02.212+02:00",
          "ref": "3673935554122469401",
          "type": "comment"
        }
      ],
      "date": "27 March 2017 21:49",
      "html": "Puneet, I have seen a demo of HP and Skype SDN example, not bad. However,- Application-Driven Automated QoS provisioning in SDN and Network Intent -  reminds me of a different flavor of a centralized control/signaling based protocol - resource reservation protocol or IntServ. That concept was that applications can provide near(yes ATM VP/VC setup between them) to guarantee the application&#39;s latency etc.  I understand there is NO silver bullet here. Sometimes it seem that industry  flops around on weather we do or don&#39;t  want the network to be &quot;application agnostic&quot;. ",
      "id": "3673935554122469401",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "jsicuran",
      "profile": "https://www.blogger.com/profile/07267516785767923381",
      "pub": "2017-03-27T21:49:53.909+02:00",
      "ref": "1175815808245554042",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "28 March 2017 07:58",
          "html": "If you&#39;re referring to the &quot;explain to the CFO&quot; part, then yes, it was a gross underestimation of the effort.<br /><br />If however you&#39;re referring to the &quot;simple approach&quot; then IMHO everything else is orders of magnitude more complex.",
          "id": "3610830896757935524",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2017-03-28T07:58:26.665+02:00",
          "ref": "861411938492649706",
          "type": "comment"
        }
      ],
      "date": "28 March 2017 01:51",
      "html": "&gt; explain to her how using a simple approach like the one above will reduce the network complexity and consequently CapEx and OpEx.<br /><br />IMO this sounds much simpler than it really is.",
      "id": "861411938492649706",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Dmitri Kalintsev",
      "profile": "https://www.blogger.com/profile/16576726865924052243",
      "pub": "2017-03-28T01:51:31.347+02:00",
      "ref": "1175815808245554042",
      "type": "comment"
    },
    {
      "date": "30 March 2017 05:58",
      "html": "I give them credit for having taken what seems like a good approach, but I&#39;m afraid that this will be just like many of the other advanced Cisco features that have been introduced in the last few years...prioritized over basic stability and functionality and then discarded when the next flavor of the month rolls into town. As far as Cisco wireless goes I&#39;d settle for basic stability....20% of our access points reboot daily when AC is turned on with no resolution in 6 months of working with them. ",
      "id": "6135927638704884017",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Unknown",
      "profile": "https://www.blogger.com/profile/16534090494053233593",
      "pub": "2017-03-30T05:58:12.785+02:00",
      "ref": "1175815808245554042",
      "type": "comment"
    }
  ],
  "count": 7,
  "id": "1175815808245554042",
  "type": "post",
  "url": "2017/03/cisco-and-apple-agree-qos-marking-is.html"
}