{
   "comments": [
      {
         "comments": [
            {
               "date": "31 March 2017 09:57",
               "html": "Somewhat true, but don&#39;t think of centralized storage in the incumbent vendor way. With the flash technology being  affordable, there are new vendors that have products that can surpass HCI in performance,cost, simplicity, ... perspectives.",
               "id": "2291181528526147789",
               "image": "https://1.bp.blogspot.com/-t7WFl-FLJkw/WsnLfFUJfNI/AAAAAAAALqk/vMnhi7E4CQwCW9uQ-_pfCs_OsM2O9jMxACK4BGAYYCw/s32/2012-img-mitja-small.jpg",
               "name": "Mitko",
               "profile": "https://www.blogger.com/profile/17252322269397556994",
               "pub": "2017-03-31T09:57:49.929+02:00",
               "ref": "4842279720106006805",
               "type": "comment"
            }
         ],
         "date": "30 March 2017 12:01",
         "html": "Another advantage is relative ease of scaling up storage (both size and performance) since you add storage by adding a node to the cluster.<br /><br />So instead of sizing your centralized storage you can start small and expand in time.<br /><br />Edwin de Graaf",
         "id": "4842279720106006805",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2017-03-30T12:01:14.037+02:00",
         "ref": "6553564659707385679",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "31 March 2017 10:00",
               "html": "Agree.It all depends on where/what you&#39;d use it for. And everything that glitters is not gold.As mentioned in the reply above new storage vendors can surpass HCI in performance, costs (not only CAPEX but OPEX), simplicity, ... perspectives.<br />And last but not least, disk based storage is like buying steam train in the age of electric cars ;)",
               "id": "5415876445148007165",
               "image": "https://1.bp.blogspot.com/-t7WFl-FLJkw/WsnLfFUJfNI/AAAAAAAALqk/vMnhi7E4CQwCW9uQ-_pfCs_OsM2O9jMxACK4BGAYYCw/s32/2012-img-mitja-small.jpg",
               "name": "Mitko",
               "profile": "https://www.blogger.com/profile/17252322269397556994",
               "pub": "2017-03-31T10:00:38.650+02:00",
               "ref": "241910395882581721",
               "type": "comment"
            }
         ],
         "date": "30 March 2017 18:51",
         "html": "I don’t know, maybe I’m just a grumpy old sysadmin, but I find HCI to be a tad over rated.  I think anyone that’s being honest with themselves is only picking HCI because it makes the admins life “easier”, but it’s not even close to being more cost efficient, performant or scalable compared to the good ‘ol three tier architecture (i.e. SAN).  <br /><br />Storage and compute now must scale together.  Yes, you can have storage heavy and compute heavy nodes, but then that starts making things not only more confusing, but also potentially less performant (depends on the solution).  Storage and compute now must share a life cycle, and that sucks.  I replace my storage maybe every 5 years, I replace my compute every 2 – 4.  Compute and storage now become a tier all together.  Meaning if you want spinning disk and all flash, you need different clusters.  That terribly inefficient from a compute cost perspective.  The number of nodes you need to have a reasonable level of resiliency is at least three, one + n2. <br /><br />For me, I’m gonna stick with Nimble Storage, Pure Storage, or any other shared storage solution that lets me keep my various infrastructure layers separate and scale independently as needed.  I’d bet a good steak, my infrastructure performs better and costs less too.<br /><br />That said, VDI and web scale are the two areas where I WOULD run HCI, but I would need a pretty massive environment for it to be worth it.  SMB’s or smaller sites may also be another good fit.  Full size enterprise though, I think SAN/NAS still makes more sense.  <br />",
         "id": "241910395882581721",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Eric Singer",
         "profile": "https://www.blogger.com/profile/09899058943394399795",
         "pub": "2017-03-30T18:51:06.842+02:00",
         "ref": "6553564659707385679",
         "type": "comment"
      }
   ],
   "count": 2,
   "id": "6553564659707385679",
   "type": "post",
   "url": "2017/03/q-what-is-hyperconverged-infrastructure.html"
}
