{
  "comments": [
    {
      "comments": [
        {
          "date": "29 March 2017 18:30",
          "html": "I have no idea what you&#39;re talking about :D but some APIs were never open. To get them you had to sign NDA in blood ;))",
          "id": "1252300068421293339",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2017-03-29T18:30:31.099+02:00",
          "ref": "2794048635335218384",
          "type": "comment"
        },
        {
          "date": "30 March 2017 08:36",
          "html": "Ok, &quot;open-to-partners&quot; ;)<br /><br />However open it was though, they plan to close that door completely. I believe it will hurt everybody in the long run.<br /><br />Also, one can imagine tense negotiations going on right now in some smoke-filled room. In a few weeks some news should emerge, at least on what CVendor will do. Last time (when v6 was released) there was some unease too for about a week or two, but they&#39;re reached some agreement and a &quot;new&quot; Nx1k was released",
          "id": "2596363766273738785",
          "image": "https://resources.blogblog.com/img/blank.gif",
          "name": "Denis",
          "profile": "https://askbow.com",
          "pub": "2017-03-30T08:36:14.018+02:00",
          "ref": "2794048635335218384",
          "type": "comment"
        }
      ],
      "date": "29 March 2017 17:31",
      "html": "I lost track of who&#39;s manufacturing what in that story (a picture would be of much help), but it&#39;s great=)<br /><br />Personally, I hope that reason will prevail and they&#39;ll drop the plans to abandon sort-of-open-API.<br />If nothing else, there should be some game-theoretical incentive for them to remain open and compatible.",
      "id": "2794048635335218384",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Denis",
      "profile": "https://askbow.com",
      "pub": "2017-03-29T17:31:11.502+02:00",
      "ref": "8841846492834860042",
      "type": "comment"
    },
    {
      "date": "30 March 2017 01:06",
      "html": "If they go through with this, I predict a huge falling out between Esxcellent Cars and San Fran Trains. Hyper Velocity Cars will vocally commit to partnership with San Fran Trains in order to capture the market of people who like train-engine cars.<br /><br />Esxcellent Cars continues to do business from the stance that they&#39;re the only car manufacturer option for serious car drivers, write terrible fleet contracts, and vary their pricing randomly without notice. At some point the market will notice that Hyper Velocity Cars and the newer modular boat options actually provide viable alternatives to the Esxcellent monopoly, and they&#39;ll have a massive reality check as their customers flee to competitors who are easier to do business with.",
      "id": "1118405622050278209",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Gabriel",
      "profile": "https://www.blogger.com/profile/08046068406445557020",
      "pub": "2017-03-30T01:06:57.896+02:00",
      "ref": "8841846492834860042",
      "type": "comment"
    },
    {
      "date": "30 March 2017 08:53",
      "html": "Oceanic Trains realised it would be unable to compete with diesel-engine cars. So they used their influence with local government to change the transport regulations to exclude diesel-engine cars on the grounds that they are anti-competitive.<br /><br />Train Systems Incorporated is releasing a new product line to meet customers needs. It is a dual-engine train that can switch between diesel and electric operating modes as required. It does require the implementation of Train Systems&#39; new track system. This new product line will cover all the customers needs in the current changing market space. ",
      "id": "4677083233835175319",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Alex",
      "profile": null,
      "pub": "2017-03-30T08:53:01.334+02:00",
      "ref": "8841846492834860042",
      "type": "comment"
    },
    {
      "date": "13 April 2017 20:02",
      "html": "The Mont Cenis Pass Railway was a really good example of this kind of stuff:<br />https://en.wikipedia.org/wiki/Mont_Cenis_Pass_Railway#Mont_Cenis_Railway_Company<br /><br />several independent factors led to the whole thing being a bankrupt boondoggle, but it proved the concepts of the Fell mountain railway system that went on to be used successfully in several other applications.",
      "id": "8726499645452908723",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Blake",
      "profile": "http://l33.fr",
      "pub": "2017-04-13T20:02:50.090+02:00",
      "ref": "8841846492834860042",
      "type": "comment"
    }
  ],
  "count": 6,
  "id": "8841846492834860042",
  "type": "post",
  "url": "2017/03/railroads-and-cars-fairy-tale.html"
}