{
  "comments": [
    {
      "comments": [
        {
          "date": "15 August 2013 19:36",
          "html": "I&#39;m not trying to overvalue myself (or any other networking engineer) - I was saying that networking is nothing more than plumbing (the less you see it, the better it works) more than a decade ago. <br /><br />The point I&#39;m trying to make is that it&#39;s wrong to try to solve the application problems with networking kludges - you always get hurt in the long term.",
          "id": "784772815530371007",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2013-08-15T19:36:49.144+02:00",
          "ref": "8989572102521789659",
          "type": "comment"
        },
        {
          "date": "15 August 2013 20:33",
          "html": "Right.  The key terms being &quot;application problems&quot; and &quot;networking kludges&quot;<br /><br />We should be meeting &quot;application needs&quot; with flexible &quot;network solutions&quot;.  <br /><br />Historically it hasn&#39;t been possible to find anyone who knew what the network needs of an application really were until after it was live on the network already built based on guesses of needs.  If the needs didn&#39;t match the guesses there were only 2 options 1) Hardware level redesign or 2) the aforementioned &#39;kludge&#39;  And even when the kludges worked they were just as inflexible to changes in application need as the original design guess. <br /><br />Then some kludges become over hyped fads. <br /><br />I see a future where applications can be monitored and the network can respond to these applications even down to the layer 1 level.  There are many computer models in other industries and I don&#39;t see anything about a network that makes them harder to then model bridges or weather.  It just hasn&#39;t been done before because the network was so static at a physical level and the applications were dynamic. In such a world it was good enough to guess and over build.<br /><br />We&#39;re not there today.  But I think we are starting to see beginnings of this.  We&#39;re getting to the point that automation in both network and applications are becoming cheap enough to where they can respond to each other, if we just had the right models behind them.  <br /><br />I&#39;m a network engineer today, but if I see automation headed my way, I best understand it, so I&#39;m on the right side when the smoke clears. <br /><br />(I should probably say at this point my opinions probably do NOT reflect those of my employer)",
          "id": "4222598063284463907",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "John Jackson",
          "profile": "https://www.blogger.com/profile/14047803952264243329",
          "pub": "2013-08-15T20:33:58.487+02:00",
          "ref": "8989572102521789659",
          "type": "comment"
        },
        {
          "date": "15 August 2013 20:37",
          "html": "And we&#39;re yet again in perfect agreement ;)",
          "id": "8911488283215357408",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2013-08-15T20:37:24.983+02:00",
          "ref": "8989572102521789659",
          "type": "comment"
        },
        {
          "date": "15 August 2013 23:55",
          "html": "Ivan, thank you for responding to my post, having opinions and discussions is what progresses our solutions.<br /><br />I could not have said it better than John&#39;s response.<br /><br />Every demand based system in the world has a model of the needed demand. Some crude, some very sophisticated. We can do so much better than throwing bandwidth and even distribution of traffic at the problem.  There is no reason the network needs to be as static as plumbing. We have L1, L2 and L3 abilities to direct traffic (heck we use them today, but only in the most simplistic way). And it does not have to be more expensive at all. Just smarter.",
          "id": "8709932120344173161",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Unknown",
          "profile": "https://www.blogger.com/profile/17332987438325943763",
          "pub": "2013-08-15T23:55:44.797+02:00",
          "ref": "8989572102521789659",
          "type": "comment"
        }
      ],
      "date": "15 August 2013 19:23",
      "html": "But the cost of re-engineering the network (even down to layer 1 see plexxi)  could be falling.  Maybe falling to the point of being automated (see SDN)<br /><br />We as network engineer maybe should be careful not to overvalue ourselves to the point of being neo-luddites. ",
      "id": "8989572102521789659",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "John Jackson",
      "profile": "https://www.blogger.com/profile/14047803952264243329",
      "pub": "2013-08-15T19:23:16.017+02:00",
      "ref": "8579598101406893303",
      "type": "comment"
    },
    {
      "date": "18 August 2013 19:43",
      "html": "Good conversation. But won&#39;t we eventually run into the fact that a packet-switched network is fundamentally a shared resource? Trying to optimize for all applications and variables at once will eventually lead us into a condition where some application needs are mutually exclusive of one another. Now, obviously, this would depend on the specific mix of applications on any given network. <br /><br />My point being, our networks should definitely be smarter, flexible and more dynamic than they are today. But we can never truly meet every applications needs at once and will have to still make compromises and set priorities. But we can get closer ;)<br /><br />Cheers,<br />Andrew ",
      "id": "2245101989229920716",
      "image": "https://2.bp.blogspot.com/_F0xKISdTaPM/TQbno5MuvLI/AAAAAAAACDs/n4Ptvn7lPBU/S220-s32/Professional_Pic1_crop.jpg",
      "name": "Andrew von Nagy",
      "profile": "https://www.blogger.com/profile/12658799453646609565",
      "pub": "2013-08-18T19:43:17.889+02:00",
      "ref": "8579598101406893303",
      "type": "comment"
    },
    {
      "date": "19 August 2013 15:28",
      "html": "Andrew, no disagreement. The network will have limits, but there are most certainly applications, or groups of applications that have specific needs, where others are far less picky. <br /><br />And because every network is different, every application mix is different, the user&#39;s requirements are different, we need to create a solution that can dynamically adjust to what is best given the resources and needs.<br />",
      "id": "1679870009925941918",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Unknown",
      "profile": "https://www.blogger.com/profile/17332987438325943763",
      "pub": "2013-08-19T15:28:29.682+02:00",
      "ref": "8579598101406893303",
      "type": "comment"
    },
    {
      "date": "19 August 2013 21:29",
      "html": "Great posts Ivan, Marten, Andrew and John, in spirit of the discussion this article also lends credence to this topic with all the overlaying and masking that seems to be going on lately<br />http://www.networkworld.com/community/blog/battle-hypervisor-switch-and-future-networking<br /><br /><br />How agnostic is the network supposed to be or can it? Are we evolving further where the “plumbing” acts on intelligence in the packet(supplied from the app.) to enhance the app.(network inspects) or is the plumbing overlaid with the ability to act on the app. (in plumbing OS/ASIC or SDN magic) to enhance the app’s service without app level inspection?  Another view is does the app. “pop” in the plumbing’s acting upon inspection element or does the plumbing just inspect the apps flow/stream to then “pop” in the data element for the rest of the plumbing to act upon to enhance the app’s service? Then is the app’s services enhanced hop by hop or pre planned/provisioned end to end for flow at ingress(again in plumbing at ASIC or SDN magic). <br /><br />“The point I&#39;m trying to make is that it&#39;s wrong to try to solve the application problems with networking kludges - you always get hurt in the long term.”<br />Ding a winter! LOL…<br /><br />One old adage I used to state in the early days was  &quot;are you designing your applications around the network or designing your network around your applications?  DNP and SCADA type protocols come to mind when used in IP networks. <br /><br />Philosophical tug always…<br /><br />Regards…<br />",
      "id": "2477177273954567152",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Jsicuran",
      "profile": "http://www.amilabs.com",
      "pub": "2013-08-19T21:29:21.251+02:00",
      "ref": "8579598101406893303",
      "type": "comment"
    }
  ],
  "count": 8,
  "id": "8579598101406893303",
  "type": "post",
  "url": "2013/08/we-should-teach-network-how-to-serve.html"
}