{
  "comments": [
    {
      "date": "14 June 2010 22:43",
      "html": "The best information about EIGRP MTU so far in the internet, and even on books, cause they always say that MTU is not used at all for calculation(and its not) and thats all, no one really explains the actual meaning of it. Finally someone really explained the meaning of the MTU value on EIGRP, thanks !",
      "id": "7823608127428219536",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "GFC",
      "profile": null,
      "pub": "2010-06-14T22:43:46.000+02:00",
      "ref": "9011099034634102372",
      "type": "comment"
    },
    {
      "date": "10 February 2011 22:43",
      "html": "thanks for answering my question! :-)",
      "id": "5777009529299201371",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "shook",
      "profile": null,
      "pub": "2011-02-10T22:43:03.000+01:00",
      "ref": "9011099034634102372",
      "type": "comment"
    },
    {
      "date": "28 February 2012 19:24",
      "html": "Hello Ivan,  <br /> <br />I hope this message reaches you. I have tried to verify the assumption about MTU being a tie-breaker in path selection on a lab gear but to my dismay, manipulating the MTU had no effect whatsoever on EIGRP&#39;s path selection - whether it were equal-cost best paths or equal-cost feasible successor paths, both with and without the &quot;maximum-metric&quot; command.  <br /> <br />After talking to a gentleman from Cisco closely involved with EIGRP, he confirmed that the idea of using MTU was considered but never really implemented.  <br /> <br />So I wonder... is there any document that would say otherwise? Alternatively, do you have a suggested test config that worked for you?  <br /> <br />The issue of MTU in EIGRP is admittedly a neverending story... :-D  <br /> <br />Best regards,  <br />Peter Palúch  <br />CCIE #23527 R&amp;S, CCIP, Cisco CSC Designated VIP 2011-2012",
      "id": "9150630783115208789",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Peter Palúch",
      "profile": null,
      "pub": "2012-02-28T19:24:05.054+01:00",
      "ref": "9011099034634102372",
      "type": "comment"
    },
    {
      "date": "28 February 2012 20:38",
      "html": "I vaguely remember doing actual tests with 12.4 (or so) code. You have to make sure you have more than &quot;maximum-metric&quot; equal-cost paths and that the MTU in the EIGRP topology database is correct (it&#39;s not updated if you change MTU on the interface).",
      "id": "286716708042990836",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ivan Pepelnjak",
      "profile": null,
      "pub": "2012-02-28T20:38:13.429+01:00",
      "ref": "9011099034634102372",
      "type": "comment"
    },
    {
      "date": "28 February 2012 21:03",
      "html": "Hello Ivan,<br /><br />Thank you very much for responding.<br /><br />I made sure from the beginning that all you suggested was the case - more routes than allowed by &quot;maximum-paths&quot;, MTU being correctly reflected in EIGRP topology database and properly shown even in the &quot;show ip route X.X.X.X&quot; output afterwards. However, the results stand - the MTU does not appear to have any effect. The timing may have contributed to the confusion here - sometimes the routing table displayed the routes with the highest available MTUs, but disabling an interface on a path with a high MTU and reenabling it later did not cause the EIGRP to reinstate the route with the highest available MTU - the existing routes simply stayed in the routing table and were not preempted by higher-MTU paths.<br /><br />Any ideas?<br /><br />Best regards,<br />Peter",
      "id": "4490271435580644105",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Peter Palúch",
      "profile": null,
      "pub": "2012-02-28T21:03:50.913+01:00",
      "ref": "9011099034634102372",
      "type": "comment"
    },
    {
      "date": "03 March 2012 23:01",
      "html": "Ivan,<br /><br />I apologize for being tiresome here but I would be very, very thankful if you tried to reproduce your experiments - if you have some time to spare, of course. Cisco employees I talked to were absolutely adamant that there is no regard in EIGRP to the MTU in the best path selection process. I also could not see any effect of MTU on the path selection as I conducted my experiments, in alignment with your recommendations.<br /><br />Thank you very much!<br /><br />Best regards,<br />Peter",
      "id": "4206205813412868445",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Peter Palúch",
      "profile": null,
      "pub": "2012-03-03T23:01:02.532+01:00",
      "ref": "9011099034634102372",
      "type": "comment"
    },
    {
      "date": "28 November 2013 08:17",
      "html": "Пиздохен Шванц!<br />Thank you very much!",
      "id": "4851600774035279518",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Unknown",
      "profile": "https://www.blogger.com/profile/10459540729504830009",
      "pub": "2013-11-28T08:17:47.062+01:00",
      "ref": "9011099034634102372",
      "type": "comment"
    },
    {
      "date": "03 November 2015 11:36",
      "html": "According to CISCO this is correct, it is used as a tie breaker with equal cost paths. highest minimum MTU is preferred.",
      "id": "6692203805380974157",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2015-11-03T11:36:31.008+01:00",
      "ref": "9011099034634102372",
      "type": "comment"
    },
    {
      "date": "11 July 2017 12:32",
      "html": "I&#39;ve made a thorough test and got the following results:<br /><br />1. There is no MTU tie-breaker in best path selection algorithm. When several routes with same CD but different MTU exist in the topology table, only route age in the topology table serves as a tie-breaker: first come - first served. The order of receiving update matters only.<br /><br />1a. When a router receive a route with the same CD as the current successor, it just installs them in the RIB. If it cannot install the route in RIB because of maximum-paths limit, it just ignores the route disregarding its MTU. So the routes are installed simply in the order or receiving updates, even if the first updates had lower MTU.<br /><br />1b. Even if we reduce maximum-paths on the fly, the router prefers those routes that were received first, disregarding MTU.<br /><br />2. In some situations there is a correlation between MTU and received updates order, so better-MTU updates come first.<br /><br />2a. The effect is very weak. It&#39;s stronger on old IOSes; on newer hardware or virtual platforms I wasn&#39;t able to reproduce it.<br /><br />2b. It obviously depends on a topology.<br /><br />2c. I still cannot understand what causes this effect.",
      "id": "7444279328737349356",
      "image": "https://3.bp.blogspot.com/-IviEX3AE3jU/XacIjx7m__I/AAAAAAAAH18/LsHy1oO5CDI-ADjqKgG-8pVw3T_7WaaiQCK4BGAYYCw/s32/19-08-21-filonovawed-18-34-02-01.jpg",
      "name": "Innokentiy",
      "profile": "https://www.blogger.com/profile/17783635023339781751",
      "pub": "2017-07-11T12:32:02.619+02:00",
      "ref": "9011099034634102372",
      "type": "comment"
    }
  ],
  "count": 9,
  "id": "9011099034634102372",
  "type": "post",
  "url": "2010/06/eigrp-mtu-metric.html"
}