{
   "comments": [
      {
         "comments": [
            {
               "date": "12 August 2025 07:19",
               "html": "<p>&gt; I&#39;ve always used &quot;send-community both&quot; and, if I&#39;m not mistaken, this gets add to the config as that way.</p>\n\n<p>Correct, it always appears as &quot;both&quot; in the configuration (see the blog post). However, if you&#39;re configuring stuff through a template, it helps if you can configure one after another, and then have whatever in the config.</p>\n",
               "id": "2725",
               "name": "Ivan Pepelnjak",
               "pub": "2025-08-12T07:19:06",
               "ref": "2723",
               "type": "comment"
            }
         ],
         "date": "11 August 2025 10:10",
         "html": "<p>I&#39;ve always used &quot;send-community both&quot; and, if I&#39;m not mistaken, this gets add to the config as that way.\nI cannot remember that I&#39;ve ever seen &quot;send-community standard&quot; <em>and</em> &quot;send-community extended&quot; in any config. To me, it was always XOR &quot;both&quot; for both or &quot;standard&quot; / &quot;extended&quot; for one or the other only.</p>\n",
         "id": "2723",
         "name": " Christoph",
         "pub": "2025-08-11T22:10:03",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "12 August 2025 07:20",
               "html": "<p>&gt; I verified this on actual hardware on 17.18.01.</p>\n\n<p>Thanks for the confirmation.</p>\n\n<p>&gt; I don&#39;t know why we changed this [...] I&#39;ll see if I can find anything out.</p>\n\n<p>Thank you!</p>\n",
               "id": "2726",
               "name": "Ivan Pepelnjak",
               "pub": "2025-08-12T07:20:14",
               "ref": "2724",
               "type": "comment"
            }
         ],
         "date": "12 August 2025 02:39",
         "html": "<p>I verified this on actual hardware on 17.18.01.  Previous versions consolidate the two lines into one with the &quot;both&quot; keyword at the end.  Now the commands override each other.  If you enter standard first and then extended, extended is all you get.  If you go the other way, standard will override extended.  (Interestingly enough, even if you enter the &quot;standard&quot; keyword, it shows up in the config simply as &quot;neighbor x.x.x.x send-community&quot;.  I&#39;m not a huge fan of re-working the user-input syntax, but these commands are as old as time.)  You can still enter &quot;neighbor x.x.x.x send-community both&quot;.</p>\n\n<p>I don&#39;t know why we changed this.  I&#39;m pretty sure it&#39;s worked this way for as long as I&#39;ve been configuring BGP, and that&#39;s a long time.  I&#39;ll see if I can find anything out.</p>\n",
         "id": "2724",
         "name": " Jeff McLaughlin",
         "pub": "2025-08-12T02:39:45",
         "type": "comment"
      },
      {
         "date": "12 August 2025 09:08",
         "html": "<p>That reminds me of the old &quot;show queueing&quot; command misspelled for all of the 2000&#39;s on ciscos, then finally someone there decided to &quot;fix&quot; it later to &quot;queuing&quot; and broke some stat collection scripts I had used for a decade, not to mention retraining muscle memory when doing qos work later.</p>\n\n<p>Then again, Cisco stopped being consistent about, well seems like anything by the late 2000&#39;s anyways (ahem, nxos), if not particularly qos.</p>\n",
         "id": "2728",
         "name": "mikus",
         "pub": "2025-08-12T21:08:45",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2025/08/cisco-ios-community-propagation.html"
}
