{
   "comments": [
      {
         "comments": [
            {
               "date": "21 January 2026 07:42",
               "html": "<p>Hey, I expected you to disagree, but even the slides from the Tag Switching BOF talk, somewhere deep inside those proceedings you shared, focus primarily on performance and scalability, and the RFC 2105 was published in 1997, so one would hope they would have a clear picture by then.</p>\n\n<p>Anyway, Tag Switching appeared in the pre-7500 days when the best Cisco could offer was Cisco 7000 with the CBUS complex (peaking @ 500 Mbps according to https://newsroom.cisco.com/c/r/newsroom/en/us/a/y1995/m08/cisco-7500-series-boosts-routing-muscle-for-large-evolving-corporate-networks.html). Low-end ATM switches (Fore and Cisco&#39;s Lightstream 1010, which was indeed really late to the market) got to 5+ Gbps for a significantly lower price. Cisco 7500 (launched in 1995) got to 2.1 Gbps (same source), which was still 2.5 times slower than an entry-level ATM switch. StrataCOM switches were a totally different beast.</p>\n\n<p>I also won&#39;t argue that by the time someone finally decided to build a packet-forwarding label-switching linecard, the hardware was fast enough to make little difference between IP longest-prefix match and label lookup.</p>\n\n<p>I agree TE was one of the early use cases, but it was a static hop-by-hop list of IP addresses.  Constraint-based routing with IS-IS and OSPF came way later (a release or two after MPLS/VPN). The whole thing looked so ridiculous that I couldn&#39;t understand why anyone would be using it, until I was told some big ISPs periodically calculated explicit paths in a network management software and downloaded them to router configs.</p>\n\n<p>I also totally agree that for most people, the first useful use case was MPLS/VPN until we got to the &quot;OMG, full BGP table has hundreds of thousands of prefixes&quot; moment, at which point the BGP-free core started to look interesting.</p>\n",
               "id": "2857",
               "name": " Ivan Pepelnjak",
               "pub": "2026-01-21T19:42:04",
               "ref": "2856",
               "type": "comment"
            },
            {
               "date": "28 January 2026 05:48",
               "html": "<p>Label switching is routed in the old telephony network. You had the DCN and a network management node that calculated the various network paths. Then it loaded the routing tables into the telephony switches. The trunks had local labels that were used in those routing tables. This is the root of label switching solutions.</p>\n\n<p>Then we had the Synchronous Transfer Network (STM). Sonet/SDH and PDH in a hierarchy. ATM was just introducing a data plane with statistical multiplexing. But the logic was the same for some time as it was in telephony switches. </p>\n\n<p>In 1996 I had to build a network for the JENC conference from ATM equipment provided by 7 (!) different vendors. All my university colleagues escaped this challenge, so I had to build this metropolitan area network over Budapest with my 5th grade students.\nFrom those 7 vendors only one supported SVCs. All the others had only PVCs with static routing tables that had to be entered manually.</p>\n\n<p>When these telco vendors were forced to come up with some IP based solutions, they were quite happy to use label switching, since it was so similar to their previous voice and STM/ATM architectures. They just had to add a different control plane.</p>\n\n<p>Remember the Cisco acquired Stratacom ATM switches having a separate node as a PNNI controller for SVCs. The basic switch was still PVC based ATM with simple label switching.</p>\n\n<p>For the switch vendors label switching made it possible to create very simple core switches. BGP free was the selling term. The core switches could focus on forwarding performance using hardware acceleration and you could ignore the complexities of the usual MPLS/VPN IP control plane. </p>\n\n<p>But as the hardware improved, the original advantage of fast label lookups versus slow full IP address lookups and smaller memory needs faded away. </p>\n\n<p>After some years my colleagues even split the telco network into two parallel networks: a multi-service segment that is complicated, MPLS based, expensive, limited capacity and another separate cheap and simple, high-capacity flat IP network for public internet services without labels, MPLS and VPNs. This architecture practically killed the business case for the DT preferred Terrastream. It was so much simpler and cheaper...</p>\n\n<p>BTW, SDN with Openflow was just a recast of the old telephony network. PCE is another such revival...</p>\n",
               "id": "2863",
               "name": "Bela Varkonyi",
               "pub": "2026-01-28T17:48:04",
               "ref": "2857",
               "type": "comment"
            }
         ],
         "date": "21 January 2026 12:00",
         "html": "<pre>\nthe initial use case was improved forwarding performance \n(in particular, using ATM switches in IP network).\n</pre>\n\n<p>And I still don&#39;t agree.</p>\n\n<p>The idea for tag-switching started supposedly in 1995. I joined cisco engineering in the summer of 1996. The first tag-switching BOF at the IETF was in December 1996.  https://www.ietf.org/proceedings/37/  I was in Europe at the time (cisco&#39;s first over-sea&#39;s DE). So I am sure I wasn&#39;t as up-to-date as others.</p>\n\n<p>But this is what I heard: <br />\nLarge ISPs in the US were using an ATM underlay. Because they could do some form of TE in their ATM underlay. They paid Fore Systems a lot of money. Fore was the preferred ATM vendor at the time. Some people at cisco thought that money should go to cisco.  </p>\n\n<p>This is what I saw:\nIn 1996, Ipsilon was making a lot of noise with their &quot;IP Switching&quot;. MPLS killed Ipsilon.</p>\n\n<p>It turned out that the real killed-app for MPLS was BGP-MPLS-VPNs. That technology allowed the ISPs to sell a new service. And make lots of money off that service. I read somewhere (around 2012-2015) that 0.5% of ISPs worldwide were using MPLS-RSVP-TE. And 0.0% of enterprises worldwide. So imho, BGP-MPLS-VPNs is the only MPLS-related technology that really mattered.</p>\n\n<p>Of course everyone&#39;s first idea was: &quot;when you do index-based forwarding, that must be faster than a short-length prefix lookup&quot;. It turned out it wasn&#39;t. People knew this very early on. Before any MPLS product shipped. I knew it, and I&#39;ve never been involved with forwarding code myself. I&#39;m sure you still don&#39;t believe me. So have a look at what Bruce Davie wrote: <br />\nhttps://systemsapproach.org/2022/02/14/was-mpls-necessary/</p>\n\n<pre>\nThe idea of speeding up the lookup operation on an IP datagram turned out to\nhave little practical impact. We even went as far as designing a router line card\nthat could forward labeled packets only, to test this out. The line card was\nnegligibly cheaper than a full-blown IP forwarding card, and no faster, because\nby this point fast IP lookups, while not trivial, were largely a solved problem.\nBuffering, switching among line cards, optical transceivers, etc., were all more\nimportant to cost and performance than optimizing a few percent out of the\nlookup engine.\n</pre>\n",
         "id": "2856",
         "name": " Henk",
         "pub": "2026-01-21T12:00:54",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "26 January 2026 08:42",
               "html": "<p>&gt; what the heck is SRv6?</p>\n\n<p>Another attempt to develop a unifying standard (see https://xkcd.com/927/)? On a more serious note, if you use it like you&#39;d use MPLS paths or as the second label in L3VPN, it&#39;s pretty similar to MPLS and doesn&#39;t create interfaces on (some) network devices. Obviously, you could also use it to create tunnels...</p>\n",
               "id": "2861",
               "name": " Ivan Pepelnjak",
               "pub": "2026-01-26T08:42:03",
               "ref": "2860",
               "type": "comment"
            }
         ],
         "date": "25 January 2026 07:45",
         "html": "<p>Having read the MPLS is not tunneling article it makes perfect sense to me, but then, what the heck is SRv6 lol. Seems like a mix of both if I understand it right</p>\n",
         "id": "2860",
         "name": " Scoopta",
         "pub": "2026-01-25T19:45:58",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2026/01/mpls-paths-tunnels-interfaces.html"
}
