{
   "comments": [
      {
         "comments": [
            {
               "date": "26 November 2025 06:08",
               "html": "<p>Thank you, Bogdan. Would you be so kind and provide topologies and initial configs for the exercises you suggested? </p>\n",
               "id": "2806",
               "name": " Dan Partelly",
               "pub": "2025-11-26T18:08:23",
               "ref": "2804",
               "type": "comment"
            },
            {
               "date": "27 November 2025 08:27",
               "html": "<p>I work for Tetra &amp; Astro business (kind a mobile networks targeted for public safety). </p>\n\n<ol>\n<li><p>Moving multicast source.  I would try from two router topology where router a is an RP router for PIM-SM mode. So you need to enable this capability on a router A and in simple case you need to point out this RP service on a router B. Establish multicast communication from LAN segment attached to the router B and receivers connected to a router B. Once working start to generated multicast from a source attached to B. Preserve multicast group (and stop sourcing multicast from a a segment attached to A). This scenario reflects moving source (kinda BTS roaming where BTS is packetizing audio from a mobile radio).\nI know it&#39;s complex scenario but real in some kind of networks.</p></li>\n<li><p>Single router corner cases. In this scenario FHR = LHR. It resembles the second part of the excercise 1. Why interesting? Because you cannot see PIM-REG encap packets as the host sourcing multicast is directly connected to the RP. Still thinking about PIM-SM here.</p></li>\n<li><p>Add redundancy. Dual routers potentially delivering multicast for a segment. Test cases when DR crashes. Sniff how many packets are lost. The networks I work with need to re-converge within max 1.5sec. Seems to be easy. But not for budget-constrained solutions.</p></li>\n</ol>\n\n<p>The scenarios about at his basic level can be configured but enabling PIM-SM, static RP config + PIM Anycast for the redundancy purpose.</p>\n\n<p>I know it is pretty unique purpose but challenging.</p>\n",
               "id": "2807",
               "name": "BOGDAN GOLAB",
               "pub": "2025-11-27T08:27:15",
               "ref": "2806",
               "type": "comment"
            }
         ],
         "date": "26 November 2025 10:35",
         "html": "For those who want to play with true real life scenarios I would suggest just a few examples:<br />\n-adding failure &amp; recovery scenarios to see multicast if the traffic is rerouted, and how quickly (very important when you use multicast for real time communication)<br />\n-using topology where we could see some example of &#39;corner cases&#39; like FHR (the router facing the source) is the same as the LHR(the router facing receivers) - this can be really interesting<br />\n-testing the moving source of the multicast i.e. the host sourcing the multicast move to different part of the tree (nothing unique in mobile networks I work with)<br />\n\n<p>Academic style examples like the mentioned ones are good for students of course.</p>\n\n<p>Every major router vendor claims that they mastered the multicast technology before entering the true multicast business;)</p>\n",
         "id": "2804",
         "name": "BOGDAN GOLAB",
         "pub": "2025-11-26T10:35:38",
         "type": "comment"
      }
   ],
   "count": 1,
   "type": "post",
   "url": "2025/11/worth-reading-netlab-multicast.html"
}
