{
   "comments": [
      {
         "comments": [
            {
               "date": "13 October 2022 08:36",
               "html": "<p>&gt; If ABR changed the advertising router as the question states you would abstract the true cost to reach the ASBR</p>\n\n<p>No you wouldn&#39;t. You would have to add the ABR-to-ASBR cost to the external cost, or have two components of external cost if you wanted to have E1/E2 routes. Inter-area summaries work in exactly that way.</p>\n",
               "id": "1438",
               "name": "Ivan Pepelnjak",
               "pub": "2022-10-13T08:36:46",
               "ref": "1437",
               "type": "comment"
            },
            {
               "date": "14 October 2022 04:41",
               "html": "<p>&gt;You would have to add the ABR-to-ASBR cost to the external cost</p>\n\n<p>Well, that hypothetical wasn&#39;t stated in the question but in that case you either abstract / mutate / lie about the true external metric or you need LSA 5 re-format (2 component).  In either case you remove potentially useful detail from some nodes&#39; view of the network (AS external router ID and/or true ext metric).  But as the question is written, you remove true cost to reach ASBR.  All of this seems to undermine the goals of a graph based / link state / intelligent distributed solution.</p>\n",
               "id": "1442",
               "name": " Jeff Behrns",
               "pub": "2022-10-14T04:41:17",
               "ref": "1438",
               "type": "comment"
            }
         ],
         "date": "13 October 2022 04:06",
         "html": "<p>if ABR changed the advertising router as the question states you would abstract the true cost to reach the ASBR.  That defeats fundamental purpose of an IGP.  Moy et al probably would have gazed in awe of the question. \nToday it seems people have become so accustomed to BGP as the ONE solution to all problems that we see questions like &quot;Why doesn&#39;t my IGP behave like BGP?&quot;  When does the BGP camel&#39;s back break?</p>\n",
         "id": "1437",
         "name": " Jeff Behrns",
         "pub": "2022-10-13T04:06:52",
         "type": "comment"
      },
      {
         "date": "16 November 2022 06:28",
         "html": "<p>Clean LSDB helps loop prevention so hiding originator makes it more difficult to achieve free loop routing across areas. No?</p>\n",
         "id": "1514",
         "name": " Andrei",
         "pub": "2022-11-16T06:28:58",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2022/10/ospf-external-routes.html"
}
