{
   "comments": [
      {
         "comments": [
            {
               "date": "04 October 2022 02:13",
               "html": "<p>&gt; We underestimated the fact that infrastructure is a value differentiator for many and that customization and rapid change don&#39;t go hand in hand with automation.</p>\n\n<p>Which, if sold right, can be a good thing. I&#39;ve called this &quot;inflexible flexibility&quot;. We can do absolutely anything, but it&#39;ll take some effort to add it to the data model and tool chain that generates the configurations. After that, it&#39;ll be 100% supported and won&#39;t ever be something that only the one engineer that implemented the one instance knows about, catching someone else off guard at 2am when it breaks. It means no more one-ofs, and that changes are inherently documented at the very least by merit of being part of a codebase with a commit that can be tracked down.</p>\n\n<p>I have sometimes gotten some pushback on how this is inherently less nimble since it takes longer than just throwing a manual config at a problem, but so far haven&#39;t had any issues with the counterargument that we don&#39;t want untested configuration changes, and that developing a new feature for the automation process doesn&#39;t take <em>much</em> longer than properly testing a new configuration in a lab before rolling it out. The additional time is easily made up by the increased reliability of the change being executed a second time (where I mean reliability in the sense of &quot;the customer expected the change to work the first time&quot;). Of course, this partly depends on how your exact automation process. Ours is amenable to fairly rapid changes, because our campus network is quite dynamic.</p>\n\n<p>Yes, having to run everything through an automation pipeline is less rapid than just ssh&#39;ing into a box and typing away. But it doesn&#39;t have to be much less rapid if your staff is skilled, and raising the bar to entry for a change can often mean an opportunity for evaluation on whether the work <em>should</em> be done, which is a very different question than whether it <em>can</em> be done.</p>\n",
               "id": "1422",
               "name": " felix",
               "pub": "2022-10-04T14:13:57",
               "ref": "1421",
               "type": "comment"
            },
            {
               "date": "05 October 2022 07:13",
               "html": "<p>If the problem is well known you can apply rules to it (automation). The problem with networking is that it results in a huge number of cases that are not known in advance. And i don&#39;t mean only the stuff you add/remove to fix operational problems. A friend in one of the biggest private clouds was saying that more than 50% of transport services are customized (a static route here, a pbr there etc) or require customization during their lifecycle (e.g. add/remove a knob). Telcos are &quot;worse&quot; and for good reasons. </p>\n\n<p>It is no coincidence that one of the coolest features claimed by network provisioning tools is the ability to reconcile with the ground truth.</p>\n\n<p>&quot;more automation&quot;, &quot;fix your pipelines&quot;, &quot;fix your culture&quot;, &quot;FAANGs do it&quot; is the usual reaction but i doubt it takes people 10 years (or more since this conversation started) to learn to write yaml templates and playbooks :)</p>\n",
               "id": "1426",
               "name": "kon naf",
               "pub": "2022-10-05T19:13:03",
               "ref": "1422",
               "type": "comment"
            }
         ],
         "date": "04 October 2022 10:57",
         "html": "<p>i think there is a more fundamental reason than the (in my opinion simplistic) lack of skills argument. As someone mentioned on twitter</p>\n\n<p>&quot;Rules make it harder to enact change. Automation is essentially a set of rules.&quot;</p>\n\n<p>We underestimated the fact that infrastructure is a value differentiator for many and that customization and rapid change don&#39;t go hand in hand with automation.  </p>\n",
         "id": "1421",
         "name": " kon",
         "pub": "2022-10-04T10:57:00",
         "type": "comment"
      }
   ],
   "count": 1,
   "type": "post",
   "url": "2022/10/repost-whats-wrong-network-automation.html"
}
