{
   "comments": [
      {
         "comments": [
            {
               "date": "29 November 2024 05:26",
               "html": "<p>Couldn&#39;t agree more ;) Unfortunately, IETF had the opportunity to fix stuff in the TCPv6 WG, but squandered it.</p>\n",
               "id": "2469",
               "name": "Ivan Pepelnjak",
               "pub": "2024-11-29T17:26:57",
               "ref": "2467",
               "type": "comment"
            }
         ],
         "date": "29 November 2024 08:43",
         "html": "<p>This is not an IPv4 or IPv6 specific problem. This is based on the missing separation of a locator from an identifier. \nAny scheme that provides such a separation would solve the multi-homing issue. Even mobility would become easy for hosts as well for networks. </p>\n\n<p>This is a very old problem already existing with telephony networks.\nNow we have number portability to solve the issue. It is not nice, but in daily use...</p>\n",
         "id": "2467",
         "name": "Bela Varkonyi",
         "pub": "2024-11-29T08:43:46",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "29 November 2024 05:29",
               "html": "<p>I would go as far as saying that the &quot;evolution of culture&quot; was caused by networking MacGyvers, a total lack of any engineering discipline, and vendors pushing overly complex solutions to create lock-in.</p>\n\n<p>Alas, we are where we are...</p>\n",
               "id": "2470",
               "name": "Ivan Pepelnjak",
               "pub": "2024-11-29T17:29:11",
               "ref": "2468",
               "type": "comment"
            }
         ],
         "date": "29 November 2024 08:48",
         "html": "<p>You have also mentioned it before, that if programmers could use symbolic names and name resolution (e.g., DNS), then this problem could be solved outside of the network layer.\nHowever, the culture evolved differently and now we are forced to solve problems in the network layer, they would be better to be solved in other layers.</p>\n\n<p>That all comes from the over simplifications of early IETF efforts. ITU-T has much better and cleaner approach to network architecture. G.805 and G.809 should be taught first to all network professionals, not the OSI model or the IETF layered model. </p>\n",
         "id": "2468",
         "name": "Bela Varkonyi",
         "pub": "2024-11-29T08:48:28",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "02 December 2024 05:32",
               "html": "<p>What you&#39;re describing is the simplest possible scenario and works only if (A) you&#39;re OK with primary/backup setup, (B) you&#39;re OK with session loss after link failure (due to loss of outside IPv6 prefix), and (C) your hosts are OK with deprecating IPv6 prefixes immediately (that wasn&#39;t the case the last time I looked, but admittedly I stopped caring about IPv6 quirks years ago).</p>\n\n<p>Anyway, do check the scenarios described in the I-D. You might also enjoy the <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7267864187203203072/\">LinkedIn comments</a>.</p>\n",
               "id": "2472",
               "name": "Ivan Pepelnjak",
               "pub": "2024-12-02T17:32:35",
               "ref": "2471",
               "type": "comment"
            }
         ],
         "date": "02 December 2024 11:05",
         "html": "<p>I&#39;m not sure I understand the problem? What I mean is that in my experience, at least with OpenWRT you can do multi-wan without NAT, it&#39;s pretty trivial to setup too. If you use interface tracking to setup the LAN side of your firewall then OpenWRT will automatically deprecate the prefix from the wan that goes down causing all clients to automatically switch to preferring the prefix for the other WAN. Is this feature not common among other firewalls? Is there something I&#39;m not understanding?</p>\n",
         "id": "2471",
         "name": " Scoopta",
         "pub": "2024-12-02T11:05:30",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2024/11/ipv6-multihoming-draft.html"
}
