{
   "comments": [
      {
         "comments": [
            {
               "date": "01 February 2023 08:34",
               "html": "<p>I couldn&#39;t agree more with you. Unfortunately, the &quot;end-to-end principle&quot; seems to be the holy grail for true IPv6 believers so the cognitive dissonance prevents them to admit that NPT66 is the only solution that works (somewhat) reliably at the moment.</p>\n\n<p>People reading IPv6 blogs and listening to IPv6 podcasts are thus left confused and clueless.</p>\n",
               "id": "1633",
               "name": "Ivan Pepelnjak",
               "pub": "2023-02-01T08:34:35",
               "ref": "1632",
               "type": "comment"
            },
            {
               "date": "02 February 2023 04:16",
               "html": "<p>Yeah, but the implementation varies, unfortunately:\nF.e. in IOS-XE 16.x, NPTv6 is there but you can only configure a translation of you internal ULA prefix to a <em>single</em> external GUA prefix globally. Because of that, it&#39;s totally unusable for small-site IPv6 multihoming unless you &quot;solve&quot; it by throwing additional hardware onto the problem (f.e. one dedicated router per IPv6-NPTv6-enabled circuit), IMHO.\nI would have hoped for a more flexible approach, interface-centric, policy-based or whatever...\nAnyway, besides that, the Cisco implementation might also to break IPv6 traceroute (only asterisks...), at least in my case - but I&#39;m not sure if that&#39;s NPTv6, ZBF or combination of the two (you&#39;re doomed to use ZBF because simple reflexive ACLs are not supported in IOS-XE).</p>\n\n<p>I don&#39;t know about the track record of other vendors in that regard (and if they made similar bad implementation choices), but at least the implementation of f.e. Vyatta / VyOS looks more promising / flexible in that regards.</p>\n",
               "id": "1638",
               "name": " Christoph",
               "pub": "2023-02-02T16:16:12",
               "ref": "1633",
               "type": "comment"
            }
         ],
         "date": "31 January 2023 09:59",
         "html": "<p>If you really must solve this particular problem just use NAT and stop complaining. AFAIK all the vendors have implemented it by now.</p>\n",
         "id": "1632",
         "name": "Wes Felter",
         "pub": "2023-01-31T21:59:18",
         "type": "comment"
      }
   ],
   "count": 1,
   "type": "post",
   "url": "2023/01/dc-ipv6-small-site-multihoming.html"
}
