{
   "comments": [
      {
         "date": "07 March 2023 06:33",
         "html": "Page 451:<br />\n\n<p>Learn events can be distributed in one of three ways:\n1. DSPs (Dune special packets) to the OLPs in the system. Learn is done in hardware by messages that are distributed to the devices in the system. [A line card can update the other line cards with no software involvement.]\n2. DSPs to the CPU. Learn messages to the CPU that should add the MAC entries at will. When using this option, access to the DSP format document is required.\n3. Callbacks calls to CPU handlers. Events from the device are copied using a DMA hardware to the host&rsquo;s memory. When a time threshold or after number of events threshold are crossed a callback is called to handle the learn events. Note: DMA can handle a much slower rate of DSPs.</p>\n\n<p>I realize it&#39;s mostly Greek unless you&#39;ve read the rest of the manual...</p>\n",
         "id": "1692",
         "name": "Wes Felter",
         "pub": "2023-03-07T18:33:07",
         "type": "comment"
      },
      {
         "date": "07 March 2023 09:48",
         "html": "<p>You can also find mention on page 27 of the <a href=\"https://www.broadcom.com/products/ethernet-connectivity/switching/strataxgs/bcm56070-series\">BCM56070</a> Programming Guide found here: <a href=\"https://docs.broadcom.com/doc/56070-PG2-PUB\">https://docs.broadcom.com/doc/56070-PG2-PUB</a></p>\n\n<p>not the most exciting chip in the strataxgs line, but documentation for one of them nonetheless. </p>\n",
         "id": "1694",
         "name": "aag ",
         "pub": "2023-03-07T21:48:51",
         "type": "comment"
      },
      {
         "date": "14 March 2023 07:02",
         "html": "I love the phrase that as usual as is usually the case about JT : )<br />\n\n\n",
         "id": "1705",
         "name": "Zeeshan Shafeeq",
         "pub": "2023-03-14T19:02:18",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2023/03/dynamic-mac-learning-hw-cpu.html"
}
