{
   "comments": [
      {
         "comments": [
            {
               "date": "14 March 2023 07:32",
               "html": "<p>Thank you! Updated.</p>\n\n<p>Although I disagree with mentioning QFX5120 in the same sentence -- it&#39;s just that they cannot use breakout cables on more than 24 100GE links ;) I also can&#39;t figure out how you get from 64 ports to 8 uplinks + 24 ports with breakout cables, but that&#39;s just me ;)</p>\n\n<p>Anyway, I added an extra bullet describing the breakout cables option. Thanks a million for pointing me in that direction!</p>\n\n<p>Ivan</p>\n",
               "id": "1706",
               "name": "Ivan Pepelnjak",
               "pub": "2023-03-14T19:32:23",
               "ref": "1704",
               "type": "comment"
            },
            {
               "date": "15 March 2023 06:20",
               "html": "<p>All the vendors using Broadcom ASICs have &quot;leaf&quot; switches with 6 or 8 100G uplink ports and 48 10 or 25G downlink ports.</p>\n",
               "id": "1710",
               "name": "Erik Auerswald",
               "pub": "2023-03-15T18:20:56",
               "ref": "1706",
               "type": "comment"
            },
            {
               "date": "15 March 2023 06:39",
               "html": "<p>Have to go through the datasheets (one of the most boring things I ever did in my life) of my three &quot;favorite&quot; switch vendors to get a complete picture, but a quick sampling indicates you&#39;re right: many switches using Trident3 or Trident4 have eight uplinks. Looks like the ASICs are too fast and the vendors don&#39;t use all the lanes.</p>\n\n<p>Example: Trident3 has 128 25GE lanes, Arista 7050SX3-48YC8 has 48 x 25GE and 8 x 100GE ports for a total of 80 25GE lanes (leaving 48 lanes unused) and 1,5:1 oversubscription factor. We truly live in crazy times ;)</p>\n",
               "id": "1711",
               "name": "Ivan Pepelnjak",
               "pub": "2023-03-15T18:39:38",
               "ref": "1710",
               "type": "comment"
            }
         ],
         "date": "14 March 2023 05:12",
         "html": "<p>I think it&#39;s unfair to say &quot;Most leaf switches have four uplinks (some Cisco switches have six)&quot; when Juniper has i.e. the QFX5120 and QFX5200 switches and Arista has the 7280SR3, who all have 6 or 8 uplink ports.</p>\n\n<p>Cisco is not unique enough to deserve special mention here ;)</p>\n",
         "id": "1704",
         "name": " Sander Steffann",
         "pub": "2023-03-14T17:12:28",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "15 March 2023 03:29",
               "html": "<p>Of course you&#39;re absolutely right -- if you built (or even better: upgraded) at least one leaf-and-spine fabric, then nothing I wrote in this blog post sounds new or exciting... but that&#39;s true for everything I do ;)</p>\n\n<p>Not everyone is at that level, or there wouldn&#39;t be Rule 4 in RFC 1925, and common sense seems to be unevenly distributed ;)</p>\n\n<p>All the best, Ivan</p>\n",
               "id": "1709",
               "name": "Ivan Pepelnjak",
               "pub": "2023-03-15T15:29:23",
               "ref": "1708",
               "type": "comment"
            }
         ],
         "date": "15 March 2023 01:23",
         "html": "<p>I mean... Unless this post is targeted to managers or people who has 0 network knowledge, am I wrong to say that you just &quot;discovered the hot water&quot; as we say in Italy? (I.e. You are simply stating the obvious) </p>\n",
         "id": "1708",
         "name": "Andrea",
         "pub": "2023-03-15T13:23:33",
         "type": "comment"
      },
      {
         "date": "16 March 2023 01:56",
         "html": "<p>A non-snarky version of this is that you should design your network in its ultimate fully-upgraded form (e.g. 32 racks with 8 spines) then build only the parts you currently need. This also includes leaving rack space and power for all the spines etc. You can sleep easy with the knowledge that your expansion is already designed and will only require adding equipment with no recabling.</p>\n\n<p>Also, if you have so little networking experience that you&#39;re looking for information on LinkedIn you should probably just let Apstra design the network for you.</p>\n",
         "id": "1712",
         "name": "Wes Felter",
         "pub": "2023-03-16T01:56:57",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2023/03/leaf-spine-theory-reality.html"
}
