{
   "comments": [
      {
         "comments": [
            {
               "date": "14 March 2023 07:32",
               "html": "<p>Thank you! Updated.</p>\n\n<p>Although I disagree with mentioning QFX5120 in the same sentence -- it&#39;s just that they cannot use breakout cables on more than 24 100GE links ;) I also can&#39;t figure out how you get from 64 ports to 8 uplinks + 24 ports with breakout cables, but that&#39;s just me ;)</p>\n\n<p>Anyway, I added an extra bullet describing the breakout cables option. Thanks a million for pointing me in that direction!</p>\n\n<p>Ivan</p>\n",
               "id": "1706",
               "name": "Ivan Pepelnjak",
               "pub": "2023-03-14T19:32:23",
               "ref": "1704",
               "type": "comment"
            },
            {
               "date": "15 March 2023 06:20",
               "html": "<p>All the vendors using Broadcom ASICs have &quot;leaf&quot; switches with 6 or 8 100G uplink ports and 48 10 or 25G downlink ports.</p>\n",
               "id": "1710",
               "name": "Erik Auerswald",
               "pub": "2023-03-15T18:20:56",
               "ref": "1706",
               "type": "comment"
            }
         ],
         "date": "14 March 2023 05:12",
         "html": "<p>I think it&#39;s unfair to say &quot;Most leaf switches have four uplinks (some Cisco switches have six)&quot; when Juniper has i.e. the QFX5120 and QFX5200 switches and Arista has the 7280SR3, who all have 6 or 8 uplink ports.</p>\n\n<p>Cisco is not unique enough to deserve special mention here ;)</p>\n",
         "id": "1704",
         "name": " Sander Steffann",
         "pub": "2023-03-14T17:12:28",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "15 March 2023 03:29",
               "html": "<p>Of course you&#39;re absolutely right -- if you built (or even better: upgraded) at least one leaf-and-spine fabric, then nothing I wrote in this blog post sounds new or exciting... but that&#39;s true for everything I do ;)</p>\n\n<p>Not everyone is at that level, or there wouldn&#39;t be Rule 4 in RFC 1925, and common sense seems to be unevenly distributed ;)</p>\n\n<p>All the best, Ivan</p>\n",
               "id": "1709",
               "name": "Ivan Pepelnjak",
               "pub": "2023-03-15T15:29:23",
               "ref": "1708",
               "type": "comment"
            }
         ],
         "date": "15 March 2023 01:23",
         "html": "<p>I mean... Unless this post is targeted to managers or people who has 0 network knowledge, am I wrong to say that you just &quot;discovered the hot water&quot; as we say in Italy? (I.e. You are simply stating the obvious) </p>\n",
         "id": "1708",
         "name": "Andrea",
         "pub": "2023-03-15T13:23:33",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2023/03/leaf-spine-theory-reality.html"
}
