{
   "comments": [
      {
         "date": "08 October 2020 11:32",
         "html": "<p>Hi Ivan, thanks for your insights. I&#39;d like to add NetYCE to the mix. These are the typical cases in which they excel.</p>\n\n<p>They would fall into your 2nd bullet. Though they provide it as a service as well. </p>\n\n<p>You might want to take a look at it. </p>\n\n<p>Cheers,\nBart</p>\n",
         "id": "171",
         "name": "Bart Dorlandt",
         "pub": "2020-10-08T11:32:57",
         "type": "comment"
      },
      {
         "date": "08 October 2020 12:45",
         "html": "Worth mention: Gluware Brownfield Network Automation<br />\n\n<p>https://gluware.com/network-automation/brownfield-network-automation/</p>\n",
         "id": "172",
         "name": " Gian Paolo",
         "pub": "2020-10-08T12:45:53",
         "type": "comment"
      },
      {
         "date": "10 October 2020 08:31",
         "html": "<p>Hi Ivan,</p>\n\n<p>An interessting solution to have a look at: www.neops.io. Here a use case description on medium. </p>\n\n<p>https://link.medium.com/Vnc2Ye5Atab</p>\n\n<p>It&lsquo;s a young solution coming from the heart of europe. </p>\n\n<p>Br</p>\n",
         "id": "176",
         "name": " Ivan",
         "pub": "2020-10-10T20:31:17",
         "type": "comment"
      },
      {
         "date": "12 October 2020 10:50",
         "html": "<p>Thanks for the pointers Gian Paolo and Ivan. Both look like interesting tools, but as they have zero documentation online, I&#39;m not (yet) interested.</p>\n",
         "id": "177",
         "name": "Ivan Pepelnjak",
         "pub": "2020-10-12T10:50:21",
         "type": "comment"
      },
      {
         "date": "19 October 2020 08:20",
         "html": "<p>Hello Ivan</p>\n\n<p>First of all I would like to say that I am a member of the neops.io core team.</p>\n\n<p>The platform is being developed in partnership with multiple customers and we are about to release version 1.0 really soon. A draft of the documentation can be found at docs.neops.io. \nHopefully we will soon have filled the many black spots in the documentation and can link to it on the website.</p>\n\n<p>Related to your blog post, I would like to say something about your last two points and the sceptical words:\nAs a network engineer who has taken the road and moved towards software developers, I would like to quote a German proverb: &quot;No master has yet fallen from heaven&quot;</p>\n\n<p>What I mean to say is that the road to acquire new skills and a new way of thinking can be hard. So why not combine points 2 and 3 and make this path easier? Because in my opinion not only the technology but also the people have to be guided into the new world.</p>\n\n<p>This point, and the fact that each network is a unique snowflake (the logic is implemented by the network engineer, because he knows the network and its requirements best), is what we have brought together in neops.io.</p>\n\n<p>If you are interested, I would be happy to show you neops.io and get your feedback.</p>\n\n<p>Greetings Simon</p>\n",
         "id": "184",
         "name": " Simon",
         "pub": "2020-10-19T08:20:17",
         "type": "comment"
      }
   ],
   "count": 5,
   "type": "post",
   "url": "2020/10/network-automation-brownfield-deployments.html"
}
