{
   "comments": [
      {
         "date": "30 August 2023 08:42",
         "html": "Bruce nailed it with this comment: &quot;At this stage, we all know of examples where LLMs have produced laughable results indicating a lack of understanding of the world, but the details of how they work show that they are very good at understanding language. I think the issue is the difference between understanding language (a set of symbols) and understanding the world. If a human understands language, we generally assume that they also understand the world, but making this extrapolation in the case of LLMs is a bridge too far.&quot;<br />\n\n<p>ChatGPT is the ultimate cargo-cult. It can do well mimicking STATIC, symbol-based systems like languages, and by extension, programming languages. It can do well in other symbolic systems like Maths as well. But its model falls shorts when it comes to forming a world-view, which is a lot more complex and DYNAMIC. That&#39;s why there&#39;s no AI system that can drive a car safely in our current transport networks, and there&#39;ll likely never be one. </p>\n\n<p>So basically ChatGPT can be used to generate codes, not perfect but workable codes, with errors of course. Since lots of programmers are just that, bad coders, a lot of what they&#39;re doing atm will be replaced by it. There&#39;ll be people required to fix the codes generated by ChatGPT, but those numbers will be far smaller. That will put a downward pressure on the pay of programmers. </p>\n\n<p>Of course, there&#39;s no replacing competent and innovative coders, but they&#39;re by nature, a minority. </p>\n\n<p>Computer networks are also not very static, so ChatGPT can assist with device config, but it&#39;s impractical to expect that it&#39;ll replace all human elements, esp. in big networks. </p>\n",
         "id": "1900",
         "name": " Minh",
         "pub": "2023-08-30T08:42:49",
         "type": "comment"
      }
   ],
   "count": 1,
   "type": "post",
   "url": "2023/08/worth-reading-large-language-models.html"
}
