{
   "comments": [
      {
         "date": "24 July 2023 10:28",
         "html": "<p>This guy Gerben made some good points, as you pointed out, but he&#39;s also missing the big picture on AI, like so many others. The AI &#39;fever&#39;, if it can be called as such, was forced on the gullible public from the beginning. IT people are simple reductionists with tunnel vision and unable to connect the dots; therefore they think it&#39;s about the technology and vendors&#39; marketing, but no, it&#39;s not. It wasn&#39;t a random movement, but was carefully planned many years ago and went by the name &#39;The Fourth Industrial Revolution&#39;, an idea created by none other than good-ol WEF. Industrial Revolution 4.0 is, among other things, about AI replacing humans. </p>\n\n<p>But it was an ill-conceived idea from the start. AI is essentially just NN, which is in turn just sophisticated decision trees, based on some forms of Markov chain. Markov chain has severe limitations, due to its ergodic nature. All real things are heavily path-dependent with long memory (long-range depedent or LRD), so ergodic (memoryless) models can only imitate them to some degree, at best. They start failing when the real systems they try to imitate become too complex for simplistic NN (including recurrent NN and their simplistic feedback loops) to keep up with. There&#39;s no breakthrough as claimed by Gerben, only some incremental improvements, largely thanks to massive amount of computing power available to process big data. Yes, AI will make redundant a fair number of software engineers and reduce their big salary, and other simple professions also have a lot to fear, but in areas which require real creativity, there&#39;ll be no replacing human ingenuity. </p>\n\n<p>And already, the AI boom is turning into bust, as the dark reality of world&#39;s economy kicks in:</p>\n\n<p>https://www.zerohedge.com/markets/tsmc-delays-arizona-chip-plants-mass-production-amid-labor-shortage</p>\n\n<p>Last Nov I commented on your blog, that Credit Suisse was in serious trouble. 4 months later it went bust. All the big Western banks are practically bankrupt as we speak -- whether they&#39;re allowed to do so is something else -- so IT fares no better. Look at the mass layoff in the Tech sector since this year began. The fake AI fever therefore, will soon cool off, as there&#39;s no money for Silly Con Valley to hype it up, to keep the fire burning, esp. when the whole world is moving away from the dollar. </p>\n",
         "id": "1876",
         "name": " Minh",
         "pub": "2023-07-24T10:28:20",
         "type": "comment"
      }
   ],
   "count": 1,
   "type": "post",
   "url": "2023/07/worth-reading-eyes-like-saucers.html"
}
