{
   "comments": [
      {
         "date": "20 May 2011 09:19",
         "html": "Hello, Ivan, I enjoy your blog.  In my slides, I do suggest /120 as an alternative to /64 subnets, but my true intent is to make people realize that something other than /64 should be done, where appropriate, until vendors are able to deliver more router/switch knobs to protect against this attack vector.  This may be larger or smaller than a /120; but I think it gets the point across.<br /><br />It must be understood that ACLs may not protect your device.  There are major-vendor boxes that will still at least reach their NDP policer (if not actually learn ND entries) when receiving packets with new source addresses on a locally-attached subnet, even if the packet will ultimately be discarded due to an ingress ACL on that interface.  Operators should test their routers, because vendors absolutely do not provide reliable answers in this area -- including, again, the &quot;big vendors&quot; who we generally expect to Do The Right Thing.<br /><br />It is also worth mentioning that this absolutely will break IPv4 on many dual-stack routers.  Most people who think they may be ready for IPv6 today are not, and this is only one of many reasons why.  We need to do a better job of asking our vendors for needed improvements before we are all forced to play catch-up.",
         "id": "1921530019341697968",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Jeff Wheeler",
         "profile": null,
         "pub": "2011-05-20T09:19:30.796+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "20 May 2011 09:34",
         "html": "Hi Jeff! Nice to hear from you and thanks for the feedback!<br /><br />&quot;ACL won&#39;t protect you&quot; - amazing how broken things can get. I always assumed input ACL is the very first thing checked by a L3 device. Am I right in assuming that hitting this particular bug would require the attack to be an inside job (pwned server) ... or the attacker targeting your WAN link?<br /><br />&quot;This will break IPv4 on many dual-stack routers&quot; - just to clarify for everyone else reading the comments: I&#39;m assuming you&#39;re saying NDP exhaustion attack also breaks IPv4 on those devices that use common v4/v6 L3 adjacency entries. Using /120 on a subnet should not impact IPv4 at all.",
         "id": "204842476424243154",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Ivan Pepelnjak",
         "profile": null,
         "pub": "2011-05-20T09:34:34.157+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "20 May 2011 09:41",
         "html": "It&#39;s a religious thing. /127 is OK for router interconnecting segments, but not all equipment supports it. /120 is useless, or use /127 or use /64. <br /><br />If you are running any dynamic routing protocol routes are pointing to link-local addresses of neighbor interfaces anyway - so assigning global IPv6 address to router interface is for troubleshooting purposes only - and here comes loopbacks - but problem is that with loopbacks only you don&#39;t see exact egress interface, but always loopback of the router. This might suck a bit in some corner cases. <br /><br />Use with caution (as everything else) if in doubt :)",
         "id": "4700948808302269491",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Jan Zorz",
         "profile": null,
         "pub": "2011-05-20T09:41:31.557+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "20 May 2011 10:02",
         "html": "I wouldn&#39;t run BGP over LLA (although you can supposedly make it work).<br /><br />LLA are a pain if you&#39;re trying to figure out the exact path across the network with traceroute. <br /><br />Also, you might not be able to do hop-by-hop telnetting with LLA if your IGP breaks down (not that telnet to LLA would not work, sometimes you don&#39;t have your neighbor&#39;s LLA in your ND cache).",
         "id": "8936668563479048616",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Ivan Pepelnjak",
         "profile": null,
         "pub": "2011-05-20T10:02:09.340+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "20 May 2011 12:24",
         "html": "Dear Ivan, <br />In my opinion implementing IPv6 must not become a burden for network admin, so I try to implement IPv6 in easier way for me. Currently implementing dual-stack network, I try to match IPv6 address assignment with existing IPv4, so it will be easy for admin to know which is which. Before adding IP6 PTR record, all traceroute looks cryptic to me, so by doing that I can compare whether my network is working properly.<br /><br />I also try to take advantages of IPv6: /64 is huge, so no need for renumbering and change subnets such as IPv4. I only need to remember 3 kind of allocation: /32 or /48 for one organization, /64 for LAN subnets, and /128 for loopback. That&#39;s it.",
         "id": "8566584518060429960",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Affan Basalamah",
         "profile": null,
         "pub": "2011-05-20T12:24:59.720+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "20 May 2011 14:30",
         "html": "The biggest hurdle to getting this kind of thing changed will be the service providers. Even on private MPLS L3 VPNs there are prefix size limits applied on the PE. The carrier wont carry or transport prefixes longer than /64. If you want to troubleshoot reachability of those p2p links you will be dissapointed.<br /><br />For the internet service its even more draconian, and they only permit /48&#39;s. There is a table on wikipedia thats kept fairly up to date regarding the ipv6 routing policies of many large carriers.<br /><br />There is alot of speculation about IPv6 but little hard documentation. There are no good reference designs for a global enterprise. There are routing symmetry issues revolving around security and other services that are today the network is providing. Other technology like network-based IDS/IPS, data loss prevention, and web content filtering fall apart quickly as well.<br /><br />We are activly deploying IPv6 in a global infrastructure and facing many serious issues. Neither Cisco, nor ATT nor our other vendors and carriers (even with their professional services groups) have good answers to offer at this time for all of the core issues that still exist with ipv6, and they all disagree on what the best practices are. AT&amp;T wants /64&#39;s while Sprint wants 127&#39;s. Its all just the tip of a very large ice berg.",
         "id": "2650275154319041599",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "nosx",
         "profile": null,
         "pub": "2011-05-20T14:30:12.241+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "20 May 2011 14:58",
         "html": "If we&#39;re talking about public Internet, I have nothing against enforcing /48 as the minimum prefix. Go to RIPE/ARIN/*, ask for a PI /32 and allocate a /48 to every site.<br /><br />Enforcing prefix lengths in an MPLS/VPN network is plain stupid (or maybe your SP bought those mysterious boxes that self-destruct on receiving a longer prefix). The SP should not enforce the content (including prefix lengths), but just the maximum number of prefixes accepted from a site or total # of prefixes in a VRF.<br /><br />Routing symmetry between private and public networks across firewalls ... nightmare! Right now we&#39;re working with a customer with similar issues and will probably make it work, but it will be way more complex than NAT would have been.",
         "id": "5307406323562854851",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Ivan Pepelnjak",
         "profile": null,
         "pub": "2011-05-20T14:58:58.908+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "20 May 2011 15:41",
         "html": "Everybody is screaming that we are out of IPV4 and we need to implement IPV6. (including me)<br />But how are we supposed to implement this if after 10+ Years there is still no rock solid standard?",
         "id": "2712783133291618219",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Pim",
         "profile": null,
         "pub": "2011-05-20T15:41:36.973+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "20 May 2011 18:02",
         "html": "FWIW, I labbed out a neighbor cache exhaustion attack on a remote /64 and wasn&#39;t able to get an 1811 (running IOS 12.4T) to hold more than a few dozen incomplete ND entries at a time. Not sure how this affects valid ND entries but it doesn&#39;t seem like a big deal.<br /><br />That said, there&#39;s no reason not to use /127s on point-to-point links. If a device doesn&#39;t support /127s, it&#39;s a vendor problem, not a design problem.",
         "id": "4592089823632160351",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "stretch",
         "profile": null,
         "pub": "2011-05-20T18:02:10.394+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "21 May 2011 00:31",
         "html": "I think its important to remember that most providers arent going to re-buy every PE on their network to support IPv6 and that there is quite a long list of caveats in all vendor camps regarding hardware in the last 6-8 years that has some potentially painful hardware issues regarding prefix length. Classic issues include ACL construction and TCAM specificity.<br /><br />Given the world they operate in today, until the hardware is completely refreshed over a period of years, those restrictions are probablly going to remain in place. These are not small and stupid telco&#39;s either, including AT&amp;T.",
         "id": "1195568370546663187",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "nosx",
         "profile": null,
         "pub": "2011-05-21T00:31:44.208+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "21 May 2011 00:33",
         "html": "Wouldnt IPv6 best practices like iACLs and unadvertised PA space for p2p links mitigate the risk for now?",
         "id": "5160936873154247350",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "nosx",
         "profile": null,
         "pub": "2011-05-21T00:33:39.974+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "21 May 2011 12:01",
         "html": "BGP is another thing, but OSPF-v3 points to LLA of neighbour by default. I agree you need global IPv6 addresses as identifier, if not only for jumping from router to router also for troubleshooting purposes.",
         "id": "3586219200846180204",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Jan Zorz",
         "profile": null,
         "pub": "2011-05-21T12:01:34.842+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "21 May 2011 19:16",
         "html": "@stretch: software-based platforms are not a problem. ASIC-based L3 switches are.<br /><br />@nosx: iACLs don&#39;t work on all platforms (see Jeff&#39;s comment below). Unadvertised PA space definitely helps.",
         "id": "5287580576061529035",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Ivan Pepelnjak",
         "profile": null,
         "pub": "2011-05-21T19:16:02.701+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "22 May 2011 14:53",
         "html": "Just for the record, I was configuring /127 for point-to-point core links and /128 for loopbacks on JUNOS (8.x, 9.x, don&#39;t remember if I used 7.x too) some years ago and it worked as expected... in a VLSM world.<br /><br />Slowly we are refining IPv6 myths and best practices. IMO this makes IPv6 world more sane (/64 loopback...?!) and less fundamentalist.",
         "id": "6912973451565739213",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Rodrigo",
         "profile": null,
         "pub": "2011-05-22T14:53:57.395+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "22 May 2011 20:13",
         "html": "Is the &quot;man-in-the-middle&quot; a new stuff!? <br />If a &quot;close friend&quot; has layer-2 access to your switch -<br />you are in trouble w/o IPv6.<br /><br />all layer-2/3 switch security must de used and/or adopted for IPv6 too.<br />like for nowdays v4 networks - 802.1x/ARP-Inspect/DHCP-Snoop  <br />the RA Guard is still for Cat6500 only ;(<br /><br />Moreover, I&#39;d say SLAAC is good for PoC labs - or maybe you have a <br />SLAAC/WinXP solution; otherwise for usual static &amp; dhcp setup you&#39;d be able to <br />protect your networks <br />BTW<br />Since IOS 12.3T I have been using /128 for loopbacks",
         "id": "5464035035871388222",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "6VPE",
         "profile": null,
         "pub": "2011-05-22T20:13:07.253+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "22 May 2011 21:14",
         "html": "&quot;have no clue whether common server operating systems (Linux, Windows) would work with static IPv6 addresses out of a /120 prefix. Real-life experience?&quot;<br /><br />Not actually answering your request :-) I did a quick lab on a 2901 with 15.1(3)T and a Win7 on the other end. The DHCP-server implementation at the Cisco end gives out addresses with /120 defined in the address prefix section and managed-config flag defined towards the Win7. ND/RD works fine, pings normally, did a wireshar cap at W7 everything goes by the book. <br />No idea what happens with W2003 or W2008 but I would suppose they&#39;d work fine too. <br /><br />Excellent blog, keep up the good work.",
         "id": "9030793636690752122",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Mika I",
         "profile": null,
         "pub": "2011-05-22T21:14:04.414+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "23 May 2011 07:57",
         "html": "None of the problems we have with IPv6 are new, but the vendors (and the IETF community at large) failed to retrofit the IPv4 security enhancements and features into IPv6 stack and products.<br /><br />Today, when we would have to start serious IPv6 deployments, we&#39;re faced with &quot;what do you mean you don&#39;t have feature XXX in IPv6&quot; revelations.",
         "id": "7672781401913857702",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Ivan Pepelnjak",
         "profile": null,
         "pub": "2011-05-23T07:57:09.366+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "23 May 2011 23:43",
         "html": "You can staticly use a /120 on Windows server 2008R2 and Win7.",
         "id": "3829375542076516667",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Stephen",
         "profile": null,
         "pub": "2011-05-23T23:43:01.974+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "28 May 2011 00:53",
         "html": "I Just did a similar test as Strech described. I used an Juniper MX480, generating ~380 pps for random hosts in a subnet on that router, resulting in lots of Neigbour discovery packets. <br /><br />I wasn&#39;t able to get more than ~250 incomplete entries in the neigbour cache. <br />At the same time learning new, valid ND, entries didn&#39;t seem to be an issue.<br /><br />So although it&#39;s a problem in theory, it seems that most implementations, i.e. Cisco (as described by Strech) and Juniper limit the effects of such an attack.",
         "id": "3813856109566730145",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Andree Toonk",
         "profile": null,
         "pub": "2011-05-28T00:53:10.046+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "08 June 2011 14:25",
         "html": "I like your thinking, I&#39;ve been following this every since a design where we mapped 10.x.y.0/24 subnets by mapping the 2nd and 3rd octets to the end of a /48. For infrastructure /30 links or /32 loopbacks, sticking in a bunch of zeros after the /64 and making the last byte match IPv4 works for /126 and /128&#39;s. (We designed the IPv4 addressing from scratch to summarize so mapping was not importing a very legacy IPv4 addressing scheme into IPv6.)<br /><br />Note RFC 3627 http://tools.ietf.org/html/rfc3627 section 5, the part about u/l bits being zero. I&#39;m not sure how likely those bits are to get used, I&#39;m tracking IPv6 but not super-closely.",
         "id": "6045481171512606865",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "PeteW",
         "profile": null,
         "pub": "2011-06-08T14:25:59.067+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "16 August 2011 02:18",
         "html": "WinServer 2008 and win 7 have a stack rewrite that treat IPv6 as a priority over 4. <br />What about just using LLs for the infrastructure links?<br />The other issues are possible fragmentation attacks/path mtu poison at end nodes?<br />Checksum related attacks, IPv6 forces for UDP etc, router resource issue? <br />Header extension stacking processing?<br />Scaling at the application to asic level. IPv6 uses 128 bit addresses these have to be split for 64 bit architectures = added cpu cycles vs. IPv4 S/D addresses fit nicely into one 64bit word.<br />and more to come.",
         "id": "5576919477303926338",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "jsicuran",
         "profile": null,
         "pub": "2011-08-16T02:18:48.248+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "25 August 2011 14:07",
         "html": "I also used /128 for loopbacks for years I was testing 6PE and 6VPE...<br /><br />/128 are not announced as such by OSPFv3. <br /><br />If I do remember correctly the /128 loopbacks are advertised as stub networks by OSPFv3 are advertised as /64... I am quite but not 100% sure for the /64 but not /128 for sure !",
         "id": "4275201333558405174",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Fred Bovy",
         "profile": null,
         "pub": "2011-08-25T14:07:12.955+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "25 August 2011 15:45",
         "html": "Loopbacks having /128 addresses work correctly with OSPFv3 in IOS release 15.0M. They are advertised as prefix link states with /128 prefix length.",
         "id": "3621525907195085802",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Ivan Pepelnjak",
         "profile": null,
         "pub": "2011-08-25T15:45:06.877+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "05 September 2011 15:25",
         "html": "I did a similar to stretch and Andree test on a c7609 and a CRS-1 . Neither boxes seemed fussed about it. I could see a few dozen incomplete entries in the ND cache which expired in a few seconds. My question is: has anyone managed to cause any sort of harm to a L3 device with that sort of attack?",
         "id": "4167276874872020110",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "deZ",
         "profile": null,
         "pub": "2011-09-05T15:25:45.083+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "05 September 2011 15:29",
         "html": "so, Jeff, have you actually successfully deployed the attack? If so, which box was vulnerable?",
         "id": "4636080390669859540",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "deZ",
         "profile": null,
         "pub": "2011-09-05T15:29:25.861+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "05 September 2011 18:12",
         "html": "How many spoofed packet-per-second were you sending?",
         "id": "8290115075191868322",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Ivan Pepelnjak",
         "profile": null,
         "pub": "2011-09-05T18:12:23.884+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "06 September 2011 14:53",
         "html": "~30pps for ~4minutes which I can of course increase",
         "id": "1326620452992544487",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2011-09-06T14:53:45.376+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "06 September 2011 14:54",
         "html": "~30pps for ~4minutes",
         "id": "7097594652733460066",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "deZ",
         "profile": null,
         "pub": "2011-09-06T14:54:11.795+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "06 September 2011 18:11",
         "html": "That&#39;s way too little. Try with a few thousand pps (duration doesn&#39;t matter that much). Each entry times out in three seconds (default values from RFC).",
         "id": "982517488533815740",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Ivan Pepelnjak",
         "profile": null,
         "pub": "2011-09-06T18:11:16.926+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "06 September 2011 20:30",
         "html": "i was going to try the 1k pps suggested by Jeff Wheeler but I was expecting to see some &quot;discomfort&quot; in the switch at a much lower rate. I&#39;d already gone up to 100pps but my pc started becoming unersponsive :D .",
         "id": "8257773363098455257",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "deZ",
         "profile": null,
         "pub": "2011-09-06T20:30:41.054+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "06 September 2011 20:45",
         "html": "The switch works fine as long as it doesn&#39;t run out of TCAM. 100 pps is nothing even when CPU-switched. You might want, however, to either change your testing tool (as a last resort you could take my PERL flood program as the starting point) or your PC ;)",
         "id": "7705338846467900958",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Ivan Pepelnjak",
         "profile": null,
         "pub": "2011-09-06T20:45:25.386+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "12 September 2011 14:43",
         "html": "i&#39;ve modified my script and i can send ~500pps . the c7609 went from 1-&gt;10% cpu util. I was wondering though: sure, lets change all p2p links to /127 or whatever, but what about datacenter switches and their vlans? Should we configure longer prefixes adn forget about SLAAC?",
         "id": "7493471819840024843",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "deZ",
         "profile": null,
         "pub": "2011-09-12T14:43:03.893+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "12 September 2011 18:30",
         "html": "I don&#39;t think using SLAAC on server segments is the best idea there is.",
         "id": "5502930747533266453",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Ivan Pepelnjak",
         "profile": null,
         "pub": "2011-09-12T18:30:40.423+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "13 September 2011 09:21",
         "html": "ok, that was supposed to be 2 different things  :)<br />a. in order to have a sane addressing plan, we&#39;ve decided long ago to allocate /64 subnets<br />b. SLAAC is desirable sometimes (workstation LANs etc)",
         "id": "166208057290669378",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "deZ",
         "profile": null,
         "pub": "2011-09-13T09:21:23.868+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "13 September 2011 18:22",
         "html": "(A) Never understood why /64-everywhere would make anyone saner ... but who am I to judge that, seen too many weird things in my life to remain sane  :-P<br /><br />(B) You mentioned SLAAC and data center switches in (almost) the same sentence  ;)",
         "id": "3461632979222300702",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Ivan Pepelnjak",
         "profile": null,
         "pub": "2011-09-13T18:22:12.332+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "02 October 2011 02:57",
         "html": "Cool! it was a long time I did not try this... long time before 15.0M !<br /><br />thanks Ivan",
         "id": "2130195682198677007",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Fred Bovy",
         "profile": null,
         "pub": "2011-10-02T02:57:39.031+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "date": "02 October 2011 03:03",
         "html": "Hi Ivan,<br /><br />I am just curious about the real potential of such attack.<br /><br />When a resolution is performed with ND default values, a ND entry is created in<br />the state INCOMPLETE and a NS is sent. If no NA reply is received after<br />RetransTimer milliseconds (default: 1 second) it should then retransmit a NS<br />maximum MAX_MULTICAST_SOLICIT (default: 3) times. Then the entry is cleared from<br />the cache.<br /><br />So the entry will not stay in the table more than 3 seconds before it is cleared.<br /><br />For sure if an attacker keep on scanning, it will fill the table faster than the<br />table will be purged. But it will take some time to fill up the table<br />and the attack must be quite continuous without interruption or entries will be<br />deleted automatically.<br /><br />This means that it should not be difficult to detect and to isolate the attacker.<br /><br />If it comes from the outside it must pass firewalls which should be able to<br />manage this and take appropriate action at least to mitigate so it will not be<br />able to do much harm if it cannot block it.<br /><br />If it is local, an IDS capable of detecting port scan and other attacks should<br />also be able to isolate the attacker.<br /><br />So is it really such a big threat ?<br /><br />Fred",
         "id": "3952951148149350057",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Fred Bovy",
         "profile": null,
         "pub": "2011-10-02T03:03:30.572+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "15 April 2022 08:55",
               "html": "<p>Hi Ivan,</p>\n\n<p>One small doubt.\nCurrent, we have device with ipv6 prefix 64 and facing neighbor cache exhaustion while generate TCP/IPv6 syn attack from one of the device (using netwox simulation tool for send syn packets from  random sources).</p>\n\n<p>If we assign ipv6 prefix 112s or 120s, somehow we could able to resolve this cache exhaustion and legitimate user able to access our device properly.</p>\n\n<p>So, Is there any other way to resolve this neighbor cache exhaustion instead of reducing subnet size from 64s to 112s/120s &amp; add one router prior to our device for accept specific source subnets &amp; restrict remaining. ?</p>\n\n<p>Thanks\nKumar</p>\n",
               "id": "1167",
               "name": " RK",
               "pub": "2022-04-15T08:55:53",
               "ref": "2829983141518389680",
               "type": "comment"
            },
            {
               "date": "15 April 2022 04:24",
               "html": "<p>The easiest way to solve that challenge would be with ingress access lists on the switch/router.</p>\n",
               "id": "1173",
               "name": "Ivan Pepelnjak",
               "pub": "2022-04-15T16:24:21",
               "ref": "1167",
               "type": "comment"
            }
         ],
         "date": "02 October 2011 19:05",
         "html": "The intruder can definitely cause short-term damage before you isolate him. Unless you have automatic detection/filtering mechanisms, it can take a while to figure out what&#39;s going on. Also, he can hit you from numerous source IPv6 addresses (admittedly limited to a single /64 if his ISP is doing a good job).<br /><br />Firewalls should be able to protect you if they allow access only to specific IPv6 addresses. If you use something along the lines of &quot;permit tcp any any eq 80&quot; you&#39;re toast.",
         "id": "2829983141518389680",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Ivan Pepelnjak",
         "profile": null,
         "pub": "2011-10-02T19:05:15.069+02:00",
         "ref": "7097569985082595828",
         "type": "comment"
      }
   ],
   "count": 38,
   "id": "7097569985082595828",
   "type": "post",
   "url": "2011/05/ipv6-neighbor-discovery-exhaustion.html"
}
