{
  "comments": [
    {
      "date": "24 May 2011 14:49",
      "html": "&quot;better solutions (more secure, more scalable, more managable) are available now”<br /><br />What are some examples of solutions that would match the above?",
      "id": "3513261457005794355",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Daniel G",
      "profile": null,
      "pub": "2011-05-24T14:49:32.922+02:00",
      "ref": "9062930192395368127",
      "type": "comment"
    },
    {
      "date": "24 May 2011 15:03",
      "html": "It&#39;s probably best to read his comments. <br /><br />They were using Common Services topology for managed VoIP and replaced it with VRF-aware SBC.<br /><br />Another common use of Common Services is managed network service (outsourced network management, now known as Management as a Service or Cloud-Based-Management  :-P ). Yet again, it&#39;s simpler to start per-customer VM with two NICs (one in customer network, one facing the central NMS) that does all the polling.",
      "id": "6899409917877438665",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ivan Pepelnjak",
      "profile": null,
      "pub": "2011-05-24T15:03:13.025+02:00",
      "ref": "9062930192395368127",
      "type": "comment"
    },
    {
      "date": "24 May 2011 15:12",
      "html": "This goes beyond just SP networks though, I don&#39;t see an issue with adding Common RTs to the &quot;Cust&quot; VRF when used in the enterprise. For services separation and whatever policies are in place. So again, the &quot;it depends&quot; comes into play allot in this stuff :)",
      "id": "5622971340875141397",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Yandy",
      "profile": null,
      "pub": "2011-05-24T15:12:15.669+02:00",
      "ref": "9062930192395368127",
      "type": "comment"
    },
    {
      "date": "24 May 2011 17:50",
      "html": "Makes sense. The first service that popped in my mind was VoIP. Previous employer had Verizon MPLS with SIP trunking and my current employer does as well. As best as I can remember at my previous job we were using the same /24 network to reach Verizon&#39;s SBC as we are at my current job over the MPLS.",
      "id": "7568537358244099824",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Daniel G",
      "profile": null,
      "pub": "2011-05-24T17:50:31.441+02:00",
      "ref": "9062930192395368127",
      "type": "comment"
    },
    {
      "date": "25 May 2011 01:28",
      "html": "BTW, on the second limit (max msg size), wait and see if http://tools.ietf.org/html/draft-ymbk-bgp-extended-messages-02 goes through...",
      "id": "2352526919118764728",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "lochii",
      "profile": null,
      "pub": "2011-05-25T01:28:43.336+02:00",
      "ref": "9062930192395368127",
      "type": "comment"
    },
    {
      "date": "25 May 2011 17:18",
      "html": "Ivan:  You may have surmised by now I work for a large application service provider and we have thousands of customers.  Shared services and customized delivery of those services is critical to our bottom line.  There is one other concern with modifying the shared-services VRF:  risk and change-management.  Why touch the one shared thing that could potentially jack-up service for thousands?  Better to reduce the scope of potential impact by creating individual VRFs for customers and modifying those as necessary...",
      "id": "8268506609875546722",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Derick Winkworth",
      "profile": null,
      "pub": "2011-05-25T17:18:19.981+02:00",
      "ref": "9062930192395368127",
      "type": "comment"
    },
    {
      "date": "27 May 2011 18:37",
      "html": "My employer also runs a VoIP hosted application service. Originally our small customers were content connecting to us via the open internet. Our newer and larger customers are demanding private connections. <br /><br />We were going down the road of Shared Services / aka Extranet VRF. Since we are application layer people we didn&#39;t really know the pros and cons. Our main network provider is not that helpful either since they only sell a standard service with no customization.<br /><br />Seems from above, going with a VRF or VLAN aware SBC maybe a better option for a VoIP only scenario.",
      "id": "8448507179656769740",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "lickedcat",
      "profile": null,
      "pub": "2011-05-27T18:37:31.906+02:00",
      "ref": "9062930192395368127",
      "type": "comment"
    }
  ],
  "count": 7,
  "id": "9062930192395368127",
  "type": "post",
  "url": "2011/05/scalability-of-common-services-mplsvpn.html"
}