{
   "comments": [
      {
         "comments": [
            {
               "date": "18 April 2023 07:45",
               "html": "<p>Thank you! Have to make a blog post out of that one of these days ;)</p>\n",
               "id": "1764",
               "name": "Ivan Pepelnjak",
               "pub": "2023-04-18T19:45:11",
               "ref": "1760",
               "type": "comment"
            }
         ],
         "date": "18 April 2023 09:40",
         "html": "<p>History can give some insight...</p>\n\n<p>IPv6 was actually seen by some people as IPXv2, with some influence from DECnet. You can get rid of explicit interface addressing and move to node addressing. You could get rid of ARP/ND all together. This is why we have /64 even for point-to-point links, getting rid of ARP/ND. You can easily map IPv6 addresses with MAC addresses. Just embed it. The other functions should be done by some successor of ES-IS. </p>\n\n<p>Then came some other people and destroyed the original clean design. Pity for this...</p>\n",
         "id": "1760",
         "name": " Bela Varkonyi",
         "pub": "2023-04-18T09:40:26",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "18 April 2023 07:46",
               "html": "<p>You should use /127 only for numbered router-to-router links, so you don&#39;t need DHCPv6 in that case.</p>\n\n<p>Although DHCPv6 SHOULD work on prefix sizes other than /64, I wouldn&#39;t push my luck unless absolutely necessary.</p>\n",
               "id": "1765",
               "name": "Ivan Pepelnjak",
               "pub": "2023-04-18T19:46:16",
               "ref": "1761",
               "type": "comment"
            },
            {
               "date": "19 April 2023 10:35",
               "html": "<p>&gt;&gt; You should use /127 only for numbered router-to-router links, so you don&#39;t need DHCPv6 in that case.\nI fully agree, but that&#39;s the exactly the point:\nIf I have a design like that (f.e. routed access layer) and I want to use ZTP such as Cisco PnP, all of that usually relies on DHCP(v6). If I&#39;m unable to create a /127 scope, I&#39;m doomed with a ZTP approach unless I move to /126 (at least) or even /64.</p>\n\n<p>So basically the same issue with IPv4 /31 - with ZTP, you&#39;re somewhat forced to use /30 because of DHCP.</p>\n\n<p>I&#39;m pretty confident not everybody is aware of that and / or takes that &quot;issue&quot; into consideration for their IP addressing design. So that might turn into a bad surprise later on as the importance for ZTP is raising more than ever with the higher demand for automation.</p>\n",
               "id": "1775",
               "name": " Christoph",
               "pub": "2023-04-19T10:35:40",
               "ref": "1765",
               "type": "comment"
            },
            {
               "date": "19 April 2023 02:21",
               "html": "<p>(A) A lot of data center deployments use an out-of-band management network with a flat subnet.</p>\n\n<p>(B) Haven&#39;t checked DHCPv6 details, but DHCP uses IP <em>address</em> (not prefix) in <code>giaddr</code> field, which means that the DHCP server scope does not have to match the real subnets. Obviously you have to be careful and use static assignments or you&#39;ll get out-of-subnet addresses assigned to DHCP clients.</p>\n",
               "id": "1777",
               "name": "Ivan Pepelnjak",
               "pub": "2023-04-19T14:21:21",
               "ref": "1775",
               "type": "comment"
            }
         ],
         "date": "18 April 2023 09:47",
         "html": "<p>There might be another issue with prefixes like /127: DHCP-based auto provisioning mechanisms\nI&#39;m not sure if it&#39;s possible make it work with in IPv6 somehow (never tried that...), but at least with IPv4 /31 it&#39;s impossible to setup such a scope on Windows or ISC DHCP server, to my knowledge.</p>\n",
         "id": "1761",
         "name": " Christoph",
         "pub": "2023-04-18T09:47:53",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "18 April 2023 04:49",
               "html": "<p>The main reason I use /126 rather than /127 in places is that there are some devices that do not understand how to /127 properly (and for that matter, how to /31 in IPvLegacy space,) so the 126 provides maximum compatibility while keeping the attack surface small.  I have used /124&#39;s before for small transit networks, but never a /112.  </p>\n",
               "id": "1763",
               "name": " Sean",
               "pub": "2023-04-18T16:49:58",
               "ref": "1762",
               "type": "comment"
            },
            {
               "date": "18 April 2023 07:46",
               "html": "<p>@Sean: Thank you, will add.</p>\n",
               "id": "1766",
               "name": "Ivan Pepelnjak",
               "pub": "2023-04-18T19:46:48",
               "ref": "1763",
               "type": "comment"
            }
         ],
         "date": "18 April 2023 10:19",
         "html": "<p>My personal preference is to reserve a /64 per point-to-point link, and configure a /127. Because xxx::/127 and xxx::1/127 looks ugly, I usually use xxx::a/127 and xxx::b/127 for aesthetics. It also makes it easier in discussions to refer to the A side or the B side.</p>\n\n<p>And for the /112, talk to Iljitsch &#x1F609;</p>\n",
         "id": "1762",
         "name": "Sander Steffann",
         "pub": "2023-04-18T10:19:43",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "19 April 2023 08:21",
               "html": "<p>As you&#39;d be dealing with static or DHCPv6 address assignment anyway, it doesn&#39;t matter what the prefix size is -- just zero out all the other quibbles if that&#39;s what you&#39;d like to have.</p>\n",
               "id": "1768",
               "name": "Ivan Pepelnjak",
               "pub": "2023-04-19T08:21:26",
               "ref": "1767",
               "type": "comment"
            }
         ],
         "date": "18 April 2023 08:16",
         "html": "<p>The /112 prefix length makes the last quibble the host part. This might seem more pleasing to people not using a proper IPAM ;-) </p>\n",
         "id": "1767",
         "name": " Arne",
         "pub": "2023-04-18T20:16:55",
         "type": "comment"
      },
      {
         "date": "19 April 2023 10:07",
         "html": "<p>Not actually point-to-point case but very close to it, and I know here are skillful people to shoot me down, so here we go, my thoughts:</p>\n\n<p>Routers-to-firewalls link networks that need space for HSRP/VRRP/clustering addresses are configured as /116:</p>\n\n<ul>\n<li>Our-side devices are addressed:\n    ::a = virtual IP\n    ::a1 = first device in the group/cluster\n    ::a2 = second device in the group/cluster</li>\n<li>The other side devices are addressed:\n    ::b = virtual IP\n    ::b1 = first device in the group/cluster\n    ::b2 = second device in the group/cluster</li>\n<li>Reasoning for using /116 instead of /64: It limits the possibility of NCE (Neighbor cache exhaustion) in the routers-to-firewalls link networks. It is unclear if NCE is still practical in 2023 but a smaller subnet was nevertheless selected as a precaution. SLAAC is never used in these subnets so there is no technical reason to stick with /64.</li>\n<li>Reasoning for using /116 instead of /120: RFC 2526 (Reserved IPv6 Subnet Anycast Addresses): &quot;Within each subnet, the highest 128 interface identifier values are reserved for assignment as subnet anycast addresses.&quot; If using /120 for routers-to-firewalls subnets it is not possible to use the ::a1, ::a2, ::b1 and ::b2 addresses that are illustrative when using ::a and ::b for the VIPs. Using /116 enables using them for &quot;a-side and b-side&quot; consistency with point-to-point subnets. /116 is the next-shorter netmask from /120 when sticking with nibble-boundaries.</li>\n</ul>\n",
         "id": "1769",
         "name": " Markku Leiniö",
         "pub": "2023-04-19T10:07:43",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "19 April 2023 11:08",
               "html": "<p>At least on Linux, one can ping the <em>All Nodes</em> multicast address on a given interface:</p>\n\n<pre>\r\n$ ping ff02::1%enp0s31f6\r\nPING ff02::1%enp0s31f6(ff02::1%enp0s31f6) 56 data bytes\r\n[&hellip;]\r\n$ ping -I enp0s31f6 ff02::1\r\nping: Warning: source address might be selected on device other than: enp0s31f6\r\nPING ff02::1(ff02::1) from :: enp0s31f6: 56 data bytes\r\n[&hellip;]\r\n</pre>\n\n<p>With a point-to-point link between two routers, the <em>All Routers</em> multicast address <code>ff02::2</code> could be used instead (or as a check if the neighbor considers itself a router).</p>\n",
               "id": "1776",
               "name": "Erik Auerswald",
               "pub": "2023-04-19T11:08:32",
               "ref": "1774",
               "type": "comment"
            },
            {
               "date": "19 April 2023 04:12",
               "html": "<p>@Henk: You&#39;re looking for RFC 5837. There&#39;s also RFC 8335.</p>\n\n<p>In 2021, Ron Bonica promised Junos implementation of RFC 5837 (see https://pretalx.com/denog13/talk/BCNAHM/). No idea whether it shipped in the meantime.</p>\n",
               "id": "1778",
               "name": "Ivan Pepelnjak",
               "pub": "2023-04-19T16:12:50",
               "ref": "1776",
               "type": "comment"
            }
         ],
         "date": "19 April 2023 10:18",
         "html": "<p>I like IS-IS. I like the original CLNS addressing-scheme. One address per box. All interfaces are unnumbered. Routing is done based on L1 host-routes. Even for directly connected routers. If I ran an IPv6-network, I&#39;d want to do the same thing. Link-local IPv6 addresses work fine for this.</p>\n\n<p>So why would people want to manually assign a non-link-local address to their interfaces? The only thing I can think of is so they will be able to ping for troubleshooting. Correct? Are there more reasons?</p>\n\n<p>Pinging a link-local address is a pain, I&#39;d guess. Because you have to look up the remote router&#39;s link-local address first. Not fun. So how can we improve this?</p>\n\n<p>I would guess we need a new flavor of &quot;ping&quot;. <br />\nA ping that only works on p2p interfaces. <br />\nA ping that takes only an outgoing interface-name as argument. <br />\nThe new ping will send out a packet over the p2p interface. <br />\nThe destination-address in the ping-address doesn&#39;t matter. <br />\nThe router on the other end replies anyway.</p>\n\n<p>Ideally the new ping-reply holds a bit more information about the remote router. Like maybe its interface-address, its interface-name, and maybe the hostname of the router. I would assume such a tool would be rather handy, if you often use unnumbered interfaces or link-local addresses.</p>\n\n<p>Can we do this with existing protocols? <br />\nFor IPv4 we could send a ping to the IPv4-broadcast address, or directed-broadcast address. Long time ago, routers would respond to that. Maybe today you can&#39;t ping 255.255.255.255 anymore. And directed-broadcasts are probably not accepted. IPv6 doesn&#39;t have broadcast-addresses. So we&#39;d have to define a new well-known IPv6 multicast-address.</p>\n\n<p>Ping packets can be padded to any size. Can we use the padding to carry TLVs? If so, we could put the if-address, if-name and hostname in a TLV in the ping reply. That should be backwards compatible.</p>\n\n<p>Or else we could use another existing protocol? E.g. extend LLDP to have some sort of ping? One that replies with the if-name, if-address and hostname? Unfortunately LLDP seems to be under the control of IEEE, not IETF. I have no experience working with the IEEE, so I have no idea if this is feasible.</p>\n\n<p>Just an idea. <br />\nOperators, do you think such a new ping would be useful?</p>\n",
         "id": "1774",
         "name": "Henk",
         "pub": "2023-04-19T10:18:12",
         "type": "comment"
      },
      {
         "date": "19 April 2023 04:32",
         "html": "<p>We did a handful of podcasts on point to point addressing on MODEM, but we specifically focused on v6. Could be relevant, links to each one at the bottom of their respective pages: \nhttps://www.modem.show/post/s02e07/\nhttps://www.modem.show/post/s03e01/</p>\n",
         "id": "1779",
         "name": " Nick Buraglio",
         "pub": "2023-04-19T16:32:04",
         "type": "comment"
      }
   ],
   "count": 7,
   "type": "post",
   "url": "2023/04/ipv6-p2p-addressing.html"
}
