{
   "comments": [
      {
         "date": "27 April 2023 07:36",
         "html": "<p>As I recall, DecNet Phase V was considered by its designers to be &quot;the easier solution&quot; for complex networks and was intended to be the network layer routing protocol in OSI. \nhttp://www.bitsavers.org/pdf/dec/decnet/EK-DNAPV-GD_DECnet_Phase_V_General_Description_Sep87.pdf</p>\n\n<p>My experience was limited to DecNet Phase IV and the wonders of interconnecting multiple sites all of which had chosen to be in Area 1 (IIRC - this was in the 1990s).</p>\n\n<p>DecNet Phase V and OSI didn&#39;t get widely adopted despite a major push including government requirements to deploy it. This wasn&#39;t surprising given the cost of the OSI software licenses et al compared to the zero cost of open source TCP/IP.</p>\n",
         "id": "1801",
         "name": "Charles Spurgeon",
         "pub": "2023-04-27T19:36:10",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "28 April 2023 07:46",
               "html": "<p>Of course you&#39;re correct (although the results are almost the same apart from the ability to receive and send BPDUs). Thank you, fixed.</p>\n",
               "id": "1805",
               "name": "Ivan Pepelnjak",
               "pub": "2023-04-28T07:46:30",
               "ref": "1802",
               "type": "comment"
            }
         ],
         "date": "27 April 2023 08:23",
         "html": "<p>I thought that STP does not shutdown interfaces (except BPDU guard) for loop prevention but put the interface into blocking state so that no MAC addresses were learnt from that interface.</p>\n",
         "id": "1802",
         "name": "Anonymous",
         "pub": "2023-04-27T20:23:52",
         "type": "comment"
      },
      {
         "date": "28 April 2023 02:46",
         "html": "<p>When comparing one optimal design to another optimal design, complexity is a manifestation of the information required to execute an equation/information function. Those things that require more information, and are more complex, are often doing more.</p>\n\n<p>Cannot reduce complexity beyond necessary information and function:\nhttps://internetdynamics.substack.com/p/cannot-reduce-complexity-beyond-necessary</p>\n\n<p>Axioms - Information\nhttps://internetdynamics.substack.com/p/axioms-information</p>\n",
         "id": "1804",
         "name": " Mark Seery",
         "pub": "2023-04-28T02:46:58",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2023/04/stp-ospf-bgp-complexity.html"
}
