{
   "comments": [
      {
         "comments": [
            {
               "date": "16 May 2024 08:34",
               "html": "<p>That is true, but some people with operational experience keep complaining about convergence times. Anyhow, we&#39;ll cover this setup in the next blog post.</p>\n",
               "id": "2252",
               "name": "Ivan Pepelnjak",
               "pub": "2024-05-16T08:34:57",
               "ref": "2250",
               "type": "comment"
            }
         ],
         "date": "16 May 2024 07:55",
         "html": "<p>We dont use vpc in our setup for vxlan and evpn.We use individual Unique next hop for each Leaf pair .In this case convergence works out easily, when S1--A link fails, S1 withdraws the MAC address and IP address and traffic automatically switches from S1 to S2.</p>\n",
         "id": "2250",
         "name": "HEMANTH RAJ",
         "pub": "2024-05-16T07:55:38",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "16 May 2024 08:36",
               "html": "<p>It&#39;s true that many servers don&#39;t support VPC/MLAG. To be fair, I&#39;ve never seen one unless you count Cumulus Linux as a host ;)</p>\n\n<p>However, that&#39;s irrelevant. The beauty of MLAG is that the server <em>does not know</em> it&#39;s connected to two switches. See https://blog.ipspace.net/2010/10/multi-chassis-link-aggregation-basics.html for more details.</p>\n",
               "id": "2253",
               "name": "Ivan Pepelnjak",
               "pub": "2024-05-16T08:36:40",
               "ref": "2251",
               "type": "comment"
            },
            {
               "date": "16 May 2024 05:01",
               "html": "<p>In the scenario which i am working , We have ESXi hosts with 2 uplinks connected to two Leaf switches,ESXi doesnt support vpc and hence broadcast hashing is not possible.</p>\n\n<p>Esxi sends broadcast traffic on two uplinks and creates a loop with vpc peer link.</p>\n\n<p>When u create vpc on the two  switches, on ESXi puts a error message saying \nLACP system ID is different. In ESxi LACP system ID has to be same on both the leaf switches.</p>\n",
               "id": "2254",
               "name": "HEMANTH RAJ",
               "pub": "2024-05-16T17:01:42",
               "ref": "2253",
               "type": "comment"
            }
         ],
         "date": "16 May 2024 08:06",
         "html": "<p>Many servers (hosts) dont support vpc or multi chassis LAG and hence it is easy to implement vxlan evpn fabrics without LAGs</p>\n",
         "id": "2251",
         "name": "HEMANTH RAJ",
         "pub": "2024-05-16T08:06:05",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2024/05/mlag-vxlan-rerouting.html"
}
