{
   "comments": [
      {
         "comments": [
            {
               "date": "25 September 2024 02:09",
               "html": "<p>From my personal perspective, Cisco launched the campus switches with the LISP control plane only, created tons of whitepapers &quot;proving&quot; LISP is better than EVPN, and probably implemented EVPN control plane only after a large-enough customer complained loudly enough (or threatened to look at alternatives).</p>\n\n<p>You can go through my older LISP blog posts (OK, rants) and the comments to get a bit more history.</p>\n\n<p>As for viability of LISP, as you can see from Bela&#39;s comment, they have a really hard time finding a LISP implementation, and might have to build their own routers. AFAIK, no other major vendor implemented LISP in production gear, and (again, according to Bela) even Cisco is dropping it from some products.</p>\n",
               "id": "2424",
               "name": "Ivan Pepelnjak",
               "pub": "2024-09-25T14:09:55",
               "ref": "2423",
               "type": "comment"
            },
            {
               "date": "25 September 2024 03:47",
               "html": "<p>Interesting to hear there is a lack of LISP suport from other vendors. From my point of view SDA was the vehicle for wider LISP adoption. However, it would appear SDA has not been widely adopted. Cisco&#39;s DNA centre has also been going through a re-branding, and is now known as the Catalyst Centre, removing empasis on it original role. This seems to have happened around the same time that BGP EVPN support crept into IOS-XE. Despite Jeffs comment, these things do raise questions regarding future plans for LISP and the SDA solution.</p>\n",
               "id": "2425",
               "name": " Pete",
               "pub": "2024-09-25T15:47:27",
               "ref": "2424",
               "type": "comment"
            }
         ],
         "date": "25 September 2024 01:28",
         "html": "<p>I think Cisco might have published configuration guides for BGP EVPN on the Cat 9K platforms before any LISP guides. Both control planes are supported, but it was originally the case that choosing LISP meant a DNA and ISE lock in. Other vendors seem to be choosing BGP EVPN for network virtualisation, so will choosing LISP still mean a form of vendor lock in?</p>\n",
         "id": "2423",
         "name": " Pete",
         "pub": "2024-09-25T13:28:50",
         "type": "comment"
      }
   ],
   "count": 1,
   "type": "post",
   "url": "2024/05/repost-state-of-lisp-implementations.html"
}
