{
   "comments": [
      {
         "date": "03 March 2025 02:08",
         "html": "<p>Multicast is heavily used is group communication at least for some vendors implementations of APCO25 and Tetra. It&#39;s Public Safety business.</p>\n",
         "id": "2550",
         "name": " Bogdan Golab",
         "pub": "2025-03-03T14:08:19",
         "type": "comment"
      },
      {
         "date": "20 March 2025 06:03",
         "html": "<p>Hi Ivan. Thank you for that very interesting podcast (and also for your blog).\nYou said (26:40) that &quot;people knew that [client globally end-to-end reachable is] plain stupid and a security risk&quot; because clients only need to connect to servers, and you also mocked zealous IP partisans advocating for for end-to-end connectivity back then. I understand that you are voluntarily being provocative :-)\nFrom my young millenial point of view (31 y.o.), the logic is reversed: it is because of NATs and firewalls that the internet became SO assymetrical (client/server) just like the minitel was designed (yes I am French), wherease the internet (and later the web, although a client/server protocol, was meant for everyone to be a client and a server) was designed to be more balanced. You mentionned that only video-conferencing and bittorrent use client-to-client connectivity (and they are indeed the main use cases), but hell do they need to engineer complex systems to circumvent these NATs and firewalls : STUN, TURN, ICE, DHT, etc.!\nIn short, the difficulty to do client-to-client connectivity is (one of) the (main) reason(s) why it does not happen that much.\nI am the close witness of a CGNAT (so a NAT behind a NAT basically...) yet-to-come implementation and that is a engineering nightmare, a SPOF, and making everything else so much more complex that one client = one IP address. It truly is a HUGE step back on simple design.\nSo in my opinion, NATs and firewalls heavily hinged client-to-client connectivity and are the reason why the (mass market) internet is so unbalanced (and you could argue that this allowed the cloud to happen, then state surveillance, etc. but that&#39;s yet another topic).\nOn the security aspect, it is a complex topic: of course if you made all today&#39;s IP-connected devices and made them globally reachable it would be a botnet nightmare, but that would be a dishonest comparison. The good question is: what if NAT never existed and most devices had indeed been globally reachable? who can tell how things would have turned out in that case? reducing security to network filtering sounds a bit outdated nowadays.\nI would love to read your opinion on my personnal wanderings. Cheers.</p>\n",
         "id": "2571",
         "name": " Bob",
         "pub": "2025-03-20T18:03:12",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2025/03/rise-of-nat.html"
}
