{
   "comments": [
      {
         "comments": [
            {
               "date": "24 March 2025 11:50",
               "html": "<p>Thank you! I was hoping for something better, though &#x1F926;&zwj;&#x2642;&#xFE0F;</p>\n",
               "id": "2576",
               "name": " Ivan Pepelnjak",
               "pub": "2025-03-24T11:50:15",
               "ref": "2575",
               "type": "comment"
            },
            {
               "date": "24 March 2025 03:34",
               "html": "<p>... this might even be the case as a transient state during boot until the configuration has been applied, depending on specific the implementation of course.\nAnd it&#39;s not limited to switches per-se, also routers, firewalls or any other devices with &quot;switchports&quot; <em>could</em> behave like this. I remember of a situation where a customer had 2 Cisco 881 routers from its ISP connected to its LAN &amp; additionally with a direct cross-link between each other. A restart of <em>both routers at the same time</em> would cause a L2 loop (BPDU guard kicked in, fortunately...) because the router&#39;s switchports would act as stupid L2 switch until the config was fully applied.</p>\n",
               "id": "2580",
               "name": " Christoph",
               "pub": "2025-03-24T15:34:11",
               "ref": "2575",
               "type": "comment"
            }
         ],
         "date": "24 March 2025 11:11",
         "html": "<p>Most switches I have seen through the years, <em>when they do not have a configuration</em>, start with all ports active and in the same VLAN (the <em>default</em> VLAN with ID 1). Notable exceptions were Dell OS9 and Cisco Catalyst 6500 starting with all ports disabled and in L3 mode.</p>\n",
         "id": "2575",
         "name": "Erik Auerswald",
         "pub": "2025-03-24T11:11:23",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "24 March 2025 12:14",
               "html": "<p>To add to my previous answer, you could also consider including the following configuration knob in your Arista cEOS containers&#39; startup-config to ensure that all ports are set as routed ports by default:</p>\n\n<p>switchport default mode routed</p>\n\n<p>And if you need a switch port, you can configure it directly by setting the desired port as a switchport:</p>\n\n<p>interface Ethernet1\n  switchport</p>\n",
               "id": "2578",
               "name": " Keanu L",
               "pub": "2025-03-24T12:14:22",
               "ref": "2577",
               "type": "comment"
            },
            {
               "date": "28 March 2025 12:23",
               "html": "<p>Our initial fix was to configure all ports in routed mode, but this allocates an internal vlan to each port:</p>\n\n<p>r#show vlan internal usage \n1006  Ethernet1\n1007  Ethernet2</p>\n\n<p>Some user topologies that were designed to use this VLAN range subsequently failed to deploy. We settled on disabling the ports as a first step, rather than configuring them as routed ports</p>\n",
               "id": "2588",
               "name": " Jeroen van Bemmel",
               "pub": "2025-03-28T00:23:25",
               "ref": "2578",
               "type": "comment"
            },
            {
               "date": "24 March 2025 12:20",
               "html": "<p>Thanks a million for the feedback. I (probably) know what went wrong, will fix the blog post accordingly.</p>\n",
               "id": "2579",
               "name": "Ivan Pepelnjak",
               "pub": "2025-03-24T12:20:08",
               "ref": "2577",
               "type": "comment"
            },
            {
               "date": "24 March 2025 05:04",
               "html": "<p>I&#39;ve never tried ZTP mode on an Arista switch. This seems to be another notable exception to the rule. :-)</p>\n\n<p>With some other vendor, ZTP attempts to get an IP address on either the management port or on the SVI for VLAN 1 (with all front ports in VLAN 1 and active, as before the introduction of ZTP).</p>\n\n<p>Yet other products come in a ZTP mode when purchased where they do not act like a simple bridge, but provide a boot flag to activate &quot;factory defaults&quot; with all front ports active in VLAN 1 and without ZTP.</p>\n\n<p>The introduction of ZTP modes made activating a switch for the first time more interesting, since every vendor (or business unit of a vendor) seems to create a different variant. ;-)</p>\n",
               "id": "2581",
               "name": "Erik Auerswald",
               "pub": "2025-03-24T17:04:22",
               "ref": "2579",
               "type": "comment"
            }
         ],
         "date": "24 March 2025 12:03",
         "html": "<p>HI Ivan,</p>\n\n<p>Thanks for the article, as always!</p>\n\n<p>For your information, on Arista EOS, if no startup-config is found on the switch during boot, the switch enters ZTP mode. By default, this mode sets all ports as &quot;routed&quot; ports to prevent the disaster you mentioned in your article.</p>\n\n<p>This also applies to cEOS: when you boot a container without a startup-config or with an empty startup-config, ZTP mode will be activated.</p>\n\n<p>Thank you.</p>\n",
         "id": "2577",
         "name": " Keanu L",
         "pub": "2025-03-24T12:03:38",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2025/03/stupid-bridges-strike-again.html"
}
