{
   "comments": [
      {
         "date": "06 August 2024 03:23",
         "html": "<p>I have done some migrations on existing hardware, moving from one technology to another. Often related to ACI: either sone enterprises who bought Nexus 9K switches where transitioning to ACI or SDN was mentioned as a benefit during the sales cycle, or enterprises who got ACI form the start but are not using any of its distinguishing features and wanted to get rid of the added &lsquo;complexity&rsquo;.</p>\n\n<p>The transition strategy always used a &lsquo;seed&rsquo; network, using new spine switches and at least a single pair of leaf switches (of each interface &lsquo;type&rsquo;). Which is L2 connected to the existing environment.\nThe idea is to free up the first pair of leaf switches by moving the workloads towards the new &lsquo;seed&rsquo; leaf switches. Next the original leaf switches can be converted or re-configured and added to the new &lsquo;seed&rsquo; network. This process is repeated till all workloads are moved. At a certain point also the L3 functionality must also be converted to the new network, mostly done at the end or after moving 50% of workloads.</p>\n\n<p>For sure this can be a lengthy process (depending on fabric size and how many new leaf &lsquo;seed&rsquo; switches can be purchased), but by using virtualization or application high availability to your advantage, it can be greatly de-risked.</p>\n\n<p>Unless the pain points of a certain technology are enormous, mostly some strategic planning is done along the way, a certain type of leaf switches are nearing EOL, or the server team requires higher bandwidth interfaces. These initiatives make it easier to defend this approach towards the business.</p>\n\n<p>From my experience, transitioning technologies on existing hardware is rather rare, adopting new technologies often is done during hardware lifecycle, where all hardware is replaced by newer models, supporting the latest and greatest features. Migration approaches are similar, but you have full new fabric available, which eases the transition.</p>\n",
         "id": "2359",
         "name": " Bram",
         "pub": "2024-08-06T15:23:17",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "08 August 2024 12:54",
               "html": "<p>Thank you for mentioning this in your blog, but I must explain the reasoning behind my question a bit more.</p>\n\n<p>When Broadcom decided to buy VMware, many Enterprises/MSPs didn&#39;t expect a massive cost surge, namely NSX-T (in some cases, depending on the licensing/features, 100%). My latest case(s) are from companies that purchased brand-new Nexuses (and QFXs) at the beginning of 2023 just to serve as an underlay for the NSX-T. So, they are now in a bit of trouble with the high costs of NSX-T, and they want to avoid proceeding with it.\nAlternative - move away from NSX-T and return the gateways to the switches (Cisco, Junipers, Aristas.. etc.). </p>\n\n<p>Enter &#39;Darko mentioned customers who wanted to use shiny new stuff without investing anything into the hardware or migration services&#39;\nThey have already spent hundreds of thousands/millions of dollars on the new gear. They are so profoundly committed to the NSX-T technology that there are no easy choices regarding migration scenarios: either be a hostage or bite the bullet.</p>\n\n<p>I agree that technology migration needs to be carefully planned/executed; that&#39;s what good CTOs do, but there are cases where you are blindsided, and your hands are tied. </p>\n\n<p>Cheers</p>\n",
               "id": "2361",
               "name": " Darko Petrovic",
               "pub": "2024-08-08T00:54:16",
               "ref": "2360",
               "type": "comment"
            },
            {
               "date": "08 August 2024 06:39",
               "html": "<p>Hey, you should have mentioned the real problem (= ridiculous Broadcom pricing and getting off NSX-T) at the very beginning, and we&#39;d have a completely different conversation.</p>\n\n<p>Will write another blog post on the topic, asking for suggestions.</p>\n",
               "id": "2362",
               "name": "Ivan Pepelnjak",
               "pub": "2024-08-08T18:39:44",
               "ref": "2361",
               "type": "comment"
            }
         ],
         "date": "06 August 2024 11:40",
         "html": "<p>The benefit of VXLAN is mostly scalability so if your enterprise network is not scaling... just don&#39;t. The migration path from VLANs is to just keep using VLANs. The (vendor-driven) networking industry has a huge blind spot about this.</p>\n",
         "id": "2360",
         "name": "Wes Felter",
         "pub": "2024-08-06T23:40:56",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2024/08/data-center-fabric-migration.html"
}
