{
   "comments": [
      {
         "comments": [
            {
               "date": "29 August 2024 09:36",
               "html": "<p>I think we deployed it at one customer who wanted to push all inter-site traffic through a centralized firewall. The hub site advertised the default route and collected the routes from the spoke sites.</p>\n",
               "id": "2397",
               "name": "Ivan Pepelnjak",
               "pub": "2024-08-29T09:36:22",
               "ref": "2396",
               "type": "comment"
            },
            {
               "date": "29 August 2024 11:41",
               "html": "<p>Hi Ivan,</p>\n\n<p>Out of curiosity, for the design you implemented for the centralized firewall, was your VPN label allocation for the HUB VRF done per prefix or per CE allocation?</p>\n\n<p>With per VRF VPN label allocation, the PE hosting the hub VRF would perform an IP lookup after popping the VPN label. Since it has all the routes to the other spokes, traffic between spoke sites would be possible without going through the firewall. Spokes could reach each other via the hub, as they are drawn by the default route.</p>\n\n<p>I had a similar use case for a customer in Arista, where currently only the per VRF label allocation mode is supported. We had to be a bit more creative and ended up using two HUB VRFs: one for traffic coming from the spokes (HUB-IN) and one for traffic going to the spokes (HUB-OUT). The first HUB VRF would only export the default route learned from the firewall in MP-BGP, while the second VRF would only import the spokes&#39; routes.</p>\n",
               "id": "2398",
               "name": "Keanu L ",
               "pub": "2024-08-29T11:41:30",
               "ref": "2397",
               "type": "comment"
            },
            {
               "date": "29 August 2024 12:35",
               "html": "<p>@Keanu: IIRC Cisco IOS used pre-prefix allocation as default in those days, so it was a no-brainer.</p>\n\n<p>If one were to use the per-VRF label, then of course, one would have to use ingress and egress hub VRFs (the traditional hub-and-spoke architecture described in a few MPLS books)</p>\n",
               "id": "2401",
               "name": "Ivan Pepelnjak",
               "pub": "2024-08-29T12:35:36",
               "ref": "2398",
               "type": "comment"
            },
            {
               "date": "29 August 2024 12:02",
               "html": "<p>Fun article and great to see support for this added in Netlab.</p>\n\n<p>Full disclosure, I currently work as SE at Arista. Responding here because I was surprised for this not to be as well known as I had thought it would be.</p>\n\n<p>We see importing/exporting of different services happening quite often in the field, and it is also fully supported (and tested) both from EOS perspective - and it&#39;s modelled in the AVD data models (and now in netlab - thanks :-D) to allow easy network-wide deployment methods.</p>\n",
               "id": "2399",
               "name": " Joris C",
               "pub": "2024-08-29T12:02:14",
               "ref": "2396",
               "type": "comment"
            }
         ],
         "date": "29 August 2024 09:07",
         "html": "<p>Thank you for pointing out that this is still a thing. I learned about those hub/common/services networks during my early days as a network engineer running a MPLS network. Unfortunatly I&#39;ve never seen it anywhere else, despite it being a really cool &quot;trick&quot;. Thaught it a lot of other engineers who where learing about MPLS and BGP and it makes me happy seeing it&#39;s still alive with EVPN. Thank you.</p>\n",
         "id": "2396",
         "name": " Daniel S",
         "pub": "2024-08-29T09:07:30",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "29 August 2024 12:36",
               "html": "<p>Thank you for the feedback! This has been available in netlab for quite a while (probably since we added EVPN support), but nobody ever said, &quot;I wonder what would happen if...&quot; ;)</p>\n",
               "id": "2402",
               "name": "Ivan Pepelnjak",
               "pub": "2024-08-29T12:36:26",
               "ref": "2400",
               "type": "comment"
            }
         ],
         "date": "29 August 2024 12:03",
         "html": "<p>Fun article and great to see support for this added in Netlab.</p>\n\n<p>Full disclosure, I currently work as SE at Arista. Responding here because I was surprised for this not to be as well known as I had thought it would be.</p>\n\n<p>We see importing/exporting of different services happening quite often in the field, and it is also supported (and tested) from an EOS perspective - as well is it modelled in the AVD data models (and now in netlab - thanks :-D) to allow easy network-wide deployment methods.</p>\n",
         "id": "2400",
         "name": " Joris C",
         "pub": "2024-08-29T12:03:02",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "29 August 2024 01:04",
               "html": "<p>&gt; It seems that the transit VXLAN acts as something similar as a inner VRF label in an MPLS VPN network</p>\n\n<p>Yes, it&#39;s effectively per-VRF inner label.</p>\n\n<p>&gt; maybe VPN hub&amp;spoke topologies with EVPN SR-MPLS would be simpler and better supported by the vendors</p>\n\n<p>You&#39;d have to talk to vendor PLMs, my vague personal impression from the outside is that everyone is focused on VXLAN in the data center, and that MPLS gets implemented when a big enough customer pushes the vendor to do it (Cisco is an obvious exception because it pushes SRv6).</p>\n",
               "id": "2404",
               "name": "Ivan Pepelnjak",
               "pub": "2024-08-29T13:04:24",
               "ref": "2403",
               "type": "comment"
            }
         ],
         "date": "29 August 2024 12:44",
         "html": "<p>I have designed several data center networks with common service VRFs (monitoring, backup, etc) but with regular MLAG L2 &quot;fabrics&quot; and MPLS routers on the stick. ACI do have a common tenant. I have been thinking of having the same topology with EVPN, so this post is very useful.</p>\n\n<p>However, it seems that the transit VXLAN acts as something similar as a inner VRF label in an MPLS VPN network. Just wondering, maybe VPN hub&amp;spoke topologies with EVPN SR-MPLS would be simpler and better supported by the vendors than EVPN VXLAN, guess that EVPN SR-MPLS is used by the WAN providers....? </p>\n",
         "id": "2403",
         "name": " Patrick",
         "pub": "2024-08-29T12:44:11",
         "type": "comment"
      },
      {
         "date": "04 September 2024 09:37",
         "html": "<p>Thanks for another very instructive post.</p>\n\n<p>I considered your approach a while ago trying to replace the above discussed common services VRF based on MPLS L3VPN with EVPN. </p>\n\n<p>Challenge is when only a default route is advertised from the common services VRF.\n- In MPLS we used per-prefix label allocation; label action on PE for 0.0.0.0/0 happens without route-lookup so label gets popped and traffic sent to the firewall. (desired scenario)\n- In EVPN there is no label switching; route lookup for destination happens on hub and traffic is directly sent back to a spoke without traversing the firewall.</p>\n\n<p>So without deploying another layer of complexity with PBR or &quot;IN-VRF&quot; and &quot;OUT-VRF&quot; to redirect traffic to the firewall, how would you solve this in your scenario?</p>\n",
         "id": "2406",
         "name": " Martin",
         "pub": "2024-09-04T09:37:38",
         "type": "comment"
      }
   ],
   "count": 4,
   "type": "post",
   "url": "2024/08/evpn-common-services-vrf.html"
}
