{
   "comments": [
      {
         "comments": [
            {
               "date": "13 August 2024 03:34",
               "html": "<p>The only VLANs needed in this setup are the internal VLANs used for VXLAN-based transport (one per VRF). They are assigned dynamically (as needed) and don&#39;t have to match across the PE devices.</p>\n\n<p>However, if you deployed all 409x VLANs on every access switch, you have a bigger problem ;)</p>\n",
               "id": "2379",
               "name": "Ivan Pepelnjak",
               "pub": "2024-08-13T15:34:05",
               "ref": "2378",
               "type": "comment"
            }
         ],
         "date": "13 August 2024 03:25",
         "html": "<p>how does this actually scale in larger environments or even existing environments where majority of the VLANs have already been consumed?</p>\n\n<p>ps. don&#39;t deploy vxlan, however i&#39;d like to understand more</p>\n",
         "id": "2378",
         "name": "darshan",
         "pub": "2024-08-13T15:25:25",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "13 August 2024 05:26",
               "html": "<p>The obvious answer is &quot;We don&#39;t know&quot; (thank you, Broadcom, we love your NDAs), but I suspect it might be more of a case of a vendor doing a less-than-optimal job (in the case of L3VPN, L2VPN is another story)</p>\n",
               "id": "2381",
               "name": "Ivan Pepelnjak",
               "pub": "2024-08-13T17:26:44",
               "ref": "2380",
               "type": "comment"
            }
         ],
         "date": "13 August 2024 05:07",
         "html": "<p>Regarding &quot;the transit VNI does not have to match across the PE devices&quot; you are going to cover it in the future post, I speculate there could be a chipset limitations forcing the VNI to be the same or &quot;symmetric&quot;. This limitation is documented for Juniper&#39;s ACX7100, so is this the case for anything Jericho2 based?</p>\n",
         "id": "2380",
         "name": "Martin Rusko",
         "pub": "2024-08-13T17:07:35",
         "type": "comment"
      },
      {
         "date": "13 August 2024 10:24",
         "html": "<p>AFAIK, not all the vendors require to have <em>dynamic virtual VLANs</em> to map a L3VNI.</p>\n\n<p>I.e., Aruba CX and Dell OS10 don&#39;t (and - despite I hope nobody&#39;s doing that - you can potentially use for your network all the VLAN IDs).</p>\n\n<p>Additionally, they also allow to statically set the <em>router-mac</em> to use on the L3VNI and RT5 announces (i.e. https://www.arubanetworks.com/techdocs/AOS-CX/10.08/HTML/vxlan/Content/Chp_EVPN/EVPN_cmds/vir-mac.htm)</p>\n\n<p>Also Linux (frr, vyos, ...) does not require dynamic vlans, but instead requires to allocate a <em>dedicated bridge interface</em> (with no bridge slaves, apart from the vxlan device which maps the vni id) to be used for r-macs.</p>\n",
         "id": "2382",
         "name": " Stefano Sasso",
         "pub": "2024-08-13T22:24:23",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2024/08/layer-3-only-evpn-behind-scenes.html"
}
