{
   "comments": [
      {
         "comments": [
            {
               "date": "27 August 2024 06:20",
               "html": "<p>Thanks for the feedback Alex!</p>\n\n<p>Just a minor detail: I absolutely didn&#39;t want to make light of EANTC work; I just wanted to say that the environment in which those tests are executed often differs slightly from what one might encounter in a typical deployment. I would suspect that the software images are not exactly the LTS releases, and the people configuring the boxes might know a bit more about the nerd knobs and inner workings of the devices than an average networking engineer.</p>\n\n<p>Best, Ivan</p>\n",
               "id": "2395",
               "name": "Ivan Pepelnjak",
               "pub": "2024-08-27T18:20:49",
               "ref": "2394",
               "type": "comment"
            }
         ],
         "date": "27 August 2024 05:59",
         "html": "<p>Hi Ivan, great work. </p>\n\n<p>EVPN has come a long way, for unicast services there is now a level of maturity and feature consistency across vendors for the most common deployment models; vlan-based, A-A and symmetric IRB, to ensure successful interop. This is illustrated in the EANTC test reports of the past few years, with the focus now moving to more complex deployment models involving dual-stack, OISM and EVPN GWs. </p>\n\n<p>I don&rsquo;t think we should make light of the EANTC work, it&rsquo;s an independent test event which all the major vendors attend, with the sole aim of validating interoperability through compliance to the IETF standards. So the focus is not just making things work but rather ensuring compliance to the relevant standard(s) with the results independently verified.</p>\n\n<p>Happy to discuss further if you have any questions.  </p>\n\n<p>Alex</p>\n",
         "id": "2394",
         "name": "Alex",
         "pub": "2024-08-27T17:59:44",
         "type": "comment"
      },
      {
         "date": "23 September 2024 12:02",
         "html": "<p>Ivan, very interesting, thanks for this.</p>\n\n<p>A couple of things called my attention for srl:</p>\n\n<p>Central routing \nUnnumbered EBGP</p>\n\n<p>Both are fully supported in srlinux. For central routing, proxy-arp is needed in the layer-2 leaf node, since srlinux assumes the central IRB mac/ip will be distributed via EVPN.</p>\n\n<p>In case it helps..\nThanks.\nJorge</p>\n",
         "id": "2420",
         "name": " Jorge",
         "pub": "2024-09-23T12:02:35",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2024/08/multivendor-evpn-reality.html"
}
