{
  "comments": [
    {
      "date": "08 April 2014 18:32",
      "html": "This comment has been removed by the author.",
      "id": "7109171857516071129",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Bhargav",
      "profile": "https://www.blogger.com/profile/03803244374816795623",
      "pub": "2014-04-08T18:32:13.901+02:00",
      "ref": "3253067869062104914",
      "type": "comment"
    },
    {
      "date": "08 April 2014 18:55",
      "html": "How many times a year would customers use HA using Redundant Supervisors(RS) ?. Hardly once or twice an year ?. Assuming good engineering, why would one build a complex solution that is hardly used and is expensive to develop/test/maintain/support. Add GR to the complexity. In reality, HA using RS is one of weak link for most vendors. <br /><br />If one were to use BRCM T2 at the ToR with dual homed server, should you care about bandwidth ?. ",
      "id": "1550771803206911217",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Bhargav",
      "profile": null,
      "pub": "2014-04-08T18:55:20.892+02:00",
      "ref": "3253067869062104914",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "12 April 2014 12:31",
          "html": "VSS is even more complex than redundant supervisors within a single box.<br /><br />As for L2 versus L3 - it all depends on your environment. In data centers I recommend going with overlay solutions (VXLAN etc.) and small L3 subnets in the transport network (usually two ToR switches), campus is obviously a different story.",
          "id": "5702273128195445943",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2014-04-12T12:31:26.905+02:00",
          "ref": "7112986668706238076",
          "type": "comment"
        }
      ],
      "date": "10 April 2014 15:12",
      "html": "Good post and i agree with a lot if it. <br /><br />Re campus designs, where do you see things like VSS/MEC in what you say. It is a pair of core switches and you can get the full bandwidth from your access layer uplinks but only one of the switches actually runs a control plane although they both forward. <br /><br />Sort of halfway between a pair of core switches and a single switch ? <br /><br />** VSS quad sups though really doesn&#39;t seem to offer any significant advantages and introduces more complexity.<br /><br />In terms of managing multiple switches, again using Cisco as an example, the 6880ia FEX solution would help alleviate some of those concerns.  <br /><br />Where i do slightly disagree is when you say ideally you would use L3 from the access layer. Before things like VSS etc. you were totally reliant on STP and the argument to use L3 was quite compelling. But now i am not so sure. <br /><br />The problem is L2 is just more flexible in terms of what you may need further down the line. Your example of needing to span a vlan across multiple access layer switches is a great one because it always seems to crop up. Yes you could span a vlan over a L3 network but that adds additional complexity and if you are not careful your network starts to look a bit of a kludge. <br /><br />Extending VRFs back to a L3 access layer is also more complex than simply applying the VRFs to the SVIs on the core/distro switches. <br /><br />I always feel when designing L3 from the access layer i am going to get a requirement further on where if i had a L2 access layer it would be trivial but with L3, even though possible, it becomes more complex. <br /><br />And isn&#39;t that what design is about ie. you design not just for now but also for what might be needed in future :-) ",
      "id": "7112986668706238076",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2014-04-10T15:12:15.245+02:00",
      "ref": "3253067869062104914",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "08 September 2014 19:23",
          "html": "Good questions!",
          "id": "3660275547390410589",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Paul",
          "profile": "https://www.blogger.com/profile/14293428971563695218",
          "pub": "2014-09-08T19:23:18.096+02:00",
          "ref": "4090951571791055867",
          "type": "comment"
        }
      ],
      "date": "12 April 2014 22:45",
      "html": "Ivan <br /><br />Re. the DC. Does that depend on the size ? <br /><br />I am just getting up to speed on VXLAN/FabricPath/leaf and spine etc. <br /><br />Where i am struggling is seeing in particular how VXLAN and FabricPath fit together or even if they do ie. VXLAN extends L2 across L3, FabricPath seems to be all about L2 but being able to use all links and taking the shortest path. <br /><br />And then tieing in leaf and spine ie. with a L3 leaf and spine i can see the argument for VXLAN. With a L2 leaf and spine would it not make sense to simply use FabricPath and extend the vlans back to the racks ie. no need for VXLAN. <br /><br />Or does that just not scale very well ?<br /><br />I understand VXLAN can only use the paths made available to it so i could see in a large DC there may be an argument for combining VXLAN with FabricPath but i&#39;m just speculating there. <br /><br />And with VXLAN being an overlay do you not lose visibility and to some extent the intelliegence of your network infrastructure ? <br /><br />I&#39;m not expecting answers to all the above :-), i was just wondering if you cover all those points in the webinars and if so which ones would be good to get. <br /><br />I really want to understand it as much from a design perspective as an implementation one. <br />",
      "id": "4090951571791055867",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2014-04-12T22:45:57.182+02:00",
      "ref": "3253067869062104914",
      "type": "comment"
    },
    {
      "date": "19 December 2014 14:04",
      "html": "Where is the answer?",
      "id": "8396927715714781478",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Billy",
      "profile": null,
      "pub": "2014-12-19T14:04:28.228+01:00",
      "ref": "3253067869062104914",
      "type": "comment"
    }
  ],
  "count": 7,
  "id": "3253067869062104914",
  "type": "post",
  "url": "2014/04/should-we-use-redundant-supervisors.html"
}