{
   "comments": [
      {
         "date": "31 July 2020 08:23",
         "html": "Words from Daniel Dibb:<br />\n\n<p>&quot;The next time your management claims IT is not your core business, remind them that Maersk, a shipping and logistics giant founded in 1904, with 35 billion revenue anually, almost went out of business due to ransomware affecting AD and Windows env. IT IS your core business.&quot;</p>\n\n<p>Sometimes the CxO&#39;s need to be reminded before %$#@ hits the fan. And there&#39;s no better time than now, just ask Garmin.</p>\n\n<p>In fact, I would argue that a solid security scheme can be executed with a mix of open source software and hardening your existing server configs. No need to wait for your next unicorn budget, make do with what you already have. Focus on the Mitre A@ttack framework&#39;s point of entries. Forget the silver bullet, work at improving what you already have in place, get visibility and logging in place (nxlog, sysmon, graylog is a great start).</p>\n\n<p>If you absolutely need to buy that fancy box, make sure you look at what&#39;s already out there 1st. (Security onion, opnsense, graylog, efa, helk, and many more. )</p>\n\n<p>Mario</p>\n",
         "id": "96",
         "name": " ",
         "pub": "2020-07-31T20:23:38",
         "type": "comment"
      },
      {
         "date": "01 August 2020 11:19",
         "html": "<p>@Mario: While I completely agree with everything you wrote, unfortunately your ideas go straight against the mentality described in the article. CxOs want to offload what they consider to be non-essential parts of their business (cleaning, power, air conditioning, water, IT...) not be burdened with staff that glues together an open-source puzzle.</p>\n\n<p>You might be able to start a service company that takes the open-source bits and integrates them into something a CxO can buy though. I know several companies using this model. IBM/RH immediately comes to mind ;), and would be Gartner-blessed on top of everything else, but there are also small companies doing a great job in this space.</p>\n",
         "id": "97",
         "name": "Ivan Pepelnjak",
         "pub": "2020-08-01T11:19:13",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2020/07/worth-reading-how-ceos-think.html"
}
