{
   "comments": [
      {
         "date": "15 April 2020 11:12",
         "html": "<p>I can&rsquo;t agree more but when you present tour idea to a bunch of people that follow only what vendors say you become like an idiot that try to reinvent the wheel.</p>\n\n<p>Long story short as you say: are you more experienced than vendor&rsquo;s principal engineers?</p>\n",
         "id": "6",
         "name": "Driss",
         "pub": "2020-04-15T23:12:49",
         "type": "comment"
      },
      {
         "date": "16 April 2020 08:32",
         "html": "<p>&quot;when you present tour idea to a bunch of people that follow only what vendors say you become like an idiot that try to reinvent the wheel&quot; &lt;&lt; at which point you walk away and start looking for other opportunities. There&#39;s absolutely no way a reasoned argument will persuade religious zealots.</p>\n\n<p>&quot;are you more experienced than vendor&#39;s principal engineers&quot; &lt;&lt; No. But...</p>\n\n<ul>\n<li>Do I have a different perspective? Yes - they focus on building their products and inventing new technologies that will differentiate their products, I focus on stable networks.</li>\n<li>Do I have different experience? Yes - they see crazy customer problems waiting to be &quot;solved&quot; (instead of incinerated with napalm), I see network meltdowns.</li>\n<li>Do I have different priorities? Yes - they have to create the best possible tool based on 20 years of legacy code, I have to select the best tool for the job (regardless of which vendor gets the P/O).</li>\n</ul>\n\n<p>Also, assuming the vendor&#39;s principal engineers are focused on creating the best possible solution, there&#39;s a layer of marketing and sales between them and the customer, and those layers add a different spin - while I&#39;m focused on long-term customer success and network stability, most of them have a product to sell and a deal to close.</p>\n\n<p>Obviously there are people who don&#39;t get the nuances like this, in which case it&#39;s better to spend your time and energy somewhere else.</p>\n",
         "id": "12",
         "name": "Ivan Pepelnjak",
         "pub": "2020-04-16T08:32:44",
         "type": "comment"
      },
      {
         "date": "26 April 2020 09:25",
         "html": "Something somewhat related:<br />\nhttps: //anetworkartist.blogspot.com/2020/04/do-you-really-need-vxlan-in-modern-data.html<br />\n\n\n",
         "id": "23",
         "name": "BOGDAN GOLAB",
         "pub": "2020-04-26T09:25:19",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2020/04/stupidity-stretched-vlan.html"
}
