{
  "comments": [
    {
      "date": "05 March 2010 00:12",
      "html": "Funny, I knew what are you talking about even sooner I have read what is it about :)<br /><br />&quot;Oh, they are blaming my favorite toy! Shame on them!&quot;  &gt;:o<br /><br />Sorry, you have got a cisco seal on your forehead.",
      "id": "3420970221842878009",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "davro",
      "profile": null,
      "pub": "2010-03-05T00:12:29.000+01:00",
      "ref": "1923126133195970761",
      "type": "comment"
    },
    {
      "date": "05 March 2010 18:32",
      "html": "You&#39;ve got it all wrong. UCS is not my favorite toy. I have never seen or touched one; I just happen to understand its architecture and the underlying design goals.<br /><br />As I said, I&#39;m positive all vendor-financed &quot;independent&quot; &quot;competitive&quot; tests are (by design) biased enough to be useless; I just happen to understand what this particular vaporware was all about.<br /><br />Also, if you had been reading my blog, you&#39;d have realized I happily bash Cisco (for example, due to the lack of IPv6 support in Data Center).",
      "id": "92533007142640724",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ivan Pepelnjak",
      "profile": null,
      "pub": "2010-03-05T18:32:35.000+01:00",
      "ref": "1923126133195970761",
      "type": "comment"
    },
    {
      "date": "15 March 2010 09:46",
      "html": "Ok, you may be right on technical things like they didn&#39;t used right methodology.<br /><br />But when I first saw that report in headlines, I thought &quot;Hmmm, this will really upset cisco guys!&quot; (and I must admit, I haven&#39;t read that report), and what a surprise, you were one who reacted angrily (we call it like a hit goose).<br /><br />As an independent reporter, I would expect you react like &quot;Hmm, interesting results, but they use wrong methodology...&quot;",
      "id": "5775809271780511295",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "davro",
      "profile": null,
      "pub": "2010-03-15T09:46:01.000+01:00",
      "ref": "1923126133195970761",
      "type": "comment"
    },
    {
      "date": "15 March 2010 17:12",
      "html": "Well, you haven&#39;t seen me reacting angrily yet ;) ... and I&#39;m not an &quot;independent reporter&quot; but an old extroverted opinionated GONER 8-)<br /><br />You&#39;ve also missed the point; it&#39;s never been the question of &quot;methodology&quot; (I could argue individual techical points if that would be the case), it&#39;s the question of whether the test setup makes any sense in the real life or whether it&#39;s totally irrelevant to what we use outside of ivory towers (ehmm ... labs) and was designed only to prove that one architecture is better tailored to the test than another.<br /><br />I had to endure these stunts (sponsored by every imaginable vendor) since these &quot;independent testers&quot; entered the industry (looking at their web site, I&#39;m working with routers longer than they were running their tests) and while I managed to ignore them during the last few years, the latest one reminded me of my past grudges  :-E",
      "id": "534271436669618113",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ivan Pepelnjak",
      "profile": null,
      "pub": "2010-03-15T17:12:52.000+01:00",
      "ref": "1923126133195970761",
      "type": "comment"
    },
    {
      "date": "04 June 2010 21:11",
      "html": "Thanks for including my blog post (http://bit.ly/bUNe8b) in your post.  It&#39;s interesting to see how passionate Cisco is for their product line!",
      "id": "8533491208572515555",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Kevin Houston",
      "profile": null,
      "pub": "2010-06-04T21:11:28.000+02:00",
      "ref": "1923126133195970761",
      "type": "comment"
    }
  ],
  "count": 5,
  "id": "1923126133195970761",
  "type": "post",
  "url": "2010/02/lies-damned-lies-and-independent.html"
}