{
  "comments": [
    {
      "date": "13 February 2010 00:31",
      "html": "The problem is who takes the initiative in deploying IPv6- the SP or the web-content provider? Google is certainly showing the web-content providers should take the initiative.  Most SPs&#39; major customers are the home-users (broadband users). SPs should start assigning IPv6 addresses to these customers. <br /><br />Jeff Doyle on his blog has explained a great upcoming technology called Dual-stack lite where the end-users continue to use IPv4 addresses(private addresses) but their CPE tunnels IPv4 packets into IPv6 packets to the SP network where these packets are decapsulated and NAT (private IPv4 to public IPv4) is done. Hence, the end-users need not upgrade anything while the SP can install a Dual-stack Lite compatible CPE and perform NAT at the SP-end.<br /><br />However, I think the best would be to just move away to all-IPv6 network rather than getting into the mess of NAT. So the best way to convince the customers is to just bluntly tell them &quot;You will become obsolete eventually&quot;. =-X",
      "id": "7774668076430236878",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Amit",
      "profile": null,
      "pub": "2010-02-13T00:31:44.000+01:00",
      "ref": "3716595304325274834",
      "type": "comment"
    },
    {
      "date": "13 February 2010 12:54",
      "html": "The best one is 6VPE because in this no SP requires to migrate ipv4 backbone to ipv6 immediately. But the customers can use IPv6. For internet dual stack or NATPT is the best one.<br /><br />regards<br />shivlu jain",
      "id": "5541115636788795718",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "shivlu jain",
      "profile": null,
      "pub": "2010-02-13T12:54:39.000+01:00",
      "ref": "3716595304325274834",
      "type": "comment"
    },
    {
      "date": "21 February 2010 16:21",
      "html": "You probably meant 6PE. You only need 6VPE if you offer IPv6 VPNs (and not many people need those). BTW, forget NAT-PT. It&#39;s extinct, should not be used, and the IOS implementation is &quot;somewhat&quot; broken since they&#39;ve removed fast switcihng from the IOS code.",
      "id": "4665724871845958264",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ivan Pepelnjak",
      "profile": null,
      "pub": "2010-02-21T16:21:25.000+01:00",
      "ref": "3716595304325274834",
      "type": "comment"
    },
    {
      "date": "22 February 2010 08:59",
      "html": "I think, During the migration phase NAT-PT is required if the customer is not willing to create the GRE tunnnel.<br />Another concern for NAT-PT is when the user is using only IPv4 and wants to communicate with IPv6.<br />Please share your thought process.",
      "id": "5169244350003097791",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "shivlu jain",
      "profile": null,
      "pub": "2010-02-22T08:59:42.000+01:00",
      "ref": "3716595304325274834",
      "type": "comment"
    }
  ],
  "count": 4,
  "id": "3716595304325274834",
  "type": "post",
  "url": "2010/02/my-customers-are-not-interested-in-ipv6.html"
}