{
   "comments": [
      {
         "comments": [
            {
               "date": "13 June 2021 10:48",
               "html": "<p>@Hoang: The data plane is similar to what I described, the control plane is different:</p>\n\n<ul>\n<li>DHCP server is probably implemented in every Azure server (and thus distributed)</li>\n<li>The forwarding entries are not installed based on DHCP replies but straight from the orchestration system data.</li>\n</ul>\n",
               "id": "657",
               "name": "Ivan Pepelnjak",
               "pub": "2021-06-13T10:48:05",
               "ref": "653",
               "type": "comment"
            },
            {
               "date": "13 June 2021 12:16",
               "html": "<p>Thanks Ivan. FYI, Juniper has this feature (installing access route) enabled by default. I used to be surprised by a bunch of these /32 routes on my router, and had to turn it off.</p>\n\n<p>https://www.juniper.net/documentation/us/en/software/junos/dhcp/topics/topic-map/dhcp-access-supressing.html</p>\n\n<p>This kind of setup also eliminates many Layer-2 attacks like ARP spoofing, DHCP spoofing, right? Have you seen any enterprises using this in production?</p>\n",
               "id": "661",
               "name": "Hoang Tran",
               "pub": "2021-06-13T12:16:34",
               "ref": "657",
               "type": "comment"
            },
            {
               "date": "13 June 2021 03:42",
               "html": "<p>The setup we&#39;re discussing here would be most useful in access networks (example: campus). In data centers you&#39;re usually faced with a dumb L2 switch in the hypervisor, and it makes little sense trying to fix the damage at the next hop (ToR switch).</p>\n\n<p>Unfortunately I haven&#39;t been working with campus networks for ages, so I can&#39;t tell you what&#39;s happening out there.</p>\n",
               "id": "662",
               "name": "Ivan Pepelnjak",
               "pub": "2021-06-13T15:42:36",
               "ref": "661",
               "type": "comment"
            }
         ],
         "date": "12 June 2021 04:31",
         "html": "<p>Just read your blog post about Azure Networking 101. I guess their Azure router and DHCP setup may look very similar to this, right?</p>\n",
         "id": "653",
         "name": "Hoang Tran",
         "pub": "2021-06-12T16:31:31",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "13 June 2021 10:51",
               "html": "<p>@Anonymous: Yes, <em>rtr</em> is performing proxy ARP.</p>\n\n<p>Based on that you should be able to figure out the details of the ARP tables, or you could set up a lab using my configs (or even just my lab setup instructions) and see the details for yourself.</p>\n",
               "id": "659",
               "name": "Ivan Pepelnjak",
               "pub": "2021-06-13T10:51:15",
               "ref": "655",
               "type": "comment"
            }
         ],
         "date": "12 June 2021 08:39",
         "html": "<p>So for the pings from c1 to c2 to work, rtr is performing proxy ARP, correct? Could you share ARP tables from router and clients?</p>\n",
         "id": "655",
         "name": "Anonymous",
         "pub": "2021-06-12T20:39:07",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "13 June 2021 10:49",
               "html": "<p>@Florian: Call it a &quot;<em>somewhat suboptimal configuration template</em>&quot; ;)</p>\n\n<p>IOS ignores the host portion of the IP prefix specified in the <strong>network</strong> statement, so it all works as configured.</p>\n",
               "id": "658",
               "name": "Ivan Pepelnjak",
               "pub": "2021-06-13T10:49:30",
               "ref": "656",
               "type": "comment"
            }
         ],
         "date": "13 June 2021 06:46",
         "html": "<p>Is it a typo or why is the &quot;network&quot; statement in the DHCP pool config set to 10.42.42.1 255.255.255.0 instead of 10.42.42.0 255.255.255.0 ?</p>\n",
         "id": "656",
         "name": " Florian",
         "pub": "2021-06-13T06:46:27",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2021/06/unnumbered-ethernet-dhcp.html"
}
