{
   "comments": [
      {
         "comments": [
            {
               "date": "15 October 2014 17:49",
               "html": "Migrating from NoSQL to SQL and back means living with the least common denominator: fixed-column tables without server-side joins and transactions. Like using ACLs as the least common packet filtering denominator.",
               "id": "4925824726052118175",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "Ivan Pepelnjak",
               "profile": "https://www.blogger.com/profile/13457151406311272386",
               "pub": "2014-10-15T17:49:40.412+02:00",
               "ref": "6163002472356175657",
               "type": "comment"
            }
         ],
         "date": "15 October 2014 07:38",
         "html": "Hi Ivan,<br />most of the nowadays web frameworks have their own ORMs which allow them to communicate with a few of the most popular databases. RoR has ActiveRecord, Sails has Waterline. These kind of abstractions allow you to migrate from NoSQL to SQL and back without modifying your code. However, as you&#39;d expect, they provide their own API to the application.",
         "id": "6163002472356175657",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Michael Kashin",
         "profile": "https://www.blogger.com/profile/14125341240086592055",
         "pub": "2014-10-15T07:38:42.243+02:00",
         "ref": "2071051345157865237",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "15 October 2014 17:47",
               "html": "New release, new feature, new syntax ;)",
               "id": "5460929106469945898",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "Ivan Pepelnjak",
               "profile": "https://www.blogger.com/profile/13457151406311272386",
               "pub": "2014-10-15T17:47:55.088+02:00",
               "ref": "1130363661478250533",
               "type": "comment"
            }
         ],
         "date": "15 October 2014 14:33",
         "html": "I&#39;m not very familiar with databases so this question might come across as dumb. But how often does the underlying syntax of databases change compared to that of Network vendors? Or is that a non-problem?",
         "id": "1130363661478250533",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "John",
         "profile": "http://solutions-haven.com",
         "pub": "2014-10-15T14:33:25.656+02:00",
         "ref": "2071051345157865237",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "16 October 2014 02:36",
               "html": "Database changes are rarely confined to the database in any non-trivial IT infrastructure. They typically impact and require changes to ETL processes, data warehouses, integrations, web service APUs, etc. And these changes affect *persistent* valuable business data.<br /><br />In comparison, network changes impact only ephemeral data in flight, and rollback is easy.<br /><br />Networking just isn&#39;t that complicated compared with the hugely complex and varied application and data sectors of the industry. Which is why everyone gets pissed that netwoks are so slow to adapt, and so very fragile. I blame lack of competition and the cult of Cisco.",
               "id": "8539482048027121215",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "RPM",
               "profile": "https://www.blogger.com/profile/12675510409950425811",
               "pub": "2014-10-16T02:36:33.032+02:00",
               "ref": "1646518294544611417",
               "type": "comment"
            },
            {
               "date": "17 October 2014 03:55",
               "html": "I stand corrected, in my previous post I fell for the Grass is always greener over the fence fallacy.<br /><br />Cult of Cisco I do agree but that was 1998-2013, future looks more interesting and diverse for networking now, hopefully.<br /><br />Maybe the problem is in the process, when a database change is made there is a project, consensus and everyone at the table, DBAs, system admins, systems analysts, developers, ETL specialists etc ...<br /><br />But in networking it seems people are left to their own devices, no one wants to get involved because networking seems like some black magic because although end to end connectivity seems like something so obviously simple they don&#39;t understand why its so complicated in practice. In my experience most technical people above the network layer and PMs gloss over networking and give it short consideration. ",
               "id": "1110875428314682152",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "DourCdn",
               "profile": "https://www.blogger.com/profile/11864545777285752230",
               "pub": "2014-10-17T03:55:29.572+02:00",
               "ref": "1646518294544611417",
               "type": "comment"
            }
         ],
         "date": "15 October 2014 23:22",
         "html": "I&#39;m probably not going to be coherent but the difference that I see with a database versus a router is that when you make a change to a database (add table, delete table, insert row, etc ...) the change is confined to to the database system (except if there were reports or API&#39;s depending on those tables). When you make a change on the router it affects other peers and in fact the &quot;network&quot; or the algorithms that manage this distributed network are adapting or adjusting themselves in near real-time to the changes you are making.<br /><br />I think this dynamic adaption is the difference between networking and the rest of IT. In the rest of IT when things fail they fail hard, its easy to spot. When networking fails, it could fail hard or it could be hidden by these dynamic algorithms. <br /><br />Not sure if this non-determinism is good or bad, but from the perspective of other IT groups it looks like we are not in full control of our networks.<br /><br />Other than that I feel a lot more confident and less stressed having to enter commands into a DB CLI than a router CLI even in a lab environment.",
         "id": "1646518294544611417",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Unknown",
         "profile": "https://www.blogger.com/profile/06282805246388430473",
         "pub": "2014-10-15T23:22:07.263+02:00",
         "ref": "2071051345157865237",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "16 October 2014 14:21",
               "html": "&gt; Or spending days to prove other people that it&#39;s NOT a network issue ?<br /><br />This is the same thing one layer above, with hosting providers &quot;vs&quot; developers. Always the fault of the provider unless you prove otherwise.<br /><br />",
               "id": "1775478989031536056",
               "image": "https://resources.blogblog.com/img/blank.gif",
               "name": "NsL",
               "profile": null,
               "pub": "2014-10-16T14:21:43.352+02:00",
               "ref": "5700329201234047702",
               "type": "comment"
            }
         ],
         "date": "16 October 2014 00:03",
         "html": "Networking IS quite special (not necessarily in the good way), mostly because:<br />A. Quite a few people understand it (correctly; for some of them servers are part of the network).<br />B. Quite a few people see its importance/value.<br /><br />For databases, the value is quite clear : it holds data that makes the business work. Network (pretty much like electricity) is considered as &quot;just existing&quot; (and annoying). Did you never met people saying &quot;it&#39;s a network problem&quot; (when it&#39;s not) or &quot;isn&#39;t there some network issue ?&quot;, just because they are out of any other idea ? Or spending days to prove other people that it&#39;s NOT a network issue ?",
         "id": "5700329201234047702",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "R.-Adrian F.",
         "profile": "https://www.blogger.com/profile/11418671261451939355",
         "pub": "2014-10-16T00:03:56.049+02:00",
         "ref": "2071051345157865237",
         "type": "comment"
      },
      {
         "date": "25 February 2023 10:51",
         "html": "<p>Abstraction is indeed a magic word. Unfortunately, it&#39;s usually associated with the adjective &quot;leaky&quot;. In the case of SQL datavases abstraction: stored procedures, triggers, views, some types of indexes, transactions and data types aren&#39;t fully abstracted.</p>\n\n<p>In many cases, SQL abstraction leads to increased complexity, performance overhead, security risks, debugging issues, lack of control, learning curve, and maintenance issues.</p>\n\n<p>However, I don&#39;t know of a better solution</p>\n",
         "id": "1683",
         "name": "Matevž Kovačič",
         "pub": "2023-02-25T22:51:22",
         "type": "comment"
      },
      {
         "date": "27 February 2023 12:52",
         "html": "<p>You can have ONOS or ODL to hide the details of OpenFlow or anything else. ONOS is now getting some attraction in telco space. ONOS can hide all the pipeline details from the application. You have to write your application only once towards the ONOS Northbound API. Then you could have various integrations to the network: CLI, NETCONG, gNMI, BGP, OpenFlow, PBR, whatever plugin you could get. Since ONOS is open source, you can get some level of long-term control.\nHowever, some people want to push the complexity somewhere else. Then comes P4 and microONOS. Now ONOS itself is simpler, but the complexity moved into the P4 implementation.\nYou can chose which approach to follow based on your specific tradeoffs.\nOr you can stick with classical routing... \nWe prefer a hybrid approach. Using classical routing for the majority of generic traffic and using ONOS based SDN for special safety critical traffic requiring dynamic policy overrides or steering by situtation awareness that cannot be handled by standard routing. </p>\n",
         "id": "1684",
         "name": "Bela Varkonyi",
         "pub": "2023-02-27T12:52:54",
         "type": "comment"
      }
   ],
   "count": 6,
   "id": "2071051345157865237",
   "type": "post",
   "url": "2014/10/networking-is-not-as-special-as-we.html"
}
