{
   "comments": [
      {
         "comments": [
            {
               "date": "11 April 2024 07:51",
               "html": "<p>You run BGP. You can configure your routing policies that half your traffic is on one firewall and the rest on the other. Hence you can get your symmetric traffic with a bit of work in BGP and still don&#39;t need to rely on the SPOC in a HA-Cluster. But yes, you need to establish the sessions new if something fails. </p>\n\n<p>But I get you and I think that this approach is only viable when you need really high availbability. Not your standard enterprise where they whine a bit when something doesn&#39;t work. Stuff that really needs to stay up all the time, depends on this kind of designs. They don&#39;t stack, they don&#39;t cluster some stuff together. They design around that and make it always work. Which costs quite a bit more, but they know why they pay the premium. </p>\n\n<p>For most enterprises its just a cluster and everything is fine. </p>\n",
               "id": "2193",
               "name": " Daniel S",
               "pub": "2024-04-11T07:51:49",
               "ref": "2191",
               "type": "comment"
            }
         ],
         "date": "10 April 2024 11:15",
         "html": "<p>World&#39;s by far not taht simple especially if sessions can be asymmetric ;-) HA in such scenario is extremely hard to build, especially since it&#39;s not a 2 controller through backplane scenario but &quot;arbitrary distrance, arbitrary delay, may be just a piece of wet string&quot; ;-) For two boxes working solutions from reputable vendors are available since long time, more than two leads into weird stuff like Paxos quickly.  There are other, clever ways to deal with HA and asymmetry as well you may want to dig in as well ;-) </p>\n",
         "id": "2191",
         "name": " Tony P",
         "pub": "2024-04-10T11:15:10",
         "type": "comment"
      },
      {
         "date": "11 April 2024 07:56",
         "html": "<p>Dear Ivan,</p>\n\n<p>you are of course allowed to mention in your blog post that a single VLAN is also a single failure domain. See, how very gracious we, your readers, are. :-)</p>\n\n<p>And because you are correct, the best is to avoid shared L2 even for single control plane HA clusters. I know it can be done with Juniper firewalls, where the trick is to have local bridging on each upstream or downstream router, but not between the routers. In that case, node0:if0+node1:if0=reth0 is connected to the bridge at R1 router and node0:if1+node1:if1=reth1 is connected to the bridge at R2 router. So no matter which node is active, reth0 and reth1 points to both R1 and R2 routers. Each node needs to be connected to both routers, true, but if in your picture X1+C1 and X2+C2 are collapsed to R1 and R2, then you can have the equivalent setup without any more ports in use.</p>\n\n<p>Similarly, on the management side, OoB interfaces (fxp0 for Juniper) don&#39;t have to share the same L2. The so called master-only IP address can be made available with BFD, because the standby node does not run the BFD.</p>\n\n<p>So you truly don&#39;t need to tie your routers with any shared L2 just because of the firewall clusters. And then there is also Multinode HA, which I think Dmitry also mentioned in his post, where nodes are running their own control plane protocols.</p>\n\n<p>Cheers,\nMartin</p>\n",
         "id": "2195",
         "name": " Martin Rusko",
         "pub": "2024-04-11T07:56:22",
         "type": "comment"
      },
      {
         "date": "11 April 2024 08:27",
         "html": "<p>Pick your poison. Firewall vendors suck at implementing BGP even more than HA. And if we&#39;re having an honest discussion, network layer firewalls are in general nothing but theater, providing an illusion of &quot;security&quot;.</p>\n",
         "id": "2196",
         "name": " Jeff Behrns",
         "pub": "2024-04-11T08:27:36",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2024/04/firewall-ha-theater.html"
}
