{
   "comments": [
      {
         "comments": [
            {
               "date": "12 April 2024 01:55",
               "html": "<p>I will leave it to others to debate the nuances of LISP vs. EVPN...  I&#39;ve been in management too long at this point.  But I can tell you that our support for EVPN does not, in any way, indicate the retirement of LISP for SD-Access.  We have some customers (readers of Ivan&#39;s blog?) who do not want to do LISP for whatever reason, and so we support EVPN.  If that&#39;s how you want to do it, that&#39;s fine.  If it helps, think of it as an EIGRP vs. OSPF vs. ISIS sort of thing.  Do what&#39;s best for you and we&#39;ll support it.</p>\n",
               "id": "2211",
               "name": " Jeff McLaughlin",
               "pub": "2024-04-12T01:55:23",
               "ref": "2198",
               "type": "comment"
            },
            {
               "date": "15 April 2024 11:48",
               "html": "<p>Nice to hear the Cisco intends to support LISP. However, it is removed from IOS XR already. So it is not that clear...</p>\n\n<p>If Cisco will stop supporting LISP, then we will be forced to create our own LISP routers, since we need it for extreme mobility environments.</p>\n\n<p>It would be still beneficial to have a second LISP router supplier. Unfortunately, the early LISP implementers stopped all development many years ago, so they are useless as alternative suppliers, since PUBSUB is not provided and some other features are also missing. ONOS and ODL implementations are also orphaned and useless.</p>\n\n<p>In safety critical networks, we always need diversity in suppliers, too. However, now we are forced to work on technology diversity, so we have to find a way to make PMIPv6 to work reasonably well. It will be a challenging task...</p>\n\n<p>We will have to present a combined mobility network with parallel LISP and PMIPv6 mobility backbones, where the end user would not see any functional limitations in multi-link mobility.  </p>\n",
               "id": "2219",
               "name": "Bela Varkonyi",
               "pub": "2024-04-15T11:48:00",
               "ref": "2211",
               "type": "comment"
            }
         ],
         "date": "11 April 2024 01:15",
         "html": "<p>&gt;&gt;There might be a reason only a single business unit of a single vendor uses LISP in their fabric solution\n&gt;&gt;(hint: regardless of what the whitepapers say, it has little to do with technology).</p>\n\n<p>... and even that vendor realized that it&#39;s time to move on and are now officially supporting EVPN for their fabric (and is praising themselves for the wonderful interoperability options they get with EVPN, see f.e. BRKENS-2092 &amp; BRKENS-2050 from CL Amsterdam 2024).\nSo if you ask me: LISP was &amp; is terminal, now on life-support, will be dead soon...</p>\n\n<p>Will be interesting to see how the migration path for existing deployments will look like, if there will be one...</p>\n",
         "id": "2198",
         "name": " Christoph",
         "pub": "2024-04-11T13:15:52",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "11 April 2024 03:47",
               "html": "<p>Thanks a million. I&#39;m assuming the &quot;roaming distribution&quot; (Y axis) is the number of roaming events... if only we&#39;d know what the time unit is ;)</p>\n",
               "id": "2204",
               "name": "Ivan Pepelnjak",
               "pub": "2024-04-11T15:47:19",
               "ref": "2202",
               "type": "comment"
            },
            {
               "date": "11 April 2024 06:21",
               "html": "<p>it&#39;s time in ms taken by host to roam. not delay actually.</p>\n",
               "id": "2207",
               "name": "Andy",
               "pub": "2024-04-11T18:21:18",
               "ref": "2204",
               "type": "comment"
            },
            {
               "date": "11 April 2024 06:36",
               "html": "<p>pardon. my bad. Y looks like relation of the times of registered roamings counting to all number of active mobile endpoints. will ask CTAC :0) </p>\n",
               "id": "2208",
               "name": "Andy",
               "pub": "2024-04-11T18:36:06",
               "ref": "2207",
               "type": "comment"
            }
         ],
         "date": "11 April 2024 01:24",
         "html": "<p>Hi Ivan\nthanks for nice article on the topic. At https://ibb.co/6JDr03D there is graph of all lisp fabric roaming delays attached. Number of roaming users is not easily calculable (DNAC has no such feature yet :0). Population of wireless endpoints is ~2.1K  </p>\n",
         "id": "2202",
         "name": "Andy",
         "pub": "2024-04-11T13:24:39",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "11 April 2024 03:55",
               "html": "<p>I know you work in environments that are very far away (requirements-wise) from &quot;typical&quot; networks, so it&#39;s always great to have your perspective. Thanks a million!</p>\n\n<p>As for the &quot;complex BGP path selection algorithm,&quot; that&#39;s definitely true, but in a typical (sane) EVPN scenario, all path attributes should match, and thus, the actual code path should be relatively simple.</p>\n\n<p>I am positive nobody ever optimized BGP for the speed of simple path selection, but then we also didn&#39;t have JavaScript JIT compilers until people started running JS on the servers. This discussion somewhat reminds me of the famous IS-IS versus OSPF wars, where it turned out that one of the main reasons for sub-par OSPF performance on Cisco IOS (so the rumors go) was that the team writing the IS-IS code was better (because they had to deal with larger customers).</p>\n\n<p>Anyway, it turns out that we usually &quot;solve&quot; problems with brute-force application of more resources, and as long as the ASIC FIB programming remains the bottleneck, it doesn&#39;t matter (in the data center/campus switching space) too much how much faster LISP is... or am I missing something?</p>\n",
               "id": "2205",
               "name": "Ivan Pepelnjak",
               "pub": "2024-04-11T15:55:48",
               "ref": "2203",
               "type": "comment"
            },
            {
               "date": "11 April 2024 07:18",
               "html": "<p>without SDA-transit (PUB/SUB) in the WAN mobility w/ LISP ends on the arbitrary Fabric Site.</p>\n",
               "id": "2209",
               "name": "Andy",
               "pub": "2024-04-11T19:18:19",
               "ref": "2203",
               "type": "comment"
            }
         ],
         "date": "11 April 2024 03:13",
         "html": "<p>There is one critical point. You assume anchored mobility for option one. This is unacceptable for safety critical networks. You should have mobility without an anchor point. Exactly that is what LISP provides for you. A fully distributed data plane without any single point of failure. The control plane is centralized logically, but could be fully distributed, even geo-redundant physically. \nYou might say that single point of failures are not an issue in most networks. But in other networks this might be not acceptable. </p>\n\n<p>For option two, with BGP you cannot reach the same speed of mobility and scale, because of the complex BGP path selection algorithm. On the same CPU LISP will be always much faster. Cisco once did an in-house race on this issue. LISP was the clear winner against the best BGP experts available inside Cisco. \nBTW, Boeing Connexion failed miserably many years ago with BGP based mobility. </p>\n\n<p>If mobility is not an issue, you might be happy with option one, then EVPN might be good enough. If you need distributed anchorless mobility, than LISP will be always better by architecture. </p>\n\n<p>LISP is especially a good fit for parallel active multilink mobility using Priority and Weight. PMIPv6 cannot do the same. BGP also does not have anything standardized for such scenarios. \nFew networks would need that today, but probably in the future all moving vehicles will have higher safety and security requirements. Then LISP is an easy natural solution. While all other protocols has to be redefined and implemented new. Even 3GPP does not have a comparable mobility solution yet.</p>\n",
         "id": "2203",
         "name": "Bela Varkonyi",
         "pub": "2024-04-11T15:13:05",
         "type": "comment"
      },
      {
         "date": "15 April 2024 11:38",
         "html": "As you always mention: &quot;It depends on...&quot;<br />\n\n<p>FIB update speed is very much different on the specific router architecture. How does it compare to running BGP path selection for a large number of mobility events? Difficult to say in general. \nDepends on a lot of internal parameters how to share computing resources.</p>\n\n<p>In some newer routers BGP would not be such a big bottleneck, but you need a lot of knob turning in BGP to get it right, while in LISP it is quite simple. </p>\n\n<p>If you have many thousands concurrent airplanes with multi-link and max. 16 subnets with different routing policies on each, and the radio links are going up and down, then you have a large number of mobility events.</p>\n\n<p>This is where LISP with PUBSUB is excellent. BGP is not designed for mobility and in such an extreme environment would be a serious bottleneck, potentially making impossible to fulfill the safety performance requirements. </p>\n\n<p>Victor Moreno published once an exercise with moving robots in factory environment where similar mobility performance was required. LISP was the right fit for that.</p>\n\n<p>It is a totally different use case of LISP than most people would think about. Valid only with PUBSUB. Still some points are missing to make this solution complete. Reliable transport shall be standardized. We need subnetwork mobility support in MS/MR. Some LCAF extension and implementation would be handy.</p>\n\n<p>However, I see no good alternative. PMIPv6 is a candidate, but it has no support for full multilink with policies yet. For me LISP is the best mobility protocol, a replacement for PMIPv6, not a replacement for BGP. Actually, in the RLOC space underlay you would typically have a telco network with a lot of BGP.</p>\n\n<p>LISP is also useful for replacing private WAN overlay MPLS networks. It is much simpler to learn and maintain. It could be easily secured by GETVPN with group keys.</p>\n",
         "id": "2218",
         "name": "Bela Varkonyi",
         "pub": "2024-04-15T11:38:26",
         "type": "comment"
      },
      {
         "date": "16 April 2024 06:29",
         "html": "<p>Great Post! I did indeed use &quot;Latency&quot; as twitter shorthand/laziness instead of your more elegant description above.</p>\n\n<p>At the time of the tweet I was arguing for VxLAN EVPN with some of my peers but I had no direct hands on knowledge of how it would actually perform and very limited ability to lab it on hardware. My client was considering deploying Campus VxLAN and they have one of the largest campuses in North America.</p>\n\n<p>Since the tweet I have learned an additional data point. Arista helped them test roaming on Campus EVPN. Here is the description from my contact at Arista.</p>\n\n<p>Roaming and MAC moves across an EVPN/VxLAN environment was a concern to XXXX and we had our PM &amp; SysTest teams help address their concerns back in Oct 2022. </p>\n\n<p>They simulated 60k clients across 2500 APs and MAC moves at various frequencies; XXXX&#39;s client scale is closer to 30k for the Home Office. </p>\n\n<p>Here are the highlights of our PM team&#39;s recommendations.</p>\n\n<p>WiFi Data Path\n&bull;  The recommendation is Vxlan tunnel mode back to a pair of dedicated aggregation switches so the MAC moves are not updating across the fabric.\nWiFi VLAN\n&bull;  Single or Multiple VLAN does not matter, as all the client traffic is tunneled to the aggregation switch pair.\nWired Design\n&bull;  Choice of L2 or L3 at access leaf does not matter for WiFi clients as the MAC visibility is on the aggregation switch pair.\nRoaming\n&bull;  Seamless roaming across the entire campus with no impact to any apps.</p>\n\n<p>DHCP Broadcast/ mDNS\n&bull;  DHCP broadcast will be flooded on the wired side from the aggregation switch pair. Need DHCP broadcast to unicast conversion.</p>\n",
         "id": "2220",
         "name": "Route Abel",
         "pub": "2024-04-16T06:29:15",
         "type": "comment"
      }
   ],
   "count": 5,
   "type": "post",
   "url": "2024/04/mobility-campus-networks-lisp-evpn.html"
}
