{
  "comments": [
    {
      "date": "19 December 2017 10:10",
      "html": "&quot;Alas, I don’t see that happening in my lifetime.&quot; - where does this negativity come from? How about ...<br /><br />&quot;Route Bazaar: Automatic Interdomain Contract Negotiation&quot;<br />http://www.h2020-endeavour.eu/sites/www.h2020-endeavour.eu/files/u57/Route_Bazaar_HotOS_2015.pdf",
      "id": "7836694579342567781",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Andrius Adamavicius",
      "profile": null,
      "pub": "2017-12-19T10:10:20.169+01:00",
      "ref": "7032300906115153835",
      "type": "comment"
    },
    {
      "date": "19 December 2017 15:04",
      "html": "BGP at the edge, BGP at the core [ not at the BGP free MPLS core ] , BGP at the Data Centers, <br />BGP at the edge of ISP [ transit , settlement free , peer , lateral or as a customer ] , <br /><br />Policies at the edge requires control on sourcing routes . Can i reach the source via this  ASN , filter all the routes except the routes that are peer originated and their customers if there are. <br />Policies restrict BOGON AS , Bogon/Martian prefixes , Deprecated prefixes , <br /><br />Implenting BGP policies requires MOP( Method of Procedure )  to be validated atleast by three peers [ two internal ] and one [ peering neighbor ] incase of Peering policies for inbound and outbound. <br /><br />We have standard filter at the edge of any ISP filtering as to restrict and even RTBH [ Remotely triggered black hole ] communities in the standard ISP core filtering. <br /><br />BGP Graceful shut equivalent of ISIS Overload and OSPF max metric router LSA are all implemented in almost all the vendors to make sure BGP reroutes traffic [ match community and setting LP as 0 ) before withdrawing it to avoid the BGP Blackhole for the time it calculates the next best path and to drain traffic gracefully.<br /><br />BGP Policies are nowadays mostly communities that we use for each specific event , there is a community and we are also having support for 32 bit ie 4 byte bgp community equivalent to 32 bit ASN number. <br /><br />BGP Policies has to be peer reviewed and has to be implemented via a script using scripts to configure a device rather than human addition to prevent and script has to just copy paste the config on the device rather than and then various checkpoints has to be implemented such as ADj Rib In and ADj RIB Out has to be validated after each addition, modification and removal. <br /><br />BGP ORF can be used to update policies which is part of Route Refresh message,<br />",
      "id": "4324136356374487835",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": " HEMANTH RAJ",
      "profile": "https://www.blogger.com/profile/08900264515934620482",
      "pub": "2017-12-19T15:04:57.278+01:00",
      "ref": "7032300906115153835",
      "type": "comment"
    }
  ],
  "count": 2,
  "id": "7032300906115153835",
  "type": "post",
  "url": "2017/12/bgp-tragedy-of-commons.html"
}