{
   "comments": [
      {
         "comments": [
            {
               "date": "17 October 2024 06:27",
               "html": "<p>Scalability in large segments. IP nodes communicate only when they must, and the adjacency rules are predefined. CLNP nodes have to maintain soft state through periodic refreshes.</p>\n\n<p>It&#39;s like SR-MPLS with a PCEP controller versus MPLS-TE with RSVP.</p>\n",
               "id": "2442",
               "name": " Ivan Pepelnjak",
               "pub": "2024-10-17T18:27:23",
               "ref": "2441",
               "type": "comment"
            }
         ],
         "date": "17 October 2024 06:21",
         "html": "<p>Why would IP be the &quot;winner&quot; for finding adjacent nodes?</p>\n\n<p>To send traffic, both IP and CLNP build a &quot;kind of&quot; ARP table (let&#39;s say &quot;neighbor&quot; table).\nIP needs to check network mask before looking at this &quot;neighbor&quot; table.\nCLNP can use it directly =&gt; looks better to me.</p>\n\n<p>But what if there are a LOT of nodes in a segment?\nIP doesn&#39;t need to keep track of nodes it doesn&#39;t communicate with =&gt; can a good point\nMust CLNP keep track of every nodes? Can it send ES-ES requests like ARP?</p>\n",
         "id": "2441",
         "name": "Anonymous",
         "pub": "2024-10-17T18:21:45",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "20 October 2024 08:10",
               "html": "<p>Cisco IOSv probably still has it. There&#39;s also this project (but it seems to be abandonware):</p>\n\n<p>https://github.com/crazoes/clnp</p>\n",
               "id": "2444",
               "name": " Ivan Pepelnjak",
               "pub": "2024-10-20T20:10:37",
               "ref": "2443",
               "type": "comment"
            }
         ],
         "date": "20 October 2024 08:07",
         "html": "<p>Are there any OSes that have a CLNS stack for hobbyists to play with? I can&#39;t seem to find one for Linux. I personally find poking old network stacks fascinating.</p>\n",
         "id": "2443",
         "name": " Scoopta",
         "pub": "2024-10-20T20:07:23",
         "type": "comment"
      },
      {
         "date": "28 October 2024 09:57",
         "html": "<p>This article does a fantastic job of breaking down the complexities of TCP/IP and CLNP in addressing and adjacent node identification. It&rsquo;s insightful to see how each protocol approaches the issue differently, with TCP/IP using subnet masks and ARP, while CLNP relies on Hello messages to build neighbor awareness. The discussion around ARP and RARP for virtual machine mobility in data centers is especially relevant for those working with virtualization, offering practical insights on the limitations of IP in modern networking setups. Overall, it&rsquo;s a great resource for anyone interested in deepening their understanding of network protocols and addressing challenges</p>\n",
         "id": "2450",
         "name": " Logitrain",
         "pub": "2024-10-28T09:57:57",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2024/10/comparing-ip-clnp-addressing.html"
}
