{
   "comments": [
      {
         "comments": [
            {
               "date": "07 March 2018 17:32",
               "html": "... and we&#39;re perfectly in sync. That&#39;s what I would buy from most SPs unless I would be absolutely sure they know how to deal with Enterprise routing.<br /><br />Also, many SPs rightfully don&#39;t want to deal with the mess that&#39;s called Enterprise routing ;))",
               "id": "4542215643523206733",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "Ivan Pepelnjak",
               "profile": "https://www.blogger.com/profile/13457151406311272386",
               "pub": "2018-03-07T17:32:02.049+01:00",
               "ref": "5620310982270829791",
               "type": "comment"
            }
         ],
         "date": "07 March 2018 17:21",
         "html": "everything over ip is the right stuff?as service provider we sell internet access or L2 VPLS that’s it ",
         "id": "5620310982270829791",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2018-03-07T17:21:57.467+01:00",
         "ref": "3391281455106218327",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "15 March 2018 18:53",
               "html": "There are L2-VPNs with 600+ sites operating 24/7/365 since years....<br />I would not exactly call that small scale.",
               "id": "4351786308118047696",
               "image": "https://resources.blogblog.com/img/blank.gif",
               "name": "Christoph Jagd",
               "profile": "http://www.uebermeister.com",
               "pub": "2018-03-15T18:53:59.034+01:00",
               "ref": "2488022405952742962",
               "type": "comment"
            }
         ],
         "date": "08 March 2018 00:42",
         "html": "&quot;As much as it hurts me, I’d prefer buying layer-2 services or IP transport services from a service provider because I know they can’t mess them up too much, and I’d still own the end-to-end routing.&quot; - Very surprised to see this comment. I assume this would be on a small scale only. Once you get to 5 or 10 or more sites, routed MPLS VPN is really the only solution that will scale... (May be I am missing the context).",
         "id": "2488022405952742962",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Salman Naqvi",
         "profile": "https://www.blogger.com/profile/11529916018516958539",
         "pub": "2018-03-08T00:42:53.293+01:00",
         "ref": "3391281455106218327",
         "type": "comment"
      },
      {
         "date": "08 March 2018 08:09",
         "html": "Never heard of BGP route reflection and hub and spoke design? It&#39;s highly scalable and a perfect case for automation. Look at Ivan&#39;s ansible for network engineers webinar. ",
         "id": "3025434268338034041",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2018-03-08T08:09:54.074+01:00",
         "ref": "3391281455106218327",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "16 March 2018 16:54",
               "html": "Isn&#39;t that what CO transformation is all about?<br />Use L2 tunneling to transport the packets to the closest (virtual) L3 endpoint?<br /><br />IMHO it really depends on where you&#39;re deploying the fabric.<br />In a regular DCs maybe you don&#39;t need EVPNs, but in SP PoPs? Well you do.",
               "id": "7161314578967108804",
               "image": "https://resources.blogblog.com/img/blank.gif",
               "name": "Marco Marzetti",
               "profile": null,
               "pub": "2018-03-16T16:54:04.805+01:00",
               "ref": "121282726675024384",
               "type": "comment"
            }
         ],
         "date": "08 March 2018 09:50",
         "html": "So Ivan, you are telling me to go back to the old days of overlay networks over ATM/Frame relay, now revisited over IP/MPLS ? Seriuos ISPs have today thousands and thousands of customers well satisfied with L3VPN services, and as far as is my understanding, L2 services are a small percentage of overall BGP/MPLS services. But to be sincere my point in the past comment was about Data center scenarios. My point was that you can drastically simplify the fabric deploying multitenancy through simple L3VPN, without using LDP, but using simple MPLS over GR/IP/UDP+IP. And therefore you do not need neither EVPN nor VXLAN (I understand that this is blasphemous ... !!!)",
         "id": "121282726675024384",
         "image": "https://1.bp.blogspot.com/-CrF2hgzSoTQ/WoyqrG4y49I/AAAAAAAAH8M/KLGgfrBE1R0H8T0kc5SxwuThLaoxr6mlACK4BGAYYCw/s32/Pizzo%2BCamarda.JPG",
         "name": "Ammiraglio Tofonoto",
         "profile": "https://www.blogger.com/profile/04524005885569437211",
         "pub": "2018-03-08T09:50:38.963+01:00",
         "ref": "3391281455106218327",
         "type": "comment"
      },
      {
         "date": "08 March 2018 10:28",
         "html": "We (two municipalities in Sweden) buy exclusively internet access and layer 2 VPN services from our service provider. We have looked into buying layer 3 VPN services several times, but always decide against because we&#39;d have to integrate with the service provider&#39;s routing (which would limit our flexibility, sometimes limit our choice of IP ranges, sometimes just not work with IPv6, and most importantly based on experience I don&#39;t trust our service provider to handle routing properly...)",
         "id": "427827433104025846",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Unknown",
         "profile": "https://www.blogger.com/profile/11890997522662363216",
         "pub": "2018-03-08T10:28:20.184+01:00",
         "ref": "3391281455106218327",
         "type": "comment"
      },
      {
         "date": "09 March 2018 15:42",
         "html": "&quot;I cannot understand the usefulness of L2 services...&quot;<br /><br />Are we at risk of applying logic to emotion?<br /><br />In a world where economic stimulus comes in the form of &#39;job creation&#39; instead of proper grass roots agitation, you may find you&#39;re designing for a 95th percentile which no longer exists. Gone is the curious, extroverted, inner geek, who weighed up his career options as a project engineer or a support analyst and decided that support was probably the perfect combination of people+tech.<br /><br />In his/her place, we have state sponsored employee numbers with designations that bear no resemblance to the geek-come-customer-champion of yesteryear. IT jobs FTW?<br /><br />&quot;Fill those seats and get them filled ASAP or you can kiss goodbye to the second, third and fourth stages of that grant we promised!&quot;<br /><br />Applying a cattle prod to your country&#39;s employment statistics is a brilliant short term win. Everyone&#39;s a winner!<br /> <br />Is this really true, though?<br /><br />It&#39;s possible that such endeavours could jumpstart someone&#39;s ascent on the Needs Hierarchy and in turn, propel a nation out of stagnation... but is it enough to merely set the wheels in motion?<br /><br />Yeh, course. Just like when you plug cables into any port of any switch, all of your apps come alive, magically. <br /><br />In such a state (demoralised, depressed, angry, resentful, unproductive - pick one? :P) how likely are people to welcome additional complexity into their lives? Is it, perhaps, more likely they&#39;ll stick to what they know?<br /><br />24 bit masks?<br />The ARP cache?<br /><br />Who knows! :)",
         "id": "6606290583080958634",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Unknown",
         "profile": "https://www.blogger.com/profile/18199502598702200880",
         "pub": "2018-03-09T15:42:43.066+01:00",
         "ref": "3391281455106218327",
         "type": "comment"
      },
      {
         "date": "24 June 2020 04:41",
         "html": "<p>The reason for the migration to L2 service by network service providers is automation.</p>\n\n<p>An L3VPN deployment cannot be easily automated, since you have to agree on IP addressing, IP routing, you have to test the integration, and you have no real separation of administrative domains. The full process might take weeks, with multiple meetings, documents to review, etc. </p>\n\n<p>If you provide an L2 service only, then you do not have to discuss anything. You just provide the service, make an automated test using Ethernet OAM, notify the customer, the customer connects and the frames are forwarded. You can light up such service instances in minutes. \nIf it is just a P2P L2 service, then it is easy to guarantee bandwidth and it is just a check-box to order automated protection switching.</p>\n\n<p>Nowadays you can also automate L2 service provisioning over multiple service providers. On the long term this will make L2 services much cheaper than L3 services.</p>\n\n<p>In about a decade, L3 services might become a small niche market...</p>\n",
         "id": "77",
         "name": "Bela Varkonyi",
         "pub": "2020-06-24T16:41:46",
         "type": "comment"
      }
   ],
   "count": 10,
   "id": "3391281455106218327",
   "type": "post",
   "url": "2018/03/whos-pushing-layer-2-vpn-services.html"
}
