{
   "comments": [
      {
         "date": "23 November 2022 08:04",
         "html": "<p>Automation is mainly about money - I am talking about rather big networks, not small one-man automated networks.</p>\n\n<p>If you want to introduce automation in your network you need to create a Business Case and talk to your managers. At the beginning it&#39;s expensive so without managers support you can forget about full blown automation.</p>\n\n<p>You need to have developers (programming part) mixed with network engineers (network knowledge). This process never stops as long as the network or network based product is supported and developed. You will never reduce your stuff as long as you keep your network running &amp; updating - new features you add will make your team busy.</p>\n\n<p>You won&#39;t succeed if your manager do not understand the benefits because, again, it&#39;s about money (both investing &amp; savings). And in case of big networks it is also about surviving because human error costs money as well.</p>\n\n<p>BTW. I am doing automation for more than 15 years in the mixed team (developers &amp; network engs) for network based systems of size up to 10 000 or more nodes. We started with the automation from day one, years before the Automation was discovered by the Gartner. This decision was driven by the fact that our networks were to big to handle configuration process it manually.\nThe tools has changed over the years but they do not matter here as Ivan mentioned.\nAutomation is about your mindset...</p>\n",
         "id": "1538",
         "name": "BOGDAN GOLAB",
         "pub": "2022-11-23T08:04:04",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "16 May 2023 07:10",
               "html": "<p>I took my sweet time to write a proper response (and sometimes that takes months), but then figured out I sort-of answered in 2018 &#x1F609; (the &quot;tons of things you can do&quot; section)</p>\n\n<p>https://blog.ipspace.net/2018/11/dont-let-automation-snowflakes-stop-you.html</p>\n",
               "id": "1823",
               "name": "Ivan Pepelnjak",
               "pub": "2023-05-16T19:10:25",
               "ref": "1594",
               "type": "comment"
            }
         ],
         "date": "12 January 2023 02:37",
         "html": "<p>At the crossroads for automation, again. Different companies, same question(s). How and how to make the barrier of entry low, considering &#39;we have done it like this for years&#39; questions. Multi-vendor - you name it, we have it; old software; REST API enabled (with a call for every bloody thing available, nothing task based). The main question is - I want it to look perfect and everyone will write playbooks. No, they will not. And they have to benefit from move right away in cases of old workforce/CLI jockeys (nothing bad about this, I like CLI, that is why I know when not to use it).\nHow do I make sure that intended configuration does not interfere with &#39;no change in state&#39; work - replacing a failed linecard, traffic shifting a device with arbitrary routing protocol running on it?\nAll that with minimal investment in developers or netdevops...</p>\n",
         "id": "1594",
         "name": " Vladan M",
         "pub": "2023-01-12T14:37:36",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2022/11/automation-service-provider.html"
}
