{
   "comments": [
      {
         "date": "17 November 2022 04:14",
         "html": "<p>Thank you!</p>\n",
         "id": "1517",
         "name": "BOGDAN GOLAB",
         "pub": "2022-11-17T16:14:36",
         "type": "comment"
      },
      {
         "date": "17 November 2022 02:01",
         "html": "<p>I am interested to see if HIP fixes all of this in the future. It looks like it has the potential to be a well-designed solution. It doesn&#39;t meet your &quot;widely-deployed&quot; criteria yet but it looks promising and it doesn&#39;t feel hackish.</p>\n",
         "id": "1516",
         "name": " Octavio",
         "pub": "2022-11-17T14:01:28",
         "type": "comment"
      },
      {
         "date": "18 November 2022 08:58",
         "html": "<p>&quot;(according to RINA) build an overlay network with global host addresses on top of that?&quot;</p>\n\n<p>I&#39;m not an expert on RINA, but nowhere have I read that&#39;s what RINA proposes: definitely not host address in the routing table. Can you show me where it&#39;s written? </p>\n\n<p>&quot;Under that scenario, host would be known only by its node address (H). Everyone between the bifurcation point (IXP) and the host needs to know that there are two paths toward the host, and what their state is. That includes ISP-A, ISP-B, and all upstream ISPs including upstream ISPs directly connected to IXP2.&quot;</p>\n\n<p>Why? What&#39;s the point of summarization then? The point of addressing that&#39;s pushed forward by John Day, father of RINA, which I agree with, is an address should be route-independent. Summarization done with hierarchical addressing can even bound the number of routes in the Internet RIB. With current interface addressing BS, the global RIB is about a million routes and counting. Why does it keep rising? Because it has no boundary condition imposed. Why are network engineers called engineers when they have no understanding of boundary conditions, a fundamental aspect in engineering? </p>\n\n<p>Akamai uses 2-level DNS to implement their infrastructure; it&#39;s the same concept as hierarchical addressing, and it works for them. Now coming back to the example, ISP A and B just needs the summary routes of whatever blocks C and D possess, and on and on it goes. How should this fail to work?</p>\n\n<p>Also, in our discussion of the same topic way earlier, you pointed out that money is an incentive, no ISP can make money if hierarchical addressing is used. Fair enough. But the next question is, since money ruins a lot of things in life (IT is no exception), is money the right question to ask? When something is considered national security or national asset too valuable to fall into private hands with dubious interests, like the main grid or the oil-gas pipelines, govts will be responsible for building and managing it. Why is communication infrastructure any different? Isn&#39;t it part of national critical infrastructure these days? Why give it to private hands when they can potentially sell out to your enemies? </p>\n\n<p>Back to the global RIB, we have tight-coupling and complexity-collapse problem. Just because it hasn&#39;t happened yet (or it might have) doesn&#39;t mean it won&#39;t. The same way the financial idiots keep claiming that derivatives are all well and good, until they blew up in their faces and were so close to bringing down the whole financial system in 97-98 and 2008; even now the global financial system is fucked up in more ways than one; just a looming failure of Credit Suisse risks bringing down the whole shebang. Global tight-coupling complexity surely is a good thing. </p>\n\n<p>IPv6 helps make things worse, and way worse for those who know hardware. So while &#39;worst decision ever&#39; is debatable, it&#39;s pretty up there among the very bad ones. CLNP recognizes the need for hierarchy in addressing, that&#39;s what we can learn from. Should we go back to it? Hell no. IPv4 is simple, and everything simple is good. Start with this simplicity, and improve it. Funny the MPLS guys got it right by accident; they unconsciously implemented hierarchical addressing with MPLS VPN; it worked.  </p>\n\n<p>Another point that you mention somewhere is: depending on the scenarios, at worst you might end up with millions of routes in the local network, in exchange for a clean, short global RIB. I don&#39;t think that&#39;s the case if you implement the hierarchical addressing the right way, but let&#39;s just assume this is the case, is it that terrible? The blast radius is contained within the network. OTOH, a global RIB with millions of routes has the potential to result in massive errors that can bring down the whole or a large part of the Internet. Containment vs contagion: a clear win to me. </p>\n\n<p>Looks like John Day is demonized as an anti-IP guy. He&#39;s not. Just because he invented RINA, doesn&#39;t mean he&#39;s gone nuts about it; that&#39;s what I like about him: common sense and simplicity. His views on addressing and multihoming are here for anyone with an open mind:</p>\n\n<p>https://pouzinsociety.org/sites/default/files/LocIDSplit090309.pdf</p>\n\n<p>https://psoc.i2cat.net/sites/default/files/PSOC-tutorials-naming-addressing.pdf?_ga=2.82479954.572590943.1668752621-682182543.1668752621</p>\n\n<p>https://psoc.i2cat.net/sites/default/files/PSOC-tutorial-Mobility-made-simple.pdf?_ga=2.219319261.572590943.1668752621-682182543.1668752621</p>\n\n<p>As for complaint on why his book wasn&#39;t written from an engineering perspective, well, he already stated that in the book and made clear in the title of the book for those with subtlety. He tried to propose an alternative model of networking based on his decades of experience (no, he&#39;s not just an armchair expert in academia), and that hierarchical model works well when applied to IP. </p>\n\n<p>MP-TCP and SCMP are just lipstick on a pig. A typical result of adding more complexity to solve complexity, and still failing to solve it, when the fundamentals are wrong. </p>\n",
         "id": "1518",
         "name": " Minh",
         "pub": "2022-11-18T08:58:59",
         "type": "comment"
      },
      {
         "date": "18 November 2022 10:23",
         "html": "<p>Real life commercially implemented LISP is different. It is using reliable transport and PubSub. Then it has no cache problem. The convergence is usually much faster than with other routing protocols.\nThe size of the EID table is a matter of capacity planning and memory profiles. Here there is something to do. Aggregation could help.\nA hybridization of the push vs. pull model would be available by selective PubSub subscription. This is not implemented commercially yet, but we are pushing for this. :-)\nWe have just finished a large validation exercise successfully in a consortia of 10 big companies for using a specially profiled version of LISP called Ground Based LISP (GB-LISP) for multilink mobility in aviation networks. It uses a special protocol on the air-ground link. GB-LISP is limited to integrate radio access networks and ground users in the ground networks. This will be further improved to fulfill all the strict requirements for a safety critical application. Now it is under codification as one of the recommended implementations for upcoming ICAO and EUROCA/RTCA standards.\nThe major IETF LISP RFCs have been recently updated from Experimental to Standards Track. This is driven by finding new use cases that are better than the original ideas. Another two rounds of IETF LISP standardizations are foreseen...</p>\n",
         "id": "1519",
         "name": "Bela Varkonyi",
         "pub": "2022-11-18T10:23:58",
         "type": "comment"
      }
   ],
   "count": 4,
   "type": "post",
   "url": "2022/11/multihoming-within-network.html"
}
