{
  "comments": [
    {
      "comments": [
        {
          "date": "21 August 2019 17:06",
          "html": "I know people running (and troubleshooting) NSX deployments, so I don&#39;t think it&#39;s THAT hard... at least on the NSX-V side, no idea how convoluted NSX-T is. It is true, however, that those people have decades of networking experience ;)) More about other excellent points you raised in a separate blog post.",
          "id": "1937717088326762757",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2019-08-21T17:06:19.803+02:00",
          "ref": "8885362214906221575",
          "type": "comment"
        },
        {
          "date": "04 November 2019 11:29",
          "html": "Why dont you run routing protocols over a NSX Controller and the edge device. It is easy to deploy and design. U figure out the sizing of the network and take a cal based on that. ",
          "id": "2672303620546145692",
          "image": "https://resources.blogblog.com/img/blank.gif",
          "name": "Anonymous",
          "profile": null,
          "pub": "2019-11-04T11:29:25.826+01:00",
          "ref": "8885362214906221575",
          "type": "comment"
        }
      ],
      "date": "21 August 2019 13:38",
      "html": "A close friend of mine (VCIX) suggested that things are not necessarily too bad as long as everything is functional, but once something break there is no other way to fix it but to get VMware TAC on call. The troubleshooting commands they run to find the issue is even beyond VCIX skills. For example how would you troubleshoot a BGP peering issue in NSX. Getting the compute sizing right is another challenge with NSX I hear commonly from few friends those deal with NSX in real life.<br /><br /> <br /><br />Now for Data Plane using Geneve is an interesting choice to be made and while the approach has it&#39;s own Pros and Cons, I would like to stick to VxLAN if I were to recommend to someone for few good reasons. <br /><br /> <br /><br />Not sure about how many Server NICs can handle Geneve in HW and state of SR-IOV and DPDK in reference to Geneve. Also need to get my head around how Multicast will be handled in control and data plane.<br /><br /> <br /><br />You need Underlay Networks anyways, so from Business perspective until someone has very specific use cases (And not just want SDN ready DC) that NSX delivers in particular, It would be hard to convenience Business to throw extra money. And of course I personally would like to see operational model to get rid of finger pointing that will go on between Underlay provider (Cisco, Arista, Juniper) and Overlay provider (NSX) once something breaks. <br /><br /> <br /><br />How would you correlate underlay vs. overlay stats for visibility, performance mgmt. &amp; troubleshooting ?<br /><br /> <br /><br />Ever tried to benchmark a DCN solution from Operator perspective from CX lens ? The planning team only has to take one time pain, OPS has to operate it for next 5 years or so. <br /><br /> <br /><br />But then Vendors and Industry seems to be solving the wrong problem IMHO. But that&#39;s just my opinion :) ... so who cares.<br /><br />HTH...<br />Evil CCIE",
      "id": "8885362214906221575",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "A Network Artist",
      "profile": "https://www.blogger.com/profile/06314916176190119200",
      "pub": "2019-08-21T13:38:00.163+02:00",
      "ref": "3687868792265920319",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "21 August 2019 18:43",
          "html": "I have been pointed to VMware HCL ;) where it&#39;s clear that Checkpoint is certified for E-W service insertion. However, looking at Checkpoint blog posts, it seems the firewall(s) run in a service cluster not on the hypervisor, so I obviously need to spend some more trying to figure the details out... Thank you!",
          "id": "7353005763519496092",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2019-08-21T18:43:55.358+02:00",
          "ref": "6285853016417159080",
          "type": "comment"
        }
      ],
      "date": "21 August 2019 15:54",
      "html": "You have been able to use service insertion since NSX-T 2.3.  In my opinion, it is the vendors that have been slow to deploy images that can utilize it and not the fact that the product does not support it.  ",
      "id": "6285853016417159080",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Andrew Hrycaj",
      "profile": "https://www.blogger.com/profile/16055305086817424550",
      "pub": "2019-08-21T15:54:31.680+02:00",
      "ref": "3687868792265920319",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "21 August 2019 17:04",
          "html": "As I wrote a long time ago, I would never run OSPF between a VM with unknown software on it and my ToR switch. OSPF is a single failure domain, and a single bug in the VM software could impact your whole data center. At least I can filter the stuff NSX is sending me with BGP (and looks like I&#39;m not the only one thinking along these lines based on what they implemented in NSX-T).<br /><br />Hardware VTEP integration sounds great... until you figure out that most data centers don&#39;t have more than a few gigabits of E-W traffic between virtual and physical world (unless they have a huge baremetal SAP HANA database or something similar), so a VM implementation is more than good enough. I&#39;m not THAT upset about this one.<br /><br />Advanced microsegmentation? I compared NSX-V and NSX-T microsegmentation and they seemed very similar. What am I missing?",
          "id": "2282066816158761722",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2019-08-21T17:04:35.054+02:00",
          "ref": "5709252687913889317",
          "type": "comment"
        },
        {
          "date": "21 August 2019 21:04",
          "html": "Totally agree with you that with BGP you can treat NSX-T as a different entity and control what you receive (and relay) from it. But that would introduce some complexity for the network team if they had to run OSPF internally in the DC then BGP just for the NSX-T Fabric and then implement redistribution.<br /><br />That would be even more complicated for multi site wouldn&#39;t be ?<br /><br />Thanks for this interesting discussion.<br /><br />Nic",
          "id": "6539183749082136210",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "vPackets",
          "profile": "https://www.blogger.com/profile/07345674420526592526",
          "pub": "2019-08-21T21:04:44.662+02:00",
          "ref": "5709252687913889317",
          "type": "comment"
        },
        {
          "date": "22 August 2019 17:56",
          "html": "Well, you&#39;d actually get to the proper network design where OSPF takes care of transport fabric reachability (and fast convergence) and BGP takes care of endpoint reachability, security of routing information exchange, and routing policies.<br /><br />Also, if you faithfully drink the Kool-Aid every morning, you already deployed EVPN instead of Fabric Path, VCS Fabric or whatever other now-obsolete technology, and so you already have BGP in your data center ;)<br /><br />And finally, PLEASE, PLEASE, PLEASE, don&#39;t redistribute BGP into OSPF ;))",
          "id": "7263017291529899095",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2019-08-22T17:56:32.899+02:00",
          "ref": "5709252687913889317",
          "type": "comment"
        }
      ],
      "date": "21 August 2019 16:42",
      "html": "Here is what is also missing from my experience :<br />- OSPF (no really .... NSX-T doesn&#39;t support OSPF ... How many customers run OSPF in their DC ? :) )<br />- Hardware VTEP integration (I&#39;d recommend this only for migration purpose... Life isn&#39;t all about rainbows and unicorns)<br />- Advanced Microsegmentation ? (Maybe I am wrong and would have to check on latest versions)",
      "id": "5709252687913889317",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "vPackets",
      "profile": "https://www.blogger.com/profile/07345674420526592526",
      "pub": "2019-08-21T16:42:03.296+02:00",
      "ref": "3687868792265920319",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "22 August 2019 07:29",
          "html": "Fixed the HAProxy reference. Thank you!<br /><br />As for service insertion, as I wrote above, it&#39;s one of the most underdocumented features I&#39;ve seen in a long while :((",
          "id": "1681457927455070153",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2019-08-22T07:29:40.425+02:00",
          "ref": "3660574807310752147",
          "type": "comment"
        }
      ],
      "date": "22 August 2019 00:15",
      "html": "A few minor nits:<br /><br />- should probably have mentioned vCDNI for completeness ;)<br />- not sure about mention of nginx, since NSX uses (used?) HAProxy<br />- NSX-T uses at least two different vSwitches, depending on hypervisor<br /><br />Re: service insertion, from what I saw in Release Notes they&#39;ve gone the way of NSH with remote appliances, so you don&#39;t have to have a copy on each hypervisor.<br /><br />Regarding use cases for hardware VTEPs, I wrote a couple posts a few years back: https://telecomoccasionally.wordpress.com/2016/05/04/serving-bandwidth-hungry-vms-with-dc-fabrics-and-nsx-for-vsphere/ and https://telecomoccasionally.wordpress.com/2016/04/14/do-i-need-a-hardware-vtep-for-my-nsx-for-vsphere/",
      "id": "3660574807310752147",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Dmitri Kalintsev",
      "profile": "https://www.blogger.com/profile/16576726865924052243",
      "pub": "2019-08-22T00:15:50.784+02:00",
      "ref": "3687868792265920319",
      "type": "comment"
    }
  ],
  "count": 11,
  "id": "3687868792265920319",
  "type": "post",
  "url": "2019/08/brief-history-of-vmware-nsx.html"
}