{
   "comments": [
      {
         "comments": [
            {
               "date": "09 February 2024 06:00",
               "html": "<p>I&#39;m not familiar enough with FRR to say for sure but I suspect it may fail the entire config if you are both adding something in one spot and removing in another.</p>\n",
               "id": "2090",
               "name": " Charles M",
               "pub": "2024-02-09T18:00:16",
               "ref": "2087",
               "type": "comment"
            },
            {
               "date": "09 February 2024 07:10",
               "html": "<p>@Enrique: Thanks a million for the question. Added &quot;why do I care&quot; section.</p>\n\n<p>@Charles: It looks like the configuration attempts continue after the error(s), or we wouldn&#39;t get numerous error messages.</p>\n",
               "id": "2091",
               "name": " Ivan Pepelnjak",
               "pub": "2024-02-09T19:10:14",
               "ref": "2090",
               "type": "comment"
            }
         ],
         "date": "07 February 2024 04:47",
         "html": "<p>Something I don&#39;t understand from the post: Isn&#39;t the result the same in any case, except for the error log? I mean, if you try to remove a network, ip address or process that does not exist, it will continue not existing in any case. </p>\n\n<p>Aside from this, I see that receiving an error message can be a nice feedback (&quot;did I just mistype the address?&quot;), which in &quot;industry standard CLI&quot; could be missing. </p>\n",
         "id": "2087",
         "name": " Enrique Vallejo",
         "pub": "2024-02-07T16:47:28",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "09 February 2024 07:11",
               "html": "<p>The last time I tried to get something done with NCLU, it ignored FRR errors, resulting in a broken config. I never touched it again; all the Cumulus Linux work we do in <em>netlab</em> uses direct FRR and ifupdown2 configuration.</p>\n",
               "id": "2092",
               "name": "Ivan Pepelnjak",
               "pub": "2024-02-09T19:11:41",
               "ref": "2089",
               "type": "comment"
            }
         ],
         "date": "09 February 2024 11:12",
         "html": "<p>On Cumulus 4 (EOL, I know) I constantly have some weird issues with frr config even if generated by NCLU. The most annoying one is when it claims frr config was modified while it wasn&rsquo;t </p>\n",
         "id": "2089",
         "name": "Michał Margula",
         "pub": "2024-02-09T11:12:47",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2024/02/frr-bgp-prefix-origination.html"
}
