{
   "comments": [
      {
         "date": "01 July 2008 11:59",
         "html": "bravo! CCIE or not I think the best Cisco resource out there..",
         "id": "5225272755278364197",
         "image": "https://farm1.static.flickr.com/220/buddyicons/27982139@N00.jpg",
         "name": "yeled",
         "profile": "https://www.blogger.com/profile/18377549894599644413",
         "pub": "2008-07-01T11:59:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "01 July 2008 12:42",
         "html": "I totally agree. IMHO Cisco should grant lifetime status to anyone who has held their CCIE for over 10 years. After all - doing that has shown considerable commitment to the brand. And it's not like you have to go back to university and continually recertify for your degree, is it?",
         "id": "8759274851098786511",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-01T12:42:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "01 July 2008 14:13",
         "html": "Well, there are few aspects of being CCIE. One of them is the requirements imposed by Cisco on channel partners. To count as a CCIE toward the partner's quota, you have to be active ... which makes sense; after all, these engineers are supposed to be taking customer requests and should be very fluent in what they do. <BR/><BR/>However, that's the only place where I strongly support Cisco's position ... and I always have so much fun reading <A HREF=\"http://www.networkworld.com/community/?q=node/15742\" REL=\"nofollow\">provocative posts</A> from people that use blogs hosted by respected industry publications to promote their agenda (whatever that is).",
         "id": "791135898380409435",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Ivan Pepelnjak",
         "profile": "https://www.blogger.com/profile/13457151406311272386",
         "pub": "2008-07-01T14:13:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "01 July 2008 16:14",
         "html": "Ivan,<BR/><BR/>With all you know now. Would you recomend to someone to get their CCIE now-a-days, or do you think knowledge and experiance enough?<BR/><BR/>Thanks,",
         "id": "2886494506522089795",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-01T16:14:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "01 July 2008 16:20",
         "html": "Yeah man! Let it rip.<BR/><BR/>Seriously though - you have made it and lost the touch with the reality out there... We mere mortals still need to recertify and do whatever needs to be done to stay in the game. Thanks for rubbing this into out faces.",
         "id": "1536071544516422850",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-01T16:20:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "01 July 2008 16:37",
         "html": "Interesting aspect of things... I've had similar experience with MCSE upgrading skills, since it becomes repetitive after a while, and you don't learn that much new.<BR/><BR/>I already saw someone ask, but here gose again:<BR/>- Is it worth it for a younger engineer to go and achieve CCIE<BR/>- What will you focus on now - I just want to see the career path of an inactive(Ex) CCIE",
         "id": "8918845482617717280",
         "image": "https://4.bp.blogspot.com/_Hu1rpxRsqcU/Sx1nDHNUtEI/AAAAAAAAAYY/KrJCug2cYWM/S220-s32/Bspirovski.jpg",
         "name": "Bozidar Spirovski",
         "profile": "https://www.blogger.com/profile/08748842042511112038",
         "pub": "2008-07-01T16:37:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "01 July 2008 17:09",
         "html": "I must agree with most sentiments expressed.  I have been an active CCIE for ten years now.  When Cisco first started the recertification program I was supporter as it did involve a continuing education requirement with CCIE level courses available.  That soon faded and was replaced by testing which in the beginning was also technology specific and updated.  Then that also faded and now it is the foundation test every two years.  In my opinion the continuing education requirement would be much more beneficial with or without a test.  If my employer did not require the CCIE I would be tempted to let mine lapse as well.  I know a few other long time CCIE's who have also allowed their cert to expire.  We have had sessions with Cisco on this but they don't seem to want to listen and sometimes I think they just like the cash flow from the testing.",
         "id": "5755256825666633845",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-01T17:09:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "01 July 2008 17:35",
         "html": "I recently earned the CCIE designation, and I'm already uncertain as to whether or not it will be worth recertifying when my time comes up in a year or two.  I went through the CCIE program as a way to become a more technically proficient network engineer.  Certainly that's happened, but passing the lab exam was most definitely not a cure-all.<BR/><BR/>Since there is no financial benefit to being certified (at least not in my specific situation), I feel as if my time will be better spent educating myself about the technologies I need to make my network function better.  A greater familiarity with the ubiquitous 6500 platform and planning design enhancements to improve resiliency during failures are issues not addressed by the CCIE program that are highly relevant to my day-to-day world.",
         "id": "6058004252573318739",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-01T17:35:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "03 July 2008 16:15",
         "html": "I agree with most of what you said, and I must say I like both your idea of giving lifetime status to 10yr CCIEs (because after 10 years, they likely no longer need a cert to prove their value - so you may as well just give them lifetime status...), and I also like the idea of maybe a 6 hour refresher course, done online, free for all current CCIEs. With Cisco pushing their WebEX stuff, I think this is a good way for them to make use of their own technology.",
         "id": "3081980130909307325",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-03T16:15:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "08 July 2008 23:41",
         "html": "I'm also a 10+ year CCIE, and I agree, re-taking the qualification test every other year is damned annoying (and expensive). When people ask me if they should get their CCIE, my answer these days is no longer an unqualified yes.",
         "id": "4056236106211923575",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Unknown",
         "profile": "https://www.blogger.com/profile/09591465597794037230",
         "pub": "2008-07-08T23:41:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "13 July 2008 01:54",
         "html": "I'm a nine-year CCIE.<BR/><BR/>Yes, the quality control on the recert exam is poor.  Very poor.<BR/><BR/>A lifetime CCIE for ten year veterans?  No way.  I had to be a guru on IPX, Banyan Vines, XNS, and Appletalk as well as IP when I originally got my CCIE.  In another ten years technologies would have changed again.<BR/><BR/>Recertification may be flawed, but it forces those who claim CCIE status to keep there skills moderately up-to-date.<BR/><BR/>Are there extremely skilled people out there who have let their CCIE status lapse?  Yep.  Are there people out there with great cisco skills who have never got a CCIE.  You bet.",
         "id": "6105638567887210867",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-13T01:54:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "21 July 2008 06:36",
         "html": "I&#39;m a recent CCIE, and I totally understand the issues the various other CCIE&#39;s have posted, I agree the CCIE is now not worth the paper its printed on. I have two questions though, 1) I&#39;m not sure what all the 10 year+ guys are complaining about, you are all eligible for life membership under the 10+ plus CCIE rule that is now in place. Check it out at the CCIE support site. 2) It&#39;s very easy to say its not worth recertifying, but just wait till your searching for a new job and going up against other current CCIE&#39;s, it looks bad. It&#39;s a very competitive world out there, China is producing 300+ CCIE&#39;s a month, this translates to a lot of competition in the job market. It&#39;s one of those things that you never know what&#39;s going to happen around the corner job wise. I&#39;ll also tell you that the R&amp;S LAB exam is progressively harder every year due to the high passing numbers they continually make it hard and hard, unlike the voice and service provider one. If you ever have to re-cert the lab, you&#39;ll be in for a big surprise.",
         "id": "1882441544919012925",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-21T06:36:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "21 July 2008 08:16",
         "html": "My Bad, it appears that \"1) you are all eligible for life membership under the 10+ plus CCIE rule that is now in place. \" is no the case, a fellow CCIE had informed me this was the case, but it appears to not be so.",
         "id": "1849099323957495919",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-21T08:16:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "24 July 2008 14:34",
         "html": "I'm a nine year ccie and have to agree on the points of test quality expressed above... it is particularly annoying for me as I live in Montana and have to drive two hours to get to the closest test center.  During my last recert in March 2008, I saw several questions that asked for the \"best\" answer and provided multiple correct answers.  The problem is that the question is scored in a binary pass / fail with no partial credit... forcing me to guess what someone else subjectively said was best at $300 per test and a six hour round-trip.  I'm not ashamed to say I had to take the silly thing twice before passing... this doesn't even include obviously absurd questions on the R/S recert that any person with knowledge of TCP would laugh at... in this case it amounted to figuring out which one of the answers given was \"least wrong\".<BR/><BR/>In all, I'm not sorry I have the CCIE and I'll continue to recert.",
         "id": "8774270726191248579",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-24T14:34:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "25 July 2008 10:32",
         "html": "I agree with some of the comments here, but certainly not all.<BR/><BR/>  People like Ivan, CCIE or not, don't have to prove anything to anyone.   If you have a significant body of work that is verifiable, chances are you'll never need a CCIE to begin with.  Experience and actual knowledge count very highly, again unless you're working for a channel partner.<BR/><BR/>  I don't agree with a 10-year automagic certification for life award, but the fact that you can say that you maintained a CCIE for 10 years (5 recerts potentially) is in and of itself an accomplishment.<BR/><BR/>  I agree that the recertification process is 'annoying', but it's not really that expensive (although living in BFE and adding in fuel cost and it's not a vacation you want to pay for).   If you're not making enough money as a CCIE-level networking professional you're doing something wrong or you've overextended your finances to complain about the minimal cost of the recert.   Also, ask your employer to pay for it.<BR/><BR/>  I love the idea of continuing education.<BR/><BR/>  I focus on the technology and as such it has allowed me to thrive in every NEM's product-line, in addition to actually implementing all the major protocols (routing and otherwise) from the ground-up at a new NEM.   <BR/><BR/>Believe me, if you think you know the technologies, try protocol implementation/analysis and you'll find out quickly that you take things for granted as a typical network engineer... things like 'turning on LDP' or 'configuring IPSec peers utilizing ISAKMP for keying', so on and so forth.   So that's an interesting career path for those who love to dissect specifications and know the protocols and operational configuration of multi-vendor equipment.<BR/><BR/>  If you're a younger engineer, by all means acquire some level of certification.   If it allows you to get your foot in the door somewhere to gain experience, then do it.   Don't be concerned what people think about certifications, just apply yourself and do the best job you can because that's really what counts.",
         "id": "7074010607819058187",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-25T10:32:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "25 July 2008 12:35",
         "html": "If you are referring to my case of driving two hours as living in BFE, I suppose you are entitled to your opinion; however, Billings is the largest city in Montana at just over 100k people... still small compared to Denver... but the issue is that Cisco's policies are removing the incentives for smaller test centers to keep offering Cisco testing... I've been told that Cisco gives test centers a quota of how many tests per month they must administer or they charge an additional $20/student for the privilege of tha center giving the test... how this makes sense is beyond me.  Comments about money don't indicate that I don't have it to pay... I simply object to paying so much for a test with such obviously bad quality control.  Then again, I'm not quite ready to give up active CCIE status so I keep doing it.",
         "id": "1276076952493158450",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-25T12:35:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "28 July 2008 16:49",
         "html": "I didn't mean anything by my comments, other than the fuel cost (car/plane) is certainly an added factor if you live a healthy distance from a testing center.<BR/><BR/>  I'd love to be able to work in Montana, gorgeous country and I have friends and family in the Great Falls area.<BR/><BR/>  From the looks of things, Slovenia looks good too =D<BR/><BR/>  The only thing that is annoying about the written test is the actual test itself.   I don't like the testing-taking trickery they use and it certainly feels like you have to prepare for it by divining what it is they're looking for instead of just wielding your concrete knowledge of the subject matter.",
         "id": "4622790777561466186",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-28T16:49:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "30 July 2008 07:07",
         "html": "After 20 years of networking I don't see a point in it. My employer wants me to do CCIE but I can't muster up the will or drive to do it. I have a great job, supporting networks and designing plus working from home. I agree it's what you know. I also highly recommend younger engineers to go for it, do it, but mostly be your best. Want an edge over the competition, be a multivendor engineer. Know Cisco inside and out but you better know some Juniper too. I rarely have walked in to an exclusive Cisco shop. So old timers, I agree why bother, young guys go for it and do your best! Just my humble opinion.",
         "id": "4142760420654505291",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2008-07-30T07:07:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "02 September 2008 19:15",
         "html": "Hey Ivan - <BR/>Have you considered trying for the CCDE?<BR/><BR/>ryan",
         "id": "6452378279060266554",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "ryan",
         "profile": "https://www.blogger.com/profile/02745806398659871393",
         "pub": "2008-09-02T19:15:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "10 March 2009 14:11",
         "html": "I&#39;m up for my 3rd IE R&amp;S recert written exam, I do not find it a good yardstick of my knowledge or experience.  It&#39;s full of obscure, fringe questions that are almost impossible to answer.   <BR/><BR/>I fully agree that mandatory continuing education credits, especially advanced refresher training (webinars..) are needed and much more beneficial than the current 2 year written exam.",
         "id": "5629176032640172458",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2009-03-10T14:11:00.000+01:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "30 March 2009 17:42",
         "html": "I am also a ten year CCIE and loved the re-certification conference getting my pass stamped at each course I learned a lot an dhad a chance to meet other network pro&#39;s. Then it became Networkers and the requirement was still there. Then a special re-cert test very focused on one subject ATM, Switching .. Now just take the written test each time it is revised it loses value. Like taking the R&amp;S test to one day.",
         "id": "8446125730464683712",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2009-03-30T17:42:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "19 April 2009 11:56",
         "html": "I got my CCIE in 2002, worked for a Cisco partner however my real passion is in the technology start-up space.  I have been working for a software start-up for the last 3years and haven't needed my full CCIE skills, I mainly use strong routing and firewall skills everyday.  I am also considering going Ivan route.  I only have a 3 weeks to recert or it goes inactive so I need to make a decision soon.",
         "id": "8187570580831031304",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Jason",
         "profile": null,
         "pub": "2009-04-19T11:56:00.000+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "10 February 2011 01:07",
         "html": "Its a shame that one does not have to recert a degree. It needs to be required and there are huge movements trying to get this to happen. If you were out of the field of for 2 decades... Do not insult us by coming back into the field and writing a &quot;scholarly&quot; book on a topic that you were an expert on 20 years ago. Technology moves fast. You need to force people to re-prove themselves. Its degrees and only degrees that have that horribly epic fail problem. Its an artifact from a time when your degree was your career. Its stupid. Renew or get a new career.",
         "id": "4026830007344582396",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "James Coleman",
         "profile": null,
         "pub": "2011-02-10T01:07:42.000+01:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "06 May 2012 14:24",
         "html": "You&#39;re so missing my point - I wanted to learn something new, but the recertification exam was &quot;same old, same old&quot;. Also, you just might want to read a few of my other blog posts before forming opinions.<br /><br />Finally, CCNPs in US earn around $70K/year (the first result I got on a Google search). Convert that to EUR and consider that there are usually no hidden employer expenses in US (like health or pension insurance in Europe) - you have to compare 70K with your gross-gross salary (which you never see on your paycheck).",
         "id": "5326982943289532505",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Ivan Pepelnjak",
         "profile": null,
         "pub": "2012-05-06T14:24:44.317+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "17 January 2013 07:43",
         "html": "Ivan, bravo.. i am a 17 year CCIE and i just let mine lapse as well.  From my perspective, the reason i let it lapse had more to do with me focusing on other technology areas, systems, storage etc.  It was also getting very very hard to keep answering multicast questions on the recerts when i havent touched multicast for a very long time.  Good for you!",
         "id": "8501773416018354690",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Tom",
         "profile": "https://www.blogger.com/profile/01802161792154893961",
         "pub": "2013-01-17T07:43:03.397+01:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "21 January 2013 15:54",
         "html": "I have been in the network field as Sr Engineer and now Principal architect for a number of years. I do not have a CCIE but have pondered on attempting this in the past. At this point there is no financial gain as I will not make any more money but I suppose it would be fun from a learning perspective.<br /><br />I will say without a doubt that a CCIE or any other cert does not make anyone an expert. That comes with experience and the hands on knowledge that is not going to be found in a book or exam. You dont need to have a CCIE to work your way up to a six figure salary and be at the top of your game. My point is that handing Cisco thousands of dollars to get these certs is not going to open a magic door with lots of money.  I lived in books and had years of experience which helped me get where I am. The learning was more important to me than getting certs. No disrespect to those who have achieved any cert but there are many paths to success....<br />",
         "id": "1596067366612227102",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2013-01-21T15:54:15.124+01:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "18 July 2013 02:31",
         "html": "I don&#39;t have the CCIE either. What I do hear is a bunch of CCIEs that want to complain about a recert test. I have a few Cisco certs, based on what I&#39;ve read everyone commenting here is an R&amp;S CCIE. As of 7/17/2013 there are 8 different tracks to go down. Why on earth a complacent CCIE in R&amp;S wouldn&#39;t pursue security or voice is beyond me. I work as a network engineer, studying for the CCIE in R&amp;S and security. I have been pushed into voice by my employer, at first a little aggravated but now ok with it. I dream about the day I get the email to look for the &quot;PASS&quot; and my number. If your looking for a challenge pickup a different track. Or don&#39;t, but don&#39;t whine about a recert test you&#39;ve taken multiple times. Focus on what you don&#39;t know and attempt that. I read a few that said they recommend the CCIE to younger engineers. I have a hard time with this, you bag on it and then encourage it? Sounds to me like you don&#39;t get challenged. ",
         "id": "1774189249715648532",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2013-07-18T02:31:51.873+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "08 February 2014 07:12",
         "html": "As per Cisco website http://www.cisco.com/web/learning/certifications/expert/ccie_rs/recert.html Inactive CCIE professionals lose all benefits and must pass both the CCIE written and lab or CCDE written or practical exams again. I am not sure if just passing CCDE written exam is enough to change your CCIE status to active",
         "id": "3667006647608498681",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "R J",
         "profile": null,
         "pub": "2014-02-08T07:12:28.910+01:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "24 March 2014 17:40",
         "html": "Cisco probably tries to make the re-certification process easier for CCIE&#39;s; since you all put the effort in to certify in the first place. I agree on Cisco offering new and upcoming tech in classes available for CCIE&#39;s though. That makes perfect sense. ",
         "id": "1753148971552689506",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2014-03-24T17:40:36.337+01:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "23 April 2014 19:47",
         "html": "Like any certification they are great to enter the field, or move up in a position, but like Ivan said once you cross a threshold of experience and a proven project and implementation track record, you don&#39;t need them anymore.<br /><br /> I at one time had about every cert you could hold, and then I let all of them go, mostly because I was too busy doing real world design than wasting endless after hours in a home lab to recert, and now I haven&#39;t had any active certs from any vendor in probably 7 years. I was scouted by Cisco and took an Engineering position with them last year, and don&#39;t hold a single active Cisco cert. <br /><br />Its not about what letters trail your name but what proven success you have had in the industry.",
         "id": "6305869811246506197",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2014-04-23T19:47:26.727+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "30 January 2015 19:01",
         "html": "I have to agree that &quot;Recertification may be flawed, but it forces those who claim CCIE status to keep there skills moderately up-to-date&quot;<br /><br />I disagree with &quot; threshold of experience and a proven project and implementation track record, you don&#39;t need them anymore.&quot;  How do you prove this with a resume/cover letter..how do you prove this in a hour interview&quot;...references?...less reliable than certs.....good luck putting your extensive experiences on a resume and then having people actually read it..<br /><br />&quot;Certs to learn something new&quot;...not your style Ivan...you push yourself well beyond what most certs do natively...(unlike most 20+ year professionals).<br /><br />CCIE for IVAN....of course it really doesn&#39;t matter for you.....you could send out your name and contact info on a blank piece of paper and you would receive 1000 job offers the next day....however, most of us &quot;John Smiths&quot; don&#39;t have that luxury.<br /><br /><br /><br />",
         "id": "8825508721814751884",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2015-01-30T19:01:14.745+01:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "09 March 2015 21:35",
         "html": "I&#39;m a 15yr CCIE.  The test is now $400.  It continues to be annoying.  <br /><br />In my years of varied experience with networks big and small, I have NEVER seen RIP in operation. I have seen hundreds of networks.  This test had many questions on RIP.   <br /><br />I have only seen EIGRP in operation when I was removing it in favor of OSPF.  This test had many questions about EIGRP.<br /><br />It has truly become a &quot;vendor&#39;s test&quot; where you have to know about Cisco-proprietary features above/beyond the IETF/IEEE standards.  All of these proprietary features with little focus on standards makes for an annoying test.  <br /><br />The filler is worse.  I won&#39;t disclose any questions - one was about &quot;internet history&quot; - asking the name of the algorithm at the heart of a seldom used protocol.  Knowing this does not give any indication to your technical knowledge or capability.  Full disclosure: I knew the answer.  I&#39;ll keep emeritus going for now.  $85/yr is cheap storage for something that I paid a lot to get/keep in the first place... and I might need it later.",
         "id": "246286098919982742",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2015-03-09T21:35:45.522+01:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "10 June 2015 10:32",
         "html": "I am a inactive CCIE for the past 10 years. <br />I completely agree with Evan that a CCIE or any other cert will not make one expert rather it comes through experience and working knowledge. Moreover I found human beings to be more interesting to work with rather that inert machines. It gives me more satisfaction and challenge due to their uniqueness. I have moved to the domain of Clinical Psychology.",
         "id": "6802551747885966268",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Unknown",
         "profile": "https://www.blogger.com/profile/12869727382421394105",
         "pub": "2015-06-10T10:32:58.816+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "02 April 2016 00:52",
         "html": "the grass is always on the other side. those that have ccie for a while get tired of the allure with it and those that don&#39;t have the ccie, are envy in wanting to get the designation. i imagine it&#39;s like hooking up with a hot stripper. once you&#39;ve had your ways with one, after a while you get tired of the all hassles that come with it and you just want be with a girl without all the strings attached to it:) ",
         "id": "533537211670607894",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2016-04-02T00:52:14.896+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "04 July 2016 03:00",
         "html": "I almost wonder if it isn&#39;t a mark of distinction in one&#39;s career to let the CCEI go. I&#39;ve been certified a bit shy of a decade, and this written exam prep is just such a waste of valuable time. I have no time for trivia (which can easily be googled in the real world within a few second&#39;s time), and I don&#39;t for a second believe that passing this junk exam (written by either morons or non-english-speakers or non-network-engineers) proves a single thing about my capabilities. I don&#39;t ever plan to work for a reseller in an actual CCIE capacity, so I think it&#39;s time to just cut ties. Likely will let all other lower certifications go as well, since none of those are worth dirt...",
         "id": "1792166004240843484",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2016-07-04T03:00:49.556+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "09 June 2017 16:15",
               "html": "Finally? Better too late than never? ;)",
               "id": "8894156063976316583",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "Ivan Pepelnjak",
               "profile": "https://www.blogger.com/profile/13457151406311272386",
               "pub": "2017-06-09T16:15:15.635+02:00",
               "ref": "6344752377411301946",
               "type": "comment"
            }
         ],
         "date": "09 June 2017 16:13",
         "html": "What are your thoughts on the new CEP that cisco announced for recertifying the CCIE?<br />https://learningnetwork.cisco.com/community/certifications/cisco-continuing-education-program",
         "id": "6344752377411301946",
         "image": "https://4.bp.blogspot.com/_TKA7X4s2yqw/TT8o7ivwIGI/AAAAAAAAAAM/2tfOPL2VcJU/s32/ccna_med.gif",
         "name": "wizard",
         "profile": "https://www.blogger.com/profile/17555664891506980151",
         "pub": "2017-06-09T16:13:21.418+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "14 September 2017 15:26",
               "html": "They introduced alternative ways to recertify recently (attending a course, Cisco Live...). 10 years too late for me, but nonetheless.",
               "id": "3206379857336369130",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "Ivan Pepelnjak",
               "profile": "https://www.blogger.com/profile/13457151406311272386",
               "pub": "2017-09-14T15:26:52.885+02:00",
               "ref": "5211040862983122817",
               "type": "comment"
            }
         ],
         "date": "14 September 2017 08:06",
         "html": "I got my CCIE cert quite recently (2 years ago) - It was damn hard to achieve. <br />However, my day to day job doesn&#39;t focus on Cisco exlusively and I don&#39;t remember the tiny bits of detail about EIGRP/RIP and even OSPF (But, once I need it I can google it).<br />Retaking this written exam and memorizing all these tiny bits of detail, just to forget them again after a week, seems a waste of time and a waste of slots in my brain.",
         "id": "5211040862983122817",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Unknown",
         "profile": "https://www.blogger.com/profile/09445317470937394100",
         "pub": "2017-09-14T08:06:35.204+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "14 September 2017 08:09",
         "html": "When will Cisco stop this stupid game...<br />And change the re-certification program to a seminar or something more productive than this stupid worthelss exam.",
         "id": "2278650737005440174",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2017-09-14T08:09:03.541+02:00",
         "ref": "2159285807572996595",
         "type": "comment"
      },
      {
         "date": "27 December 2024 05:56",
         "html": "<p>Your post about stepping away from the CCIE is incredibly honest and thought-provoking. It&rsquo;s refreshing to see such a candid reflection on personal growth, career shifts, and the changing landscape of technology certifications. https://www.lawrencevilleconcrete.com/</p>\n",
         "id": "2491",
         "name": " Lawrenceville Concrete",
         "pub": "2024-12-27T17:56:40",
         "type": "comment"
      }
   ],
   "count": 39,
   "id": "2159285807572996595",
   "type": "post",
   "url": "2008/07/why-im-no-longer-active-ccie.html"
}
