{
   "comments": [
      {
         "date": "10 November 2020 11:12",
         "html": "<p>I love this write up. Good work. As an aspiring young network engineer...you work keeps my mind imagining... I truly love the efforts</p>\n",
         "id": "227",
         "name": "pemiolatunji",
         "pub": "2020-11-10T11:12:34",
         "type": "comment"
      },
      {
         "date": "10 November 2020 07:06",
         "html": "<p>Yes you always learn from Ivan for he always covers the topics of the day very well with a great and sometimes humors perspective on things, plus his training is outstanding. </p>\n\n<p>This is a great topic. </p>\n\n<p>I don&#39;t know if this what was discussed prior but maybe some consideration on the types of failures should be covered initially to align with the discussion on when fast failover should occur?  Maybe a subcategory after item #1 For example  L1 failure with a low/med/high category for when fast fail is used plus upward/downward signaling.  Outline the  same for  L2-7 types. Maybe include a simple table of the common types of failures noted these days and align to the Fast Fail over approach expected to be used or when used.   When designing we need to know clearly when to &quot;go all in&quot; on fast fail over and when not to plus when to return to recovered state(the failure is corrected and original path is in use- no stickiness). Think dampening mechanisms or false negatives tripping off Fast Fail over.  This will tie nicely to the rest of the basics outline listed. </p>\n",
         "id": "228",
         "name": "Jeff Sicuranza",
         "pub": "2020-11-10T19:06:35",
         "type": "comment"
      },
      {
         "date": "13 November 2020 09:25",
         "html": "<p>Do we really need ms failover? \nAs usual, it depends... :-)</p>\n\n<p>If your flows are big compared to your available bandwidth, then probably yes, but only for some critical traffic.</p>\n\n<p>If you have plenty of bandwidth, then it is better to use simulcast. This the way how radio voice is now handled in ED-137, this is how radar sensor data is 4-times replicated using the ARTAS scheme. In the LAN you could use PRP or something similar.</p>\n\n<p>But even with simulcast, at the de-duplication point you have a lot to decide. How can I really detect that a flow is bad? Can I do a per-packet de-duplication reliably, or do I have choose the best stream? In the later case, how can I have some stability?</p>\n\n<p>With packet de-duplication, the problem is different delays. Either you have to have similar delays on alternate paths, or you have to introduce delay compensation. In either way, you will have additional delay. That is the price for your packet-level de-duplication.</p>\n\n<p>As usual, you have to make a trade-off...</p>\n",
         "id": "231",
         "name": "Bela Varkonyi",
         "pub": "2020-11-13T09:25:14",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2020/11/fast-failover-challenge.html"
}
