{
   "comments": [
      {
         "date": "24 November 2020 01:46",
         "html": "<p>Thought the ASR9000 chipsets aren&#39;t Broadcom based, just unfortunately similarly named</p>\n",
         "id": "253",
         "name": " Tim",
         "pub": "2020-11-24T13:46:45",
         "type": "comment"
      },
      {
         "date": "24 November 2020 04:16",
         "html": "<p>This is important statement to remember that hardware must be programmed. This is true not only for FRR, IPLFA, ECMP, but also for EIGRP Feasible Successor and Prefix Prioritization. For example Prefix Prioritization was added in hardware by Cisco somewhere in 2015 on some platforms. Prior that there was no guarantee that the order of prefixes configured in software was preserved in hardware.</p>\n\n<p>Just to clarify some points:\n- &quot;PIC Core (recursive next-hop resolution in a ECMP network)&quot; - PIC Core takes care of hierarchical FIB and resolution not only in ECMP.\n- On modern platforms PIC Core is enabled by default. On older like 7600 it requires an additional command. So to have hardware based backup path in IPFLA on ASR9k it is enough to turn on IPLFA.\n- &quot;keep in mind that on modern CPUs the reprogramming of forwarding tables might take longer than the time a routing protocol needs to do its job&quot; - It depends on the number of prefixes/objects to be programmed. Every hardware has its own FIB speed like ASR1k around 13k prefixes/second. This means that writing/removing 13k of prefixes takes 1 second. So a routing table computation can be faster but the overall convergence process will be longer as it requires also updating HW FIB.</p>\n",
         "id": "255",
         "name": "Piotr Jablonski",
         "pub": "2020-11-24T16:16:30",
         "type": "comment"
      },
      {
         "date": "24 November 2020 04:21",
         "html": "<p>@Piotr: Thanks a million for the ASR1K data point - exactly what I needed. Any pointers to documentation I could use?</p>\n\n<p>My point was &quot;<em>if it takes 1 second to reprogram the FIB, who cares if it takes 1 msec or 100 msec to find the alternate path</em>&quot;.</p>\n",
         "id": "256",
         "name": "Ivan Pepelnjak",
         "pub": "2020-11-24T16:21:10",
         "type": "comment"
      },
      {
         "date": "24 November 2020 04:39",
         "html": "<p>&gt;&gt;Thought the ASR9000 chipsets aren&#39;t Broadcom based, just unfortunately similarly named\nThe NPUs are EZchip-silicon, at least for Trident &amp; Typhoon, Tomahawk &amp; Lightspeed maybe too. But they&#39;re also using Broadcom with the switch fabric which is (to my knowlege) just a big Broadcom-silicon-based switch.\nNot sure, but that&#39;s perhaps where the generation-name is derived from.</p>\n\n<p>&gt;&gt;On modern platforms PIC Core is enabled by default.\nThat&#39;s probably not true in all cases.\nIt might be true for routers, but definitely not for switches, especially not for datacenter switches. The reason for that is the compromise you have to take in lookup time vs convergence time which is flat FIB vs hierarchical FIB (a.k.a. &quot;PIC Code&quot;).</p>\n",
         "id": "257",
         "name": " Christoph",
         "pub": "2020-11-24T16:39:34",
         "type": "comment"
      }
   ],
   "count": 4,
   "type": "post",
   "url": "2020/11/fast-failover-implementation.html"
}
