{
   "comments": [
      {
         "date": "18 November 2020 10:05",
         "html": "<p>Related to the first point about point-to-point sessions in TCP, I would also add that OSPF neighbor discovery (via broadcast of Hello messages) is impossible to be implemented over TCP. You might replace IP multicast for multiple individual TCP sessions to disseminate LSA information (your first point), but you cannot implement neighbor discovery using TCP, because you need to know the other endpoint in order to establish the TCP connection.</p>\n",
         "id": "243",
         "name": "Enrique Vallejo",
         "pub": "2020-11-18T10:05:09",
         "type": "comment"
      },
      {
         "date": "18 November 2020 11:15",
         "html": "<p>I&#39;ve got a copy of &quot;OSPF: Anatomy of an Internet Routing Protocol&quot; by  John T Moy ISBN 0-201-63472-4.</p>\n\n<p>I hope the quote below proves of interest. </p>\n\n<p>Section 3.2 which discusses the choice of  encapsulation (Page 51 in my copy)</p>\n\n<p>&quot;We did not need the reliability of TCP; link-state routing protocols have their own reliability built into the flooding algorithms, and TCP would just get in the way. Also, the ease of applications in UNIX and other operation systems to sent and receive UDP packets was seen by some as a disadvantage; the necessity of gaining OS privileges was seen as providing some small amount of security. The additional small benefits of UDP encapsulation were outweighed by the extra 8 bytes of UDP header overhead that would appear in every protocol packet. So we decided to run OSPF directly over the IP network layer, and we received an assignment of IP protocol number 89 from the IANA&quot;</p>\n",
         "id": "244",
         "name": "Paul Hare",
         "pub": "2020-11-18T11:15:06",
         "type": "comment"
      },
      {
         "date": "18 November 2020 01:17",
         "html": "<p>@Enrique &amp; Paul: Thanks a million. Added to the blog post.</p>\n",
         "id": "245",
         "name": "Ivan Pepelnjak",
         "pub": "2020-11-18T13:17:42",
         "type": "comment"
      },
      {
         "date": "18 November 2020 01:55",
         "html": "<p>Note that recently there were idiots who suggested using TCP for the flooding of LSPs in IS-IS.\nhttps://tools.ietf.org/html/draft-hsmit-lsr-isis-flooding-over-tcp-00</p>\n\n<p>This won&#39;t work over a multi-point network (like a switched Ethernet with more than 2 routers). This would work only over p2p links. But there are benefits (see draft):\n- flow-control, improving the speed of flooding of large numbers of LSPs\n- using reliability of TCP\n       which allows the IS-IS implementation to be a bit simpler. and keep less state.\n       and removes scaling factors like having to use large amounts of precise timers.\n- retransmission is done by the kernel, not by the IS-IS process.\n       which gives you a form of multi-threading for free\n- all future improvements to TCP can be used automatically by IS-IS</p>\n\n<p>But nah. The IETF LSR workgroup has decided they rather invent their own new wheel.</p>\n",
         "id": "246",
         "name": " Henk",
         "pub": "2020-11-18T13:55:22",
         "type": "comment"
      }
   ],
   "count": 4,
   "type": "post",
   "url": "2020/11/ospf-not-using-tcp.html"
}
