{
   "comments": [
      {
         "comments": [
            {
               "date": "29 March 2022 06:58",
               "html": "<p>Thanks a million -- forgot about that one.</p>\n\n<p>While it&#39;s perfectly possible to implement anycast with OSPF (see https://blog.ipspace.net/2021/11/anycast-mpls.html), I always recommend running EBGP with servers. Added to the blog post.</p>\n",
               "id": "1119",
               "name": " Ivan Pepelnjak",
               "pub": "2022-03-29T18:58:07",
               "ref": "1116",
               "type": "comment"
            }
         ],
         "date": "28 March 2022 05:06",
         "html": "<p>Another situation where I would use BGP is when deploying anycast services (like anycasted DNS resolvers) in the network. You don&#39;t want to have those anycast nodes interfere with your IGP. BGP provides a nice separation of control/policy to keep mistakes from bringing down the network.</p>\n",
         "id": "1116",
         "name": " Sander Steffann",
         "pub": "2022-03-28T17:06:06",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "01 April 2022 07:10",
               "html": "<p>And that&#39;s why I started with &quot;I&rsquo;m presenting a black-and-white picture&quot; ;)</p>\n\n<p>There&#39;s nothing wrong with what you&#39;re doing if it works for you, and you&#39;re happy with whatever level of complexity you had to deal with to get it done. There&#39;s also the question of configuration defaults: EBGP in the data center is trivial with Cumulus and gets pretty messy with any other gear, in particular when you hit vendor limitations that push you toward IBGP-between-loopbacks-over-EBGP.</p>\n\n<p>You&#39;ll find tons of details in https://www.ipspace.net/kb/tag/BGP-DC.html</p>\n",
               "id": "1125",
               "name": "Ivan Pepelnjak",
               "pub": "2022-04-01T07:10:45",
               "ref": "1123",
               "type": "comment"
            }
         ],
         "date": "31 March 2022 11:10",
         "html": "<p>Can you please explain for someone not as experienced why it is bad to use EBGP as an IGP?\nWe are running edge OSPF for our data center and WAN sites and tying it together with EBGP (instead of IGP + IBPG core or OSPF route summarization as you described).\nIt is working fine for us but I am trying to understand where the problem lies with that design.</p>\n",
         "id": "1123",
         "name": " Dennis ",
         "pub": "2022-03-31T23:10:54",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2022/03/bgp-igp-enterprise-network.html"
}
