{
   "comments": [
      {
         "date": "08 March 2022 01:58",
         "html": "<p>First I&#39;d like to add a little bit of information regarding the Enterasys S-Series and K-Series:</p>\n\n<p>The K-Series, mentioned in the link given by Ivan above, was a smaller, cheaper offspring of the S-Series for use as access switches.  The S-Series was positioned for use as core and distribution switches.</p>\n\n<p>To provide an impression for readers who might not know these Enterasys devices, but have some familiarity with Cisco Catalyst switches:  where an Enterasys <em>marketer</em> would have placed an S-Series, a Cisco <em>marketer</em> might have placed a Catalyst 6500; where an Enterasys <em>marketer</em> would have placed a K-Series, a Cisco <em>marketer</em> might have placed a Catalyst 4500.</p>\n\n<p>Then I&#39;d like to support Ivan&#39;s <em>remain skeptical</em> position:</p>\n\n<p>Whenever marketing slides position a device as generally better than everything else, because it uses <em>Technology X&reg;&trade; (patent pending)</em>, this might not be completely accurate.</p>\n\n<p>Using a topology-based forwarding router with <em>too small hardware tables</em> works less well than using a flow-based router with <em>sufficient performance</em>.  The difference here is not the forwarding technology used, but selecting a device fitting the requirements.</p>\n\n<p>Topology-based packet forwarding enables the use of addressing hierarchy to scale a deployment.  Sadly I have seen networks where <em>the selected</em> topology-based devices did not work well, because the so called network &quot;design&quot; did not include such an addressing hierarchy, and the devices used would have required it.  Surprisingly, in <em>some</em> of those networks, replacing <em>the selected</em> chassis switches with Enterasys S-Series would have solved the performance problems without a re-design.  This, of course, is nothing more than an anecdote.</p>\n\n<p>I think these Enterays switches provide an interesting example, because they used a technology different from the mainstream, and they did generally work well.</p>\n\n<p>[Enterasys Networks was acquired by Extreme Networks in 2013, and most former Enterasys customers have now either replaced their flow-based switches with topology-based ones or have started the process of doing so.]</p>\n",
         "id": "1075",
         "name": "Erik Auerswald",
         "pub": "2022-03-08T13:58:59",
         "type": "comment"
      },
      {
         "date": "08 March 2022 09:01",
         "html": "<p>My only encounter with Enterasys was a corporate customer around 2008. when I was onsite for our WAN line they encountered &bdquo;another&ldquo; meltdown of their network, requiring a cold restart of both switches. \nThey did not sound too happy about their investment. </p>\n",
         "id": "1076",
         "name": " Arne",
         "pub": "2022-03-08T21:01:50",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2022/03/flow-based-forwarding.html"
}
