{
   "comments": [
      {
         "comments": [
            {
               "date": "01 April 2022 07:23",
               "html": "<p>Carrier Ethernet is L2VPN and might utilize MPLS as the transport layer. See https://en.wikipedia.org/wiki/Carrier_Ethernet</p>\n\n<p>As for the <em>ease of consuming</em> L2VPN versus L3VPN services (from the end-user perspective): I covered that in details in the <em>Choose the Optimal VPN Service</em> webinar and in the January 2022 Design Clinic. There might be a blog post or two covering that topic as well. </p>\n",
               "id": "1126",
               "name": "Ivan Pepelnjak",
               "pub": "2022-04-01T07:23:58",
               "ref": "1122",
               "type": "comment"
            },
            {
               "date": "01 April 2022 09:17",
               "html": "<p>It is not just about consuming. The provisioning by the service provider becomes much simpler with Carrier Ethernet. It can be also fully automated, even over a long chain of multiple service providers. \nWhile the prices in a competitive situation cannot cover the cost of complex provisioning schemes. So Carrier Ethernet wins by the simple cost effectiveness reasons. </p>\n",
               "id": "1127",
               "name": " Bela Varkonyi",
               "pub": "2022-04-01T09:17:43",
               "ref": "1126",
               "type": "comment"
            }
         ],
         "date": "31 March 2022 10:01",
         "html": "<p>&gt; Carrier Ethernet became a viable alternative, and as much as it hurts me, I&rsquo;m usually recommending customer-managed routers attached to Carrier Ethernet as a better (and safer) alternative to MPLS/VPN</p>\n\n<p>If I may ask, how did Carrier Ethernet become a viable alternative that obsoleted L(2|3)VPNs? To my understanding it doesn&#39;t really bring much to the table except maybe a somewhat templated design on how to sell certain types of edge handoffs between the SP and customer.</p>\n\n<p>I take it by offloading the MPLS L(2|3)VPNs to the provider, and the provider handing off using Carrier Ethernet that it&#39;s easier to have a standardized set of interface configurations?</p>\n",
         "id": "1122",
         "name": "Kristijan Taskovski",
         "pub": "2022-03-31T22:01:19",
         "type": "comment"
      },
      {
         "date": "01 April 2022 01:35",
         "html": "<p>This is akin to people complaining at the IRS about how the US tax code is too darn complex (features). Manufacturers (IRS) didn&rsquo;t dream up this complexity for fun. If I may borrow the newest meme fad: My brothers in Christ, We wanted these features. And now it&rsquo;s too complex? Maybe it&rsquo;s too complex because We lacked the agency and fortitude to reject unreasonable business demands. We still do, stretched L2 anyone? </p>\n",
         "id": "1124",
         "name": "John Coke",
         "pub": "2022-04-01T01:35:43",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2022/03/mpls-vpn-too-complex.html"
}
