{
   "comments": [
      {
         "comments": [
            {
               "date": "06 December 2022 03:46",
               "html": "<p>Yeah, I was thinking along the same lines when trying to figure out the limitations of L3 forwarding (that&#39;s why I included the link to that blog post). </p>\n\n<p>Turns out that the easiest way to implement peer link filters (for bridging) is to have an egress ACL that matches on ingress interface (peer link), and the ingress interface doesn&#39;t change if the packet is routed.</p>\n",
               "id": "1551",
               "name": "Ivan Pepelnjak",
               "pub": "2022-12-06T15:46:35",
               "ref": "1550",
               "type": "comment"
            }
         ],
         "date": "06 December 2022 09:48",
         "html": "<p>Regarding &quot;<em>In that case, S2 forwards the packet toward S1 over the peer link (due to the destination MAC address), but S1 cannot forward it to A (because it arrived over the peer link).</em>&quot;</p>\n\n<p>While that is basically true(*) for bridged traffic, I see no problem to IP forward (route) an IP packet that arrived via peer link out of a local MLAG port. So while this is not optimal, it should work in general.</p>\n\n<p>To make this more explicit: An Ethernet frame addressed to S1 arrives on an MLAG port of S2. S2 bridges the frame to S1. S1 conceptually receives the frame and performs an IP lookup. It then does IP forwarding (a.k.a. routing) and in principle creates a new Ethernet frame (actually re-writes the existing frame) to send towards the directly connected host A.</p>\n\n<p>Technically, an ACL installed to drop bridged frames on egress on a local MLAG port needs to allow routed traffic.  That could be implemented by allowing the local switch&#39;s source MAC, or via a flag set in the packet processing pipeline.  I would expect that there are further implementation possibilities.</p>\n\n<p>(This would affect peer link sizing, because in that situation one would expect about half the routed traffic from the router needing to traverse the peer link. Thus using a shared router MAC and so on could be used as an optimization.)</p>\n\n<p>(*) In this case, i.e., when an Ethernet frame from an MLAG with an active port on the peer arrives via peer link, it must not be bridged to any local MLAG port where the peer also has an active MLAG port in the same MLAG, because then the peer has already sent the frame to those MLAGs. With individual link failures frames arriving via peer link may need to be bridged to local MLAG ports.</p>\n",
         "id": "1550",
         "name": "Erik Auerswald",
         "pub": "2022-12-06T09:48:37",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "06 December 2022 05:03",
               "html": "<p>Yeah, you&#39;re right about the <em>secret sauce</em> part.</p>\n\n<p>In the example you mentioned, it could be that the vendor already had to implement unicast MAC address sharing between MLAG members to support storage arrays that couldn&#39;t spell ARP -- some of them supposedly used source IP+MAC address gleaning to build fake ARP entries (that&#39;s why Nexus OS has <strong>peer-gateway</strong> command).</p>\n",
               "id": "1555",
               "name": "Ivan Pepelnjak",
               "pub": "2022-12-06T17:03:20",
               "ref": "1554",
               "type": "comment"
            }
         ],
         "date": "06 December 2022 04:53",
         "html": "<p>Well, I know of one MLAG implementation that at first did not &quot;support&quot; attaching one router via MLAG to the MLAG switches and using routing protocols and L3 forwarding between router and MLAG switches. But at least one customer did that, and it worked just fine. Later this was brought to the vendor&#39;s attention, and they did not find a reason why it should not work. A bit later the vendor&#39;s documentation changed to show this as supported.</p>\n\n<p>Thus I suspect that their MLAG implementation did not need any special additions.</p>\n\n<p>It is sad that the vendors treat many of the MLAG implementation details as <em>secret sauce</em> ingredients. :-(</p>\n",
         "id": "1554",
         "name": "Erik Auerswald",
         "pub": "2022-12-06T16:53:18",
         "type": "comment"
      },
      {
         "date": "07 December 2022 02:07",
         "html": "<p>Just don&rsquo;t&hellip;</p>\n",
         "id": "1556",
         "name": " Jeff T",
         "pub": "2022-12-07T02:07:18",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2022/12/mlag-routing.html"
}
