{
   "comments": [
      {
         "date": "02 October 2023 08:37",
         "html": "<p>It may interest readers that the GTSM RFC5082 specifies a sending TTL of 255, where one might have expected a TTL equal to the maximum number of hops acceptable</p>\n\n<p>This implies a TTL of 253 is considered &quot;too low&quot; for a standard directly connected EBGP peering session</p>\n",
         "id": "1948",
         "name": "Jeroen van Bemmel",
         "pub": "2023-10-02T20:37:16",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "03 October 2023 08:22",
               "html": "<p>I hoped that GTSM would be implemented in CoPP ACL (the only place where it would make sense) or failing that in <strong>iptables</strong> in Linux-based devices. Looks like I was way too optimistic (again).</p>\n\n<p>As for &quot;it works on one of the two BGP speakers&quot;, you can drop packets when the source or destination port is 179 and TTL is too low, and allow all other packets with source or destination port 179 (or just let them through)</p>\n",
               "id": "1950",
               "name": "Ivan Pepelnjak",
               "pub": "2023-10-03T08:22:17",
               "ref": "1949",
               "type": "comment"
            },
            {
               "date": "03 October 2023 12:59",
               "html": "<p>Thanks, legitimate BGP packets entering a BGP speaker have either a source or destination port of 179, this takes care of both directions.</p>\n\n<p>Back in the day, I had hoped that SSH service ACLs were implemented in some kind of control plane ACL. But then I tested it on different devices: some would look at the source address only after starting SSH session establishment. Thus service ACLs would not protect from vulnerabilities in the SSH session establishment code. I would expect similar problems might occur with any service on a router.</p>\n\n<p>(I still use service ACLs for hardening, I see it as one element in a defense in depth approach.)</p>\n",
               "id": "1951",
               "name": "Erik Auerswald",
               "pub": "2023-10-03T12:59:12",
               "ref": "1950",
               "type": "comment"
            }
         ],
         "date": "02 October 2023 11:00",
         "html": "<p>One might be able to combine an inbound interface ACL with the GTSM idea. If the system allows to match on TTL in combination with IP, protocol (TCP), and port, this could be used to drop packets with too low TTL value. GTSM still needs to be enabled so that the BGP speakers use high instead of low TTL values.</p>\n\n<p>This is not perfect, e.g., it only works on one of the two BGP speakers of a session (the one that answers a SYN sent to TCP port 179), but it could help against some random attacker from across the Internet intending to send a crafted OPEN message for remote code execution.</p>\n",
         "id": "1949",
         "name": "Erik Auerswald",
         "pub": "2023-10-02T23:00:56",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2023/10/bgp-session-security-snafu.html"
}
