{
  "comments": [
    {
      "date": "15 September 2016 12:23",
      "html": "GETVPN can be used in conjunction with DMVPN stripped of the tunnel protection profile, (so basically just mGRE+NHRP) to enable centralised IPSEC policy. Having the shared TEK is nice too, because it removes IPSEC negotiation time during re-convergence events or new spoke-spoke communication flows and reduces your SA count to 1.<br /><br />Having said that, I&#39;ll never use GETVPN (or Juniper Group VPN) ever again. Despite four keyservers in two data centres, a combination of a bug + data centre scheduled maintenance brought down every site in an 1000 site network. ",
      "id": "5461794120820881291",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2016-09-15T12:23:50.448+02:00",
      "ref": "3478977583998076086",
      "type": "comment"
    },
    {
      "date": "17 September 2016 20:00",
      "html": "As always it depends. The question should not be using MACSec for a L2VPN or GETVPN for a L3VPN. Once the transport backbone has been determined, operational requirements should be the foundation for technical decisions. MACSec is neither dirt-cheap (the software license still has a price, even when bundled into a security image) nor the smartest way to encrypt Ethernet at layer 2 for WANs and MANs. IEEE MACSec has been designed for LAN use and one key objective has been low hardware cost so that it could be build in every Ethernet network chip and vendors would have an opportunity to sell software licenses. A WAN is a different beast than a LAN, has a different behavior - especially when traversing different Carrier networks - and needs a different level of protection. Embedded MACSec solutions have limited scalability, limited functionality, provide low-assurance security and many of them max out at 90% IMIX throughput at 10G. Specialized solutions developed for Carrier Ethernet networks  tend to come with full scalability (up to 1000 peers), much more functionality, provide high-assurance security, full throughput and state-of-the-art key management (including sophisticated and battle-proven group key management). <br />For Ethernet encryption for WAN and MAN there are substantially better options than MACSec. ",
      "id": "7719942091964594413",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Christoph Jaggi",
      "profile": "http://www.uebermeister.com",
      "pub": "2016-09-17T20:00:13.184+02:00",
      "ref": "3478977583998076086",
      "type": "comment"
    },
    {
      "date": "28 September 2016 12:46",
      "html": "Apparently Cisco does not really support the scenario if there is a device between MACSEC endpoints. Which is pretty much always the case  with a provider offering some service.",
      "id": "7013356633031436469",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2016-09-28T12:46:28.218+02:00",
      "ref": "3478977583998076086",
      "type": "comment"
    },
    {
      "date": "31 January 2017 13:29",
      "html": "@Anonymous.  While Cisco was challenged in this scenario, Cisco created a new MACsec framework in, what is now referred to as &quot;WAN MACsec&quot;, where they offer the operator the ability to change the MKA (MACsec keying packets) MAC address as well as ethertype to a well-known pair, that public Ethernet carriers and backbone-bridges will not consume and process (and then drop which is the case for current EAP over LAN packets).  There is a solutions paper available discussing this solution, in detail.  http://www.cisco.com/c/en/us/products/collateral/ios-nx-os-software/identity-based-networking-services/white-paper-c11-737544.html ",
      "id": "7217717367133369127",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "netwrkr95",
      "profile": "https://www.blogger.com/profile/11794995375993905890",
      "pub": "2017-01-31T13:29:23.664+01:00",
      "ref": "3478977583998076086",
      "type": "comment"
    },
    {
      "date": "15 September 2017 20:45",
      "html": "If you overlay a SP&#39;s MPLS network and/or Internet then GetVPN is a logical solution as it encrypts the packets - does not do the tunneling (i.e. VxLAN or LISP overlay with GetVPN - GDOI for encryption).  MacSec is interesting, but doesn&#39;t the SP need to decrypt on ingress and encrypt on egress?  I&#39;m paranoid and you should be as well.",
      "id": "496443636971602909",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Unknown",
      "profile": "https://www.blogger.com/profile/13441265379533450496",
      "pub": "2017-09-15T20:45:24.970+02:00",
      "ref": "3478977583998076086",
      "type": "comment"
    }
  ],
  "count": 5,
  "id": "3478977583998076086",
  "type": "post",
  "url": "2016/09/should-i-use-l2vpnmacsec-or-l3vpngetvpn.html"
}