{
   "comments": [
      {
         "date": "22 September 2022 09:45",
         "html": "<p>I like SR-MPLS because it doesn&rsquo;t switch labels on every hop, (assuming uniformly configured node SIDs) which makes debugging easier.</p>\n\n<p>I used to think SRv6 was great, until I started looking at what was needed to prevent 3rd parties from sending traffic across weird paths in my network. Then I realised that having a separate layer like MPLS has its benefits :)</p>\n\n<p>It&rsquo;s hard to get traffic to VMs, but it&rsquo;s also much harder for (customer?) VMs to mess with my network&hellip;</p>\n",
         "id": "1381",
         "name": "Sander Steffann",
         "pub": "2022-09-22T09:45:03",
         "type": "comment"
      },
      {
         "date": "22 September 2022 04:56",
         "html": "<p>Many thanks for such an interesting post.</p>\n\n<p>Do you think vendors current supported label max stack might be an issue when trying to route a packet from source using Adj-SIDs on relatively big sized (and meshed) cores? Many seem to be proposing to use SRv6 to overcome this...</p>\n",
         "id": "1384",
         "name": " Jorge Ravazzola",
         "pub": "2022-09-22T16:56:02",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "22 September 2022 05:48",
               "html": "<p>... and the problem with SRv6 is that it doesn&#39;t seem to be supported by commodity hardware at all.</p>\n\n<p>Found a document claiming &quot;25 hardware implementations&quot;, but never found a corresponding list with 25 entries (unless it&#39;s the Jericho chipset, which one could hardly call &quot;commodity&quot;).</p>\n",
               "id": "1386",
               "name": " Ivan Pepelnjak",
               "pub": "2022-09-22T17:48:56",
               "ref": "1385",
               "type": "comment"
            }
         ],
         "date": "22 September 2022 05:02",
         "html": "<p>The problem with SR-MPLS is that it does not play well with commodity hardware and ECMP. The label stack depth renders many commodity ASIC&#39;s unable to make a ECMP decision to send the flow on. Entropy labels doesn&#39;t really help since each takes two-labels and, on some commodity hardware, would require one every 2 SR labels. So the solution is great if you want to continue to purchase big iron ASIC&#39;s for the middle of your network.</p>\n\n<p>SRv6 offsets this via the entropy field. Allowing the ingress point to set a entropy value which mid-points in the network can hash on.</p>\n",
         "id": "1385",
         "name": " David Sinn",
         "pub": "2022-09-22T17:02:58",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2022/09/greenfield-sr-mpls-srv6.html"
}
