{
   "comments": [
      {
         "comments": [
            {
               "date": "20 September 2022 12:31",
               "html": "<p>...you can ignore just realized the context was DC :)</p>\n",
               "id": "1374",
               "name": "kon ",
               "pub": "2022-09-20T12:31:06",
               "ref": "1373",
               "type": "comment"
            }
         ],
         "date": "20 September 2022 11:29",
         "html": "<p>The tradeoff is that bridging is simple and low cost. You can build access sites (smallish metro or RAN rings) with low cost and minimal integration efforts. It may be &quot;ancient&quot; and spanning tree may be an anathema but not everything is servers connected single hop to a L3 domain with the luxury of direct multi-homing links. And from what i hear we are still discussing spanning tree on EVPN/VXLAN access, there must be a good reason :)</p>\n",
         "id": "1373",
         "name": " kon",
         "pub": "2022-09-20T11:29:44",
         "type": "comment"
      },
      {
         "date": "20 September 2022 11:54",
         "html": "<p>Interesting article Ivan. Another major problem I see for EPVN, is the incompatibility between vendors, even though it is an open standard. With today&rsquo;s crazy switch delivery times, we want a multi-vendor solution like BGP or LACP, but EVPN (due to vendors) isn&rsquo;t ready for a multi-vendor production network fabric.</p>\n\n<p>Another issue with EVPN is cost in terms of price and project (delivery times). To have a robust &amp; stable solution you should start with Trident III as if you go with Tomahawk I you will need re-circulation&hellip; (I would suggest avoiding that&hellip;) and with Trident II+ you lack 100Gbps and 25Gbps&hellip; which it is the standard today. There are not many Trident III switches today in the secondhand market and a new one would take 1 year to be delivered. Without EVPN, you could obtain a Tomahawk switch for half the price and even lower latency if that nanosec difference really matters to you.</p>\n\n<p>Another problem, that vendors have been solving lately with ranges, was the kilometer long configuration in EVPN and uniqueness with the rd for each vni per switch, making the list of config even longer than in HER.</p>\n\n<p>And all these without mentioning the bugs that each vendor has when using EVPN on their switches&hellip;. Making it an unstable feature to turn on today. In the other hand, EVPN Multi-homing, on paper, solve lots of issues</p>\n",
         "id": "1375",
         "name": " Jordi",
         "pub": "2022-09-20T23:54:00",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2022/09/mlag-bridging-evpn.html"
}
