{
   "comments": [
      {
         "date": "27 September 2022 07:08",
         "html": "<p>At my last job we managed to achieve EVPN interop between Cumulus and Arista (due to different functionality not lead time) but we had to turn off Cumulus automagic and make the config more explicit. And yes, we &quot;solved&quot; the problem of generating voluminous configs using Ansible but that still leaves you open to typos. I guess that&#39;s why vendors are pushing &quot;digital twin&quot; simulations or config verification tools. Ultimately I think we need to move beyond text config files and templating but that&#39;s probably 10-20 years away for most people.</p>\n\n<p>In retrospect I wish we had just built an L2 network.</p>\n",
         "id": "1398",
         "name": "Wes Felter",
         "pub": "2022-09-27T19:08:50",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "28 September 2022 09:18",
               "html": "<p>Wonderful. Add another abstraction layer to abstract away the mess we created in the first place &#x1F923;&#x1F923;</p>\n\n<p>That&#39;s why everyone loves the networking industry and IETF &#x1F61C;</p>\n",
               "id": "1400",
               "name": " Ivan Pepelnjak",
               "pub": "2022-09-28T09:18:27",
               "ref": "1399",
               "type": "comment"
            },
            {
               "date": "28 September 2022 12:19",
               "html": "<p>I&#39;d look at it as an alternative to the in-house automation tools. While the outcome may appear similar, you do get the benefit of someone else building, testing, and supporting it.</p>\n\n<p>One could argue that this lets your ops folks to focus on more interesting things, such as helping your in-house app developers / SRE with proper network and security designs and implementations.</p>\n",
               "id": "1401",
               "name": "Dmitri Kalintsev",
               "pub": "2022-09-28T12:19:35",
               "ref": "1400",
               "type": "comment"
            },
            {
               "date": "28 September 2022 09:23",
               "html": "<p>I&#39;ve done both and Apstra is 10x better than Ansible as long as you use it properly (you have to give up a lot of ego and nerd knobs). I agree with Dmitri that you should choose one management plane and stick with it so there aren&#39;t multiple management layers.</p>\n",
               "id": "1405",
               "name": "Wes Felter",
               "pub": "2022-09-28T21:23:49",
               "ref": "1399",
               "type": "comment"
            }
         ],
         "date": "28 September 2022 03:17",
         "html": "<p>The described situation is something that Apstra was designed to address as one of its key use cases. The interop matrix is of course not any-to-any, but is hopefully comprehensive enough to be useful.</p>\n\n<p>To the best of my knowledge, all &quot;Yes&quot; intersection scenarios are tested for each of supported versions of the respective vendors&#39; NOS.</p>\n\n<p>https://www.juniper.net/documentation/us/en/software/apstra4.1/apstra-user-guide/topics/ref/feature-matrix-411.html</p>\n",
         "id": "1399",
         "name": " Dmitri Kalintsev",
         "pub": "2022-09-28T03:17:39",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2022/09/repost-evpn-viability.html"
}
