{
   "comments": [
      {
         "comments": [
            {
               "date": "07 September 2022 04:37",
               "html": "<p>Unfortunately it&#39;s not a joke. They took numerous ideas from IPX and implemented them badly.</p>\n",
               "id": "1354",
               "name": "Ivan Pepelnjak",
               "pub": "2022-09-07T16:37:17",
               "ref": "1353",
               "type": "comment"
            },
            {
               "date": "08 September 2022 07:06",
               "html": "<p>In the IPX era nobody was talking about addressing (I mean users). They were simply focused on services like file server, print server, etc.\nWhen you add to the equation the boot-rom based NIC card we could automatically load the OS do the PC.  Deployed many networks where there was no IT staff... Talking about 90-ties (beginning).\nThe simplicity was striking. Also in the approach to IPX addressing.</p>\n\n<p>Novell also introduced IP/IPX gateway around NetWare 4.11 to use single protocol (IPX) internally...</p>\n",
               "id": "1355",
               "name": "BOGDAN GOLAB",
               "pub": "2022-09-08T07:06:02",
               "ref": "1354",
               "type": "comment"
            },
            {
               "date": "14 September 2022 02:21",
               "html": "<p>So true about IPX.  I have been in networking since 1986, older Netware and Arcnet and remember the early 90s building/supporting  multi protocol networks in large enterprises.\nYou can build any size to large IPX networks with non of those pesky subnet masks and NAT etc. </p>\n\n<p>By its end IPX/SPX eventually had improvements such service discovery advertisements, improved broadcast reduction and SPX ack/flow enhancements to reduce chattiness. The issue with IPX/SPX was, for at it&#39;s time, it was a chatty, heavy protocol running on, again at its peak, 10-16mb network or 1gig Ethernet. </p>\n\n<p>Now imagine it had prevailed during the early/mid 90s protocol wars, supporting the internet and 2k and it lasted to today with us  running it on commodity 10gig copper and high speed wifi and that may be another story. </p>\n",
               "id": "1364",
               "name": "jsicuran",
               "pub": "2022-09-14T02:21:06",
               "ref": "1355",
               "type": "comment"
            }
         ],
         "date": "07 September 2022 03:32",
         "html": "<p>I always had a bad joke in the early days of IPv6, that it should be rather named IPXv2. :-)</p>\n",
         "id": "1353",
         "name": "Bela Varkonyi",
         "pub": "2022-09-07T15:32:55",
         "type": "comment"
      }
   ],
   "count": 1,
   "type": "post",
   "url": "2022/09/routers-bridges-crb-irb.html"
}
