{
   "comments": [
      {
         "comments": [
            {
               "date": "11 September 2022 05:33",
               "html": "<p>I had an interesting realization recently. For the last 4 years I have been knee deep in all things Cisco ACI. Two months ago I started working for AWS. As much as I have been an advocate of ACI, and have deployed its many useful features in mission critical environments, not using it for the last 2 months, not logging into an APIC, and dealing with the stupid complex GUI, has been feeling extremely liberating. Never say never but, I would be very happy to never log into an APIC ever again!</p>\n",
               "id": "1359",
               "name": " Salman Naqvi",
               "pub": "2022-09-11T05:33:15",
               "ref": "1358",
               "type": "comment"
            }
         ],
         "date": "10 September 2022 12:37",
         "html": "<p>When it was launched I was pretty sure that Cisco ACI was a stillbirth of a foal. Today I know.</p>\n",
         "id": "1358",
         "name": "Anonymous",
         "pub": "2022-09-10T12:37:28",
         "type": "comment"
      },
      {
         "date": "11 September 2022 09:01",
         "html": "<p>Yes, and glad, just a complex mess IMHO..  When I wanted to learn more about it back in 2014 I read the Cisco Book &quot; The Policy Driven Data Center with ACI&quot;, which was a very good book and provided deep dive details. However, it was in those details you can see the &quot;kludginess&quot; and complexity of the entire architecture. </p>\n\n<p>I had to make the call that experienced network professional make.  Let it mature and see where it goes, don&#39;t jump in and spend time on becoming an expert on something that may never be adopted.  </p>\n\n<p>For those who have been in this industry long enough understand that the most vital thing to learn and master is the ability to learn to identify what not to learn. </p>\n",
         "id": "1360",
         "name": " jsicuran",
         "pub": "2022-09-11T21:01:13",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2022/09/worth-reading-cisco-aci-dead.html"
}
