{
  "comments": [
    {
      "date": "22 September 2008 02:58",
      "html": "People typically capable of answering the <B>WHY</B> questions, are too busy out earning the big buck solving problems for the people not capable of asking the WHY questions. :)",
      "id": "1451809962683962476",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Unknown",
      "profile": "https://www.blogger.com/profile/00963478939764648991",
      "pub": "2008-09-22T02:58:00.000+02:00",
      "ref": "379652549422342452",
      "type": "comment"
    },
    {
      "date": "22 September 2008 06:28",
      "html": "Well Ivan, comapnies often send people on training and still expect them to carry out their normal duties which is unfair to the participant.<BR/><BR/><BR/>Now as to the why questions, it boils down to this. Often people such as myself want the why answers. But people who really know the why, are often too busy, a bit snobbish and protectcive of the information or take too long to respond.<BR/><BR/>I have joined several forums and have asked questions on BGP. My questions have gone unresponded to for weeks and sometimes I got no response at all. this even happens on some forums where users have paid for the product.<BR/><BR/>Lets face it, in the networking field there is a lot of information to digest. Invariably something will not be clear at first, heck even a long time after you may not get that eureka moment. <BR/><BR/>Reading technical literature will always produce questions. What are we the less experienced to do to overcome this hurdle.<BR/><BR/>I actually signed up to ask question on the Nil forums hoping that it would be better than some other forums. I will have to see how it turns out.",
      "id": "2313402971019504244",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2008-09-22T06:28:00.000+02:00",
      "ref": "379652549422342452",
      "type": "comment"
    },
    {
      "date": "23 September 2008 22:46",
      "html": "Hi Roger!<BR/><BR/>I can't see your question on our forum. Did you have any problems with the software? You could use <A HREF=\"http://www.zaplana.net/forms/ENsendmsg.asp\" REL=\"nofollow\">this form</A> to send me a direct message.",
      "id": "2344767093176999944",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Ivan Pepelnjak",
      "profile": "https://www.blogger.com/profile/13457151406311272386",
      "pub": "2008-09-23T22:46:00.000+02:00",
      "ref": "379652549422342452",
      "type": "comment"
    }
  ],
  "count": 3,
  "id": "379652549422342452",
  "type": "post",
  "url": "2008/09/knowledge-or-recipes.html"
}