{
   "comments": [
      {
         "date": "15 June 2022 06:48",
         "html": "<p>Any chance the DC landscape of 2014 could have influenced their recommendations?</p>\n\n<p>I think they still had two competing L2 fabric solutions (QFabric and VCF), and VXLAN was either CRB or mcast flood and learn.</p>\n\n<p>Unsure if these would justify their position at the time, that and the fact that they didn&#39;t have a Jericho platform until 2021?</p>\n",
         "id": "1299",
         "name": " Time traveler",
         "pub": "2022-06-15T18:48:13",
         "type": "comment"
      },
      {
         "date": "15 June 2022 07:13",
         "html": "IIRC: Juniper was late to market with newer-generation Trident leaf switches that had VXLAN RIOT support, so they were trying to push centralized VXLAN-to-VXLAN routing on spine switches, and that could only be done (in those days) on QFX10K.<br />\n\n<p>I would be acceptable if they would have written &quot;use QFX10K as spine switches to get VXLAN routing, because Broadcom didn&#39;t implement it in Tomahawk ASIC&quot;. Still bending the truth by omission (because VXLAN routing did work in newer Trident ASICs), but it wouldn&#39;t be plain wrong like their buffering argument.</p>\n",
         "id": "1301",
         "name": " Ivan Pepelnjak",
         "pub": "2022-06-15T19:13:19",
         "type": "comment"
      },
      {
         "date": "15 June 2022 08:57",
         "html": "<p>Ivan - Thanks for bringing that ancient white paper to our attention. The strange thing is the link goes to the pre-staging area for stuff before we take it live to our site. The WP definitely was not on our public website. But surprised that you were able to get through the link. Anyway, we just took it down. Sorry for any confusion. BTW, our DC portfolio kinda kicks ass now with Apstra running DF fabric automation &amp; mgmt. We&#39;re getting a ton of great customer feedback.</p>\n",
         "id": "1302",
         "name": "Ben Baker",
         "pub": "2022-06-15T20:57:13",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2022/06/beware-vendors-bringing-whitepapers.html"
}
