{
   "comments": [
      {
         "date": "09 July 2022 01:34",
         "html": "<p>The best and the most concise Switch selection strategy I&#39;ve ever seen.</p>\n",
         "id": "1330",
         "name": " Dovydas",
         "pub": "2022-07-09T13:34:55",
         "type": "comment"
      },
      {
         "date": "25 November 2024 08:46",
         "html": "<p>Great insights on selecting the best switching ASIC for data center fabrics! The explanation of leaf-and-spine architecture and the specific roles of spine and leaf switches is very informative. I appreciate the detailed breakdown of how Broadcom&#39;s Tomahawk and Trident series fit into different parts of the network and the considerations around buffer sizes and forwarding tables. The practical tips on handling incast traffic and the scenarios where deep buffer switches are necessary are particularly useful. This post is a valuable resource for anyone looking to optimize their data center network design (). Thanks for sharing! https://serverorbit.com/network-devices/</p>\n",
         "id": "2464",
         "name": " Jack Hicks",
         "pub": "2024-11-25T08:46:13",
         "type": "comment"
      },
      {
         "date": "25 November 2024 08:53",
         "html": "<p>Great insights on selecting the best switching ASIC for data center fabrics! The explanation of leaf-and-spine architecture and the specific roles of spine and leaf switches is very informative. I appreciate the detailed breakdown of how Broadcom&#39;s Tomahawk and Trident series fit into different parts of the network and the considerations around buffer sizes and forwarding tables. The practical tips on handling incast traffic and the scenarios where deep buffer switches are necessary are particularly useful. This post is a valuable resource for anyone looking to optimize their data center network design Server Orbit. Thanks for sharing!</p>\n\n<p><a href=\"https://serverorbit.com/network-devices/\">Network Devices</a></p>\n",
         "id": "2466",
         "name": " kingangle1111",
         "pub": "2024-11-25T08:53:24",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2022/06/select-data-center-switching-asic.html"
}
