{
   "comments": [
      {
         "comments": [
            {
               "date": "23 June 2022 08:28",
               "html": "<p>&quot;I&#39;ve never saw a multi-site EVPN VXLAN implementation in production. IMO it&#39;s too complex and cumbersome.&quot;</p>\n\n<p>If your deployment doesn&#39;t exceed the hardware limitations, and the amount of flooding is reasonable, then I totally agree with you.</p>\n\n<p>OTOH, ingress replication can become a nice amplification mechanism chewing up WAN bandwidth... of course only after you get into a broadcast storm.</p>\n",
               "id": "1315",
               "name": "Ivan Pepelnjak",
               "pub": "2022-06-23T08:28:32",
               "ref": "1312",
               "type": "comment"
            }
         ],
         "date": "22 June 2022 06:52",
         "html": "<p>First diagram is missing a link between WAN edge switch and LAN peer on the right. I find it more accurate to draw two WAN edge switches per data center for the sake of redundancy (resulting in at least two WAN connections) as there are already two LAN peers per data center in the diagram. <br />\nI&#39;ve never saw a multi-site EVPN VXLAN implementation in production. IMO it&#39;s too complex and cumbersome. I only saw multi-pod implementations for multiple data centers even for larger deployments which ran just fine.</p>\n",
         "id": "1312",
         "name": "Anonymous",
         "pub": "2022-06-22T18:52:08",
         "type": "comment"
      },
      {
         "date": "05 October 2022 04:04",
         "html": "<p>Hi Ivan,</p>\n\n<p>If I understand correctly, cisco multisite evpn uses draft-Sharma-bess-multisite which Lukas Krattiger Co author, while others (juniper Nokia arista) uses rfc 9014. According to draft-Sharma it is compatible with rfc 9014. But myself haven&#39;t tried it. Do you know whether it&#39;s compatible? I am also not familiar with the differences between the two.. </p>\n",
         "id": "1425",
         "name": " Samuel",
         "pub": "2022-10-05T16:04:02",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2022/06/vxlan-bridging-dci.html"
}
