{
   "comments": [
      {
         "comments": [
            {
               "date": "03 December 2021 09:49",
               "html": "<p>We&#39;ll do that in a Design Clinic. Internet-in-a-VRF is already on the list of topics.</p>\n",
               "id": "898",
               "name": "Ivan Pepelnjak",
               "pub": "2021-12-03T09:49:33",
               "ref": "897",
               "type": "comment"
            }
         ],
         "date": "02 December 2021 02:19",
         "html": "<p>It would be great to continue with your considerations about BGP add-path vs Internet in VRF.</p>\n",
         "id": "897",
         "name": "Alexander Grigorenko",
         "pub": "2021-12-02T14:19:09",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "05 December 2021 05:06",
               "html": "<p>As always, it depends... this time on what the BGP implementation in your route reflector can do. Vendor documentation would be the place to check ;)</p>\n\n<p>Obviously I have no idea what you&#39;re trying to do, and maybe Optimum Route Reflection (ORR) would be exactly what you need. If not, you could always try to filter outgoing BGP updates with a route map (or equivalent) -- get all the paths into the RR RIB, tell RR to advertise all of them to all clients, and then filter the updates (assuming it works -- see above).</p>\n\n<p>However, based on the complexity of what we&#39;re discussing, I strongly suspect it might be a good idea to go back to the drawing board and adapt the design.</p>\n",
               "id": "907",
               "name": "Ivan Pepelnjak",
               "pub": "2021-12-05T17:06:36",
               "ref": "906",
               "type": "comment"
            }
         ],
         "date": "05 December 2021 04:47",
         "html": "<p>Hi Ivan,\nfor a setup I designed at work, I&lsquo;d like to know, if a route reflector can have multiple path for a route (default route in our network) and decide, which of them to advertise to a group of neighbors?\nThanks!</p>\n",
         "id": "906",
         "name": " Alexander Hartmaier",
         "pub": "2021-12-05T16:47:57",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2021/12/bgp-multipath-addpath.html"
}
