{
   "comments": [
      {
         "date": "13 December 2021 09:10",
         "html": "<p>Another approach could be adding and running a script that clones a git repo where you store your data. Obviously this is not beneficial during development (every change had to be commited/pushed) but works well when the container is part of a CI/CD pipeline.</p>\n",
         "id": "941",
         "name": " Andras Dosztal",
         "pub": "2021-12-13T09:10:46",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "13 December 2021 08:09",
               "html": "<p>&quot;You are throwing the kitchen sink into what should probably be a VM&quot; &lt;&lt; Sure, I have another recipe somewhere to build a Ubuntu VM with Vagrant, or you could use almost the same recipe.</p>\n\n<p>Some people are OK with VMs. I use them because I had to set up Vagrant/Virtualbox on my Mac anyway, so why bother with Docker. Other people prefer containers. There is no right answer.</p>\n\n<p>&quot;...simply stating that not everyone on DockerHub is a saint&quot; &lt;&lt; Agreed. You know how you can easily get around that? Build your own container after vetting the build recipe you got off the Internet. That&#39;s why my build recipes (Dockerfiles) are on GitHub.</p>\n",
               "id": "945",
               "name": "Ivan Pepelnjak",
               "pub": "2021-12-13T20:09:45",
               "ref": "944",
               "type": "comment"
            }
         ],
         "date": "13 December 2021 03:09",
         "html": "<p>&quot;Containers seem to be an an answer to every challenge one might have these days&quot;.  Yes, and unfortunately this post is case-in-point.  You are throwing the kitchen sink into what should probably be a VM.  Mounting your home directory in read-write mode into a container is a fantastic recipe for a really bad headache.  How do I know your container isn&#39;t going to post my SSH keys to PasteBin after I start it up?  I&#39;m not making an accusation; simply stating that not everyone on DockerHub is a saint.  Convenience often comes at the price of security, and that is a dangerous tradeoff these days.</p>\n",
         "id": "944",
         "name": "Daniel Justice ",
         "pub": "2021-12-13T15:09:08",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2021/12/network-automation-container.html"
}
