{
   "comments": [
      {
         "comments": [
            {
               "date": "25 July 2024 11:50",
               "html": "<p>I always claim it&#39;s a solution in search of a problem unless you happen to be a vendor desperate to sell expensive new ASICs, in which case it&#39;s manna from heaven ;)</p>\n",
               "id": "2342",
               "name": "Ivan Pepelnjak",
               "pub": "2024-07-25T11:50:52",
               "ref": "2340",
               "type": "comment"
            }
         ],
         "date": "25 July 2024 10:12",
         "html": "<p>What&#39;s the point of SRv6? To me it&#39;s like those esoteric Linux distributions - yes, you can make them work, but why? I use Arch BTW.</p>\n",
         "id": "2340",
         "name": " Dmytro Shypovalov",
         "pub": "2024-07-25T10:12:19",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "25 July 2024 12:45",
               "html": "<p>&gt; What&#39;s the point of SRv6?</p>\n\n<p>Firstly, I&#39;m not speaking for my employer here. I have hardly worked yet on SRv6 myself. My team-mates do that. I focus on other stuff for now.</p>\n\n<p>There are several benefits of SRv6 that I&#39;ve heard of.</p>\n\n<p>1) You&#39;ll have one address space for addresses and labels. Some people like that.</p>\n\n<p>2) You have network programmability inside your SIDs. You can do stuff like NFV, etc. I have no idea how many networks really use this.</p>\n\n<p>3) You can have non-SRv6 speakers in your SRv6 network. As the destination-addresses, which are SIDs/locators, are still just IPv6-addresses, any router that does IPv6 but not SRv6, can still be deployed in your SRv6 network.</p>\n\n<p>Personally I don&#39;t care about that reason. I really dislike it when a nice clean new technology gets mucked up, just so it is a bit easier to migrate an existing network. The migrations will finished within a few years. And then you have those ugly details and hacks remaining for the next 3 decades.</p>\n\n<p>4) You can summarize locators.</p>\n\n<p>This is the big benefit in my eyes. We know how to build a network with a 1000 or so routers, in one IGP domain. But once we go bigger, things are not trivial anymore. We can use BGP to glue parts of the network together. We can divide an IGP into areas. But that causes other problems or inefficiencies. E.g. if you do SR-MPLS, what MPLS labels are your L1L2 routers gonna advertise? They&#39;ll need to advertise all MPLS labels for all the loopbacks in the L1 area. And the other way around (L2-&gt;L1) is even worse (even more loopbacks). We can not (really) summarize MPLS labels in the control plane. And we sure as hell can not summarize MPLS labels in the dataplane.</p>\n\n<p>With SRv6, this problem is solved. The L1L2 routers can summarize not only the regular prefixes in the area, but also the locators, the flex-algo locators, etc. The only remaining problem is when BGP-speakers expect to see /32s (or /128s) for every peer they talk to. There are no elegant solutions for this yet, so it would be the next problem to fix.</p>\n\n<p>You probably don&#39;t care about summarizable locators, or networks with 10k+ routers. But in the end: &quot;the only problem is scalability&quot;. (I though that was a quote from Randy Bush. But Google can&#39;t find it. So not sure). My big interest in my career has been scalability in routing protocols. (And performance, robustness and convergence, as they are all closely related). So I like it when SRv6 locators can be summarized.</p>\n\n<p>Or maybe someone with a lot of cash to spend on new routers can ask their supplier for summarizable MPLS labels? :) In today&#39;s companies, nobody will listen to a simple engineer as myself. But if a large ISP or hyperscaler, with a fat wallet, asks for something, that could make a difference. :) But then, nobody asked for summarizable MPLS labels during the last 25 years, so I expect nobody will any time soon.</p>\n",
               "id": "2343",
               "name": "Henk",
               "pub": "2024-07-25T12:45:13",
               "ref": "2341",
               "type": "comment"
            },
            {
               "date": "25 July 2024 07:40",
               "html": "<p>I don&#39;t really understand the first 2 arguments, how is that different from SR-MPLS?</p>\n\n<p>The summarization argument is interesting. This obviously is applicable only to hierarchical designs, with multiple IGP domains. So with appropriate addressing of locators, you can advertise only a summary route to other domains.</p>\n\n<p>My question is whether there are ASICs that support longest prefix match for SRv6 locators? LPM is more complicated and expensive than exact match, and now this has to be implemented for a new encapsulation. And how is this done, I presume recirculation similar to what happens in L3VPN with per-VRF label? I haven&#39;t worked with SRv6 but very curious to look at hardware limitations and caveats. What I know for sure is that SID depth for SRv6 is typically much lower than for SR-MPLS, which limits traffic engineering capabilities.</p>\n\n<p>Also, while SR-MPLS strictly speaking doesn&#39;t have summarization, you can use IS-IS area proxy and advertise only area segment into L2, so routers won&#39;t receive L1 routes/SID. This will save FIB space. The downside is that controller will be required to reach routers inside L1, so it&#39;s not the most robust design, but allows to do &quot;sort of&quot; summarization with SR-MPLS.</p>\n",
               "id": "2344",
               "name": "Dmytro Shypovalov",
               "pub": "2024-07-25T19:40:07",
               "ref": "2343",
               "type": "comment"
            }
         ],
         "date": "25 July 2024 11:18",
         "html": "<p>The reason of L2VPN is becoming more popular by service providers and customers is about provisioning complexity.</p>\n\n<p>With an L3VPN usually you have to spend weeks on agreeing configuration details with your service provider. This process is very difficult to automate.\nWith an L2VPN you just have to accept a few parameters and you can connect immediately. Even you can have a Network-as-a-Service style. The only disadvantage is to install your own edge routers to separate the service provider section from your private section.</p>\n\n<p>By the way, this is where private LISP could be an easy to use alternative to private MPLS for your private WAN on top of L2VPN telco services. :-)</p>\n\n<p>L2VPNs can be also automatically provisioned through a number of different service provider sections. L3VPNs are more difficult to manage over multiple service provider sections. It is doable, but not easy to automate.</p>\n\n<p>The Metro Ethernet Forum has tons of specifications on the different VPN services. There you can see clearly the difference.</p>\n",
         "id": "2341",
         "name": "Bela Varkonyi",
         "pub": "2024-07-25T11:18:58",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2024/07/bgp-evpn-vxlan-srv6.html"
}
