{
   "comments": [
      {
         "date": "11 June 2020 05:22",
         "html": "<p>A question I keep tasking myself with addressing but never finding the best answer, is how appropriate is it to reform a network environment into a flattened design such as spine-and-leaf, if that reform is with the sole intent and purpose to enable automation? And at what cost to my own skills as a network engineer as I move further and further from the path of needing to understand and appreciate protocols and functionality when &quot;the code simply handles it&quot;.</p>\n\n<p>IaC is the future. It is unavoidable. But the question I constantly contend with is at what cost, and at what point will my skill set as a network engineer/architect become irrelevant at the negotiating table for a new job or a raise request? Particularly when they can relabel our roles by the promise of SD* and map us against the pay scale for developers once their non-complex spine-and-leaf topology goes live with only BGP and thousands of leaf switches merely needing the concept of overlay networking to be maintained in code.</p>\n\n<p>It&#39;s coming, it&#39;s unstoppable, but it&#39;s scary. Alongside conforming with the progression, how do I stop being scared of the implied threat?</p>\n",
         "id": "73",
         "name": "Adam",
         "pub": "2020-06-11T05:22:12",
         "type": "comment"
      },
      {
         "date": "11 June 2020 06:49",
         "html": "<p>Great set of questions/considerations, thank you! I see another blog post coming... ;)</p>\n",
         "id": "74",
         "name": "Ivan Pepelnjak",
         "pub": "2020-06-11T06:49:56",
         "type": "comment"
      },
      {
         "date": "30 June 2020 02:02",
         "html": "<p>Looking forward for this new blog post... Adam questions are very relevant right now :)\nThanks!</p>\n",
         "id": "86",
         "name": "josep",
         "pub": "2020-06-30T14:02:06",
         "type": "comment"
      },
      {
         "date": "01 July 2020 12:59",
         "html": "<p><a href=\"https://blog.ipspace.net/2020/06/adapting-network-design-for-automation.html\">Adapting network design to support automation</a></p>\n",
         "id": "88",
         "name": "Ivan Pepelnjak",
         "pub": "2020-07-01T12:59:23",
         "type": "comment"
      }
   ],
   "count": 4,
   "type": "post",
   "url": "2020/06/network-architects-facing-automation.html"
}
