{
   "comments": [
      {
         "comments": [
            {
               "date": "05 April 2025 12:20",
               "html": "<p>It would be nice to talk about real life engineering job in the average enterprise.</p>\n\n<p>Fundamentals matter. Focusing on details. Be organized not chaotic. Change tracking is crucial. </p>\n\n<p>Preparing regression tests once you upgrade any piece of software on any device (almost every security driven upgrade breaks something). </p>\n\n<p>Spending months(!) with a vendor TAC engineers who keeps saying &quot;it works as designed&quot; and trying you persuade that you need &quot;new feature request&quot; to fix an obvious bug...</p>\n\n<p>Troubleshooting skills really matter - here fundamentals will pay off.</p>\n\n<p>Preparing device templates for guys who automate the network - not sure if average network engineer should be a the same time a developer. A network Engineer should deliver working device template configuration  - let&#39;s leave the automation (data model +) to competent people.</p>\n\n<p>Doing PoC whenever you want to add any even simplest feature to see what will be affected and why...</p>\n\n<p>Talking to business guys to clarify that &quot;it is not so simple...&quot;</p>\n\n<p>Be hardworking. Be humble. A lot of soft skills really help...</p>\n\n<p>Certifications? Certifications will do not replace good engineering education I think. And experience. I believe certifications serve rather vendor goals...\nI do not care about certs when hiring people. Rather experience is important. I am looking for people who have right attitude (hardworking, smart, etc) not just having all kind of certs.</p>\n\n<p>Etc, etc.</p>\n",
               "id": "2596",
               "name": "BOGDAN GOLAB",
               "pub": "2025-04-05T12:20:45",
               "ref": "2595",
               "type": "comment"
            },
            {
               "date": "06 April 2025 07:35",
               "html": "<p>&quot;Fundamentals matter. Focusing on details. Be organized not chaotic. Change tracking is crucial.\nTroubleshooting skills really matter - here fundamentals will pay off.&quot; - no disagreement at all, obviously.</p>\n",
               "id": "2597",
               "name": " Jakub ",
               "pub": "2025-04-06T07:35:14",
               "ref": "2596",
               "type": "comment"
            }
         ],
         "date": "05 April 2025 08:29",
         "html": "<p>That&#39;s all fine, but it looks like an advice to the person that aims at working in 500 top companies. Average enterprise? Skip the automation, CCNP is fine, add Azure and AWS cert too and You&#39;re really ok. Probably some firewall vendor cert would also benefit, but in terms of knowledge they&#39;re like forklift permission, not more.\nToo cynical, maybe, but not much.</p>\n",
         "id": "2595",
         "name": " Jakub",
         "pub": "2025-04-05T08:29:05",
         "type": "comment"
      }
   ],
   "count": 1,
   "type": "post",
   "url": "2025/04/transition-into-networking.html"
}
