{
   "comments": [
      {
         "date": "29 October 2025 01:16",
         "html": "<p>Hi Ivan,</p>\n\n<p>Appreciate your warm, thoughtful, and, of course, justifiably snarky comments. I&rsquo;ll make sure the IOS-XE documentation team not only fixes this but also other issues in that document that are clearly below the standard we should strive for.   </p>\n\n<p>As a side note, I&rsquo;d love to see you again at one of the upcoming PLNOG conferences. We&rsquo;ve met a couple of times long, long ago - including that time in Krakow when even Greg Ferro himself decided to come down to Poland to visit NOG :)</p>\n\n<p>Best regards to You and Dear Readers!</p>\n",
         "id": "2783",
         "name": " Lukasz Bromirski",
         "pub": "2025-10-29T01:16:01",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "01 November 2025 06:14",
               "html": "<p>I&#39;m not aware of anyone implementing RFC 7503, and a quick search did not turn up anything, but thanks a million for the pointer!</p>\n\n<p>Also, the way that RFC is written, any router can temporarily kick any other router off the network (= disrupt all its adjacencies and traffic forwarding) just by claiming the same Router ID and better hardware fingerprint. Wonderful DoS attack vector if you manage to connect to the OSPF domain (but then, once you&#39;re connected to an OSPF domain, you could insert all sorts of weird things as LSAs anyway).</p>\n",
               "id": "2791",
               "name": " Ivan Pepelnjak",
               "pub": "2025-11-01T18:14:46",
               "ref": "2788",
               "type": "comment"
            }
         ],
         "date": "01 November 2025 08:55",
         "html": "<p>Well, there&#39;s an RFC 7503 about OSPFv3 autoconfiguration which deals, among other things, with router ID selection and conflicts resolution. I&#39;ve no idea if anyone in the world has implemented this, but technology do exists.</p>\n",
         "id": "2788",
         "name": " Yakov Sh.",
         "pub": "2025-11-01T08:55:49",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2025/10/ospf-automatic-router-id.html"
}
