{
  "comments": [
    {
      "comments": [
        {
          "date": "27 March 2013 14:19",
          "html": "http://imgs.xkcd.com/comics/standards.png",
          "id": "4246430949915193874",
          "image": "https://resources.blogblog.com/img/blank.gif",
          "name": "Anonymous",
          "profile": null,
          "pub": "2013-03-27T14:19:18.295+01:00",
          "ref": "587130069506375919",
          "type": "comment"
        }
      ],
      "date": "27 March 2013 13:47",
      "html": "I always learned that a design is finished, not when you can not add anything anymore. No. It is finished when you can not remove anything anymore.<br /><br />When I look at current network technologies, I see an unbelievable huge mess. I understand how it works. And why it has evolved the way it has. But still, it&#39;s a huge mess.<br /><br />Someone should design a whole new network architecture. One that scales. One that has all required features like mobility, multi-homing, automatic addressing, etc. Just layer-2 and layer-3. Just make sure that the thing looks the same to EndSystems, as IPv4 looks today.<br /><br />You could even go one step further.<br />IPv6 is still not deployed. Not really.<br />Why not make some changes to IPv6 ? Small changes on EndSystems. And huge changes to IPv6 on routers. Then we can throw away 90% of the complexity of current systems. Make this new protocol compatible with v4 through a workable NAT-technology. And then there might be a reason to migrate away from v4.<br /><br />One can dream.",
      "id": "587130069506375919",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2013-03-27T13:47:08.474+01:00",
      "ref": "2428199226622440495",
      "type": "comment"
    },
    {
      "date": "03 April 2013 19:48",
      "html": "Guess what Gollum is saying...<br /><br />...give up?<br /><br />He is saying, &quot;Martin Casadohhhh...&quot;<br /><br />Fortunately for me, I get to see that exact sequence of expressions from one or two colleagues who in their innocence    have turned into networking Gollums, repeatedly cycling through these emotions: hopeful, confused, painful, hopefully confused, painfully hopefully confused; waiting for that all too powerful ARP and broadcast controller that would sit at the center of the univers--to rule all networks.",
      "id": "5910408622789866494",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2013-04-03T19:48:56.862+02:00",
      "ref": "2428199226622440495",
      "type": "comment"
    }
  ],
  "count": 3,
  "id": "2428199226622440495",
  "type": "post",
  "url": "2013/03/trying-to-debug-overlay-network-sdn.html"
}