{
  "comments": [
    {
      "date": "23 October 2010 00:44",
      "html": "Oh yes, now for the comment! Firstly to answer your question - summarization will hide the next-hop address and prevent phase 2 from creating spoke-to-spoke tunnels, as this functionality requires CEF adjacency to have the next-hop IP of the other spoke. Phase 2 was merely a crude hack to get NHRP working with CEF :)<br /><br />Next, for the thoughts I have. Summarizing routes with EIGRP in Phase 2 deployments does not significantly improve scalability if the spokes support EIGRP stub feature. Indeed, the main problem with EIGRP scalability is query scoping, which is effectively implemented using the stub feature. Being distance-vector, EIGRP is not very sensitive to topology change events in hub &amp; spoke networks - incremental updates handle this smoothly. Unlike link-state protocols, EIGRP routing for Phase 2 may handle large hub and spoke topologies better. Of course, for large deployments, BGP could be a better option anyways.<br /><br />To finish with, I would like to recall my favorite RFC 1925, truth #11. Back in 2003 DMVPN was proclaimed as uniquely new solution that, however, was built upon the technology used for CLIP optimization back in 90s! And it took Cisco forever to finally stabilize and come with Phase 3. Seriously, shame on them :)",
      "id": "2825649684718204814",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2010-10-23T00:44:04.000+02:00",
      "ref": "1090020823508700556",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "12 March 2013 09:17",
          "html": "Auto-summarization could generate all sorts of interesting side effects, so I disable it by default. Other than that, using summarization on spokes is fine - you shall not use it on the hub router (Phase 2 DMVPN only).",
          "id": "3389196751307295638",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2013-03-12T09:17:50.590+01:00",
          "ref": "3023150631393566789",
          "type": "comment"
        }
      ],
      "date": "11 March 2013 21:56",
      "html": "Hello. What would be the problem with having the spokes summarize their networks in phase 2? Won&#39;t the hubs re-advertise this summary to the rest of the spokes?",
      "id": "3023150631393566789",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2013-03-11T21:56:47.225+01:00",
      "ref": "1090020823508700556",
      "type": "comment"
    }
  ],
  "count": 3,
  "id": "1090020823508700556",
  "type": "post",
  "url": "2010/10/eigrp-summarization-in-dmvpn-phase-2.html"
}