{
   "comments": [
      {
         "comments": [
            {
               "date": "09 February 2023 01:59",
               "html": "<p>I recall 1999/2000 a major client in financial/insurance industry. They were in the middle of managing Token-Ring/Ethernet/FDDI and some ATM landscape.   We spent two years on a major vendor&rsquo;s Token Ring Switching solution for a 30 floor building. I was in the weeds on that one and still have some detailed diagrams on the &ldquo;mechanics&rdquo; of it. Nonetheless, the vendor&rsquo;s solution was a flop(bugs,  interoperable issues, etc)and they took the whole thing back, every switch, and we went full Ethernet switching after that point.</p>\n",
               "id": "1654",
               "name": "jsicuran",
               "pub": "2023-02-09T01:59:55",
               "ref": "1651",
               "type": "comment"
            },
            {
               "date": "09 February 2023 04:14",
               "html": "<p>Now that you mention it, ages ago we were &quot;blessed&quot; with an installation where the customer wanted to have ATM LANE (because &quot;ATM is the future&quot;) on Catalyst 3000 (or whatever the Kalpana switch was rebranded to) because that was the only Cisco switch that was price-competitive against 3Com.</p>\n\n<p>It was a colossal failure resulting in all switches being RMA-ed for Catalyst 5000s. At least Cisco owned the FUBAR and did everything they could to make the network work for the customer.</p>\n",
               "id": "1658",
               "name": "Ivan Pepelnjak",
               "pub": "2023-02-09T16:14:06",
               "ref": "1654",
               "type": "comment"
            }
         ],
         "date": "08 February 2023 10:49",
         "html": "<p>I have experienced a case where an enterprise network department returned the new networking devices from a well known and respected vendor, and bought gear from a different vendor.  Sadly I do not know more details, i.e., how bad it really was, but it must have been devastatingly bad, from the problems I often see accepted in networking gear by the networking departments. (Sorry, I am not in a position to name names regarding this.)</p>\n",
         "id": "1651",
         "name": "Erik Auerswald",
         "pub": "2023-02-08T10:49:52",
         "type": "comment"
      }
   ],
   "count": 1,
   "type": "post",
   "url": "2023/02/nothing-works-enterprise-it.html"
}
