{
   "comments": [
      {
         "comments": [
            {
               "date": "23 February 2023 08:43",
               "html": "<p>... because their marketing departments still live in 1990s.</p>\n\n<p>No idea how well Nokia SR Linux works, but they got the memo (and read it). You can download the container from a container registry and run it, and if you need help getting started use <em>netlab</em> (https://netsim-tools.readthedocs.io/en/latest/labs/clab.html)</p>\n",
               "id": "1679",
               "name": "Ivan Pepelnjak",
               "pub": "2023-02-23T08:43:59",
               "ref": "1677",
               "type": "comment"
            }
         ],
         "date": "23 February 2023 02:52",
         "html": "<p>Why do vendors still try to gatekeeper their software so much? I still remember in the early 2000s that we were all expecting Juniper to be liberator of the industry with their BSD related JunOS. Finally something you could somewhat explain to workings to a sysadmin. </p>\n\n<p>Anyway, I would be interested how Nokia&rsquo;s SR Linux stacks up. They&rsquo;ve been making quite some buzz lately. Also interested if there is a difference configure with Ansible through SSH or via YANG.</p>\n",
         "id": "1677",
         "name": " Pvh ",
         "pub": "2023-02-23T02:52:50",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "25 February 2023 01:25",
               "html": "<p>&quot;Not that the exercise make any sense to me in general, this is kind of fake data science, which got the field bad reputation&quot;</p>\n\n<p>You don&#39;t care about boot times, I do. That&#39;s perfectly OK, you could stop reading right there ;)</p>\n\n<p>&quot;but I wonder why you choose vSRX, which is fully fledged security appliance, to compete against routers and switches&quot;</p>\n\n<p>Because it&#39;s the only Junos box one can download from their web site (assuming one&#39;s account eventually works, which is a totally different story) and run without having to figure out the plumbing between control-plane and data-plane VMs or how to start a VM with multiple disks in Vagrant.</p>\n\n<p>As I wrote, please feel free to repeat the tests with vMX, vQFX, and some other VM (to establish the baseline) and post the results.</p>\n",
               "id": "1682",
               "name": "Ivan Pepelnjak",
               "pub": "2023-02-25T13:25:55",
               "ref": "1681",
               "type": "comment"
            }
         ],
         "date": "25 February 2023 01:19",
         "html": "<p>Not that the exercise make any sense to me in general, this is kind of fake data science, which got the field bad reputation,but I wonder why you choose vSRX, which is fully fledged security appliance, to compete against routers and switches?</p>\n",
         "id": "1681",
         "name": "Alexey Popov",
         "pub": "2023-02-25T13:19:19",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2023/02/virtual-device-boot-times.html"
}
