{
   "comments": [
      {
         "date": "05 May 2021 04:48",
         "html": "<p>Enjoyed, thank you Ivan.</p>\n",
         "id": "560",
         "name": " Jeffrey",
         "pub": "2021-05-05T16:48:49",
         "type": "comment"
      },
      {
         "date": "05 May 2021 05:25",
         "html": "<p>Yes, I think you need interface addresses (on network-layer) for troubleshooting and monitoring purposes. Or you want to use something along OAM?</p>\n",
         "id": "561",
         "name": "Anonymous",
         "pub": "2021-05-05T17:25:39",
         "type": "comment"
      },
      {
         "date": "05 May 2021 07:01",
         "html": "<p>@Anonymous: and we&#39;re back to the discussion we had more than five years ago:</p>\n\n<p>https://blog.ipspace.net/2016/01/are-unnumbered-interfaces-harmful.html</p>\n\n<p>I wonder why we can&#39;t ever agree on something and move on.</p>\n",
         "id": "562",
         "name": "Ivan Pepelnjak",
         "pub": "2021-05-05T19:01:58",
         "type": "comment"
      },
      {
         "date": "05 May 2021 07:59",
         "html": "<p>Until now I never came into a situation where there was full agreement from people on a subject. Good example is that recent horrific pandemic.\nBut I agree with you on this: &quot;Speaking of traceroute: it might give you wrong interface information any time you happen to have asymmetrical routing or multiple equal-cost paths.&quot;\nDon&#39;t get me wrong, I&#39;ve nothing against unnumbered interfaces. For me they make sense in particular environments. But why shouldn&#39;t there be no drawbacks with unnumbered interfaces?</p>\n",
         "id": "563",
         "name": "Anonymous",
         "pub": "2021-05-05T19:59:54",
         "type": "comment"
      },
      {
         "date": "06 May 2021 05:16",
         "html": "<p>@Anonymous:</p>\n\n<p>&gt; But why shouldn&#39;t there be no drawbacks with unnumbered interfaces?</p>\n\n<p>I&#39;m not saying there are no drawbacks. Everything has drawbacks... or you haven&#39;t looked hard enough. It&#39;s just that I keep getting the same &quot;monitoring and troubleshooting&quot; arguments, even though they weren&#39;t exactly valid for years if not decades.</p>\n",
         "id": "564",
         "name": "Ivan Pepelnjak",
         "pub": "2021-05-06T17:16:59",
         "type": "comment"
      },
      {
         "date": "07 May 2021 01:38",
         "html": "<p>Although having IP per interface still makes a lot of sense, so we have a control over how the traffic reaches the node, especially if have different speed/latency links and want to use some specific one (BGP over unnumbered interfaces is a wonder, but adds some complexity that this is not always welcome).</p>\n",
         "id": "565",
         "name": "Michał Margula",
         "pub": "2021-05-07T13:38:44",
         "type": "comment"
      }
   ],
   "count": 6,
   "type": "post",
   "url": "2021/05/fundamentals-need-interface-addresses.html"
}
