{
   "comments": [
      {
         "date": "01 June 2021 11:24",
         "html": "<p>another gem Ivan - thanks. </p>\n\n<p>I just wanted to add a bit of my personal experience on the OSPFoGRE subject:  </p>\n\n<p>On a certain OS version of a popular router platform (I believe it&#39;s fixed on newer OS versions now but ...still... it&#39;s representative of what can happen on any platform), the following happens:    </p>\n\n<p>If the &#39;encaps&#39; dst IP address of the GRE tunnel is known in BGP then you need to override that with a static route in order for any OSPF packet to enter the tunnel. You don&#39;t need the static route if the OSPF packets are fragmented. </p>\n\n<p>The reason for this exotic working recipe should be (as we never really got a final answer) that:  </p>\n\n<ul>\n<li><p>The OSPF packets are generated by the OSPF process on the central CPU and it cannot do a BGP lookup since it&#39;s a recursive one</p></li>\n<li><p>if you induce fragmentation then it all works .... as I guess an OSPF packet that is too big can access an area of the processing or of a chipset that is provided with the ability to do recursive lookups as well as fragmentation.  </p></li>\n</ul>\n\n<p>Cheers/Ciao <br />\nAndrea  </p>\n",
         "id": "619",
         "name": "Andrea Di Donato",
         "pub": "2021-06-01T11:24:30",
         "type": "comment"
      },
      {
         "date": "01 June 2021 02:06",
         "html": "<p>@Andrea: I would suspect the decision to ignore BGP routes when originating OSPF packets probably comes from someone&#39;s attempts to detect and alleviate recursive routing loops (tunnel endpoint being available over the tunnel scenarios). Fragments follow the regular packet forwarding structures.</p>\n\n<p>Obviously it would help if the behavior was documented/explained.</p>\n",
         "id": "620",
         "name": "Ivan Pepelnjak",
         "pub": "2021-06-01T14:06:20",
         "type": "comment"
      },
      {
         "date": "02 June 2021 07:37",
         "html": "<p>Hello Ivan,   </p>\n\n<p>Sorry, yeah, of course - I&#39;ll share a bit more details:   </p>\n\n<p>The layout was the following:   </p>\n\n<p>CE ------------------- PE ------------------------P <br />\n&lt;-----Connected-----&gt;&lt;----OSPF + iBGP-----&gt; <br />\n&lt;-----------------OSPFoGRE--------------------&gt;     </p>\n\n<p>There&#39;s a whole network between PE and P.\nThe router with the issue was router P. \nThe CE&#39;s end of the GRE tunnel was redistributed as connected into iBGP and thus received this way by router P.  </p>\n\n<p>The issue was in version X and was fixed from version Y &gt; X    </p>\n\n<p>Cheers/Ciao <br />\nAndrea   </p>\n",
         "id": "630",
         "name": "Andrea Di Donato",
         "pub": "2021-06-02T19:37:26",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2021/05/routing-unnumbered-interfaces.html"
}
