{
   "comments": [
      {
         "date": "29 May 2021 02:45",
         "html": "<p>In Russ White&#39;s presentation (from your post on May 23rd), he listed a few requirements to compare BGP, IS-IS and OSPF. Prefix distribution, filtering, TE, tagging, vendor-support, autoconfig and topology visibility. The one thing I was missing was: scalability.</p>\n\n<p>When I read about BGP-in-DC for the first time, a few years ago, I remember people claiming that IS-IS couldn&#39;t handle the flooding, when you have so many routers in your network. And the duplicate flooding was unsustainable when you have lots of neighbors (&gt;=64?). But Russ didn&#39;t mention scalability at all. On the other hand, we have 4 current drafts to improve IS-IS flooding (dynamic flooding, congestion control, proxy-area and 8-level-hierarchy).</p>\n\n<p>So my question is: do people still think IS-IS doesn&#39;t scale for large DCs? And if so, can anyone give me rough numbers of where things go wrong ? How many routers ? How many neighbors per router? Are we talking 10k routers in an area/domain? 100k? Why are areas not feasible? Anyone who has ever done any real performance measurements? (Not easy, I think). I&#39;d love to hear what people think (less what rumours people heard from others). I understand that these number vary largely per implementation, but I&#39;m still interested.</p>\n\n<p>I would imagine my personal favorite DC design would be:\n1) IS-IS for the underlay. Easy configuration.\n2) EVPN/BGP for the overlay. Scales very well.\n3) segment-routing in the data-plane. You can replace VXLAN, you can do TE if you want, etc.</p>\n\n<p>Or is segment-routing hardware still considered too expensive for large-scale DCs?</p>\n",
         "id": "605",
         "name": " Henk",
         "pub": "2021-05-29T14:45:14",
         "type": "comment"
      },
      {
         "date": "29 May 2021 04:30",
         "html": "<p>Great questions. I&#39;ve been asking them for years, and haven&#39;t got any reasonable answers apart from &quot;yeah, that&#39;s not really a problem until you get <em>really</em> big&quot; from the proponents of the new hotness, and &quot;we made it work with OSPF... and so did AWS&quot; from people who focused on getting the job done.</p>\n",
         "id": "606",
         "name": "Ivan Pepelnjak",
         "pub": "2021-05-29T16:30:50",
         "type": "comment"
      },
      {
         "date": "29 May 2021 05:54",
         "html": "<p>Unfortunately, AWS people never shared much details on how they did it. Maybe it&#39;s their culture of secrecy, maybe because everything is not as clean as it should be. It&#39;s good to know OSPF can scale, but I wouldn&#39;t bet my own network on it just to find a big problem bringing the whole network to an halt a few weeks later. Even without AWS scale, you really don&#39;t know where the limit is. If you run into bugs, you may not get the appropriate support from vendor because everybody else is busy doing it with BGP.</p>\n",
         "id": "607",
         "name": " Vincent Bernat",
         "pub": "2021-05-29T17:54:25",
         "type": "comment"
      },
      {
         "date": "29 May 2021 06:32",
         "html": "<p>I&#39;m still impressed by BGP usage by Cumulus Linux team.</p>\n",
         "id": "608",
         "name": " Jakub",
         "pub": "2021-05-29T18:32:32",
         "type": "comment"
      },
      {
         "date": "31 May 2021 08:38",
         "html": "<p>I second Henk&#39;s question re IS-IS scalability in large DCs given modern hardware -- I remember raising the same question in another post last year. I reached the same conclusion as Russ White for the control plane side, that 300k routes are doable for SPF calculation, for routers running modern day&#39;s multi-core CPUs. The only downside is the flooding. But this is where one cannot throw blanket conclusion such as: no, IS-IS won&#39;t scale with this many prefixes. If the network is static with very few changes, of course IS-IS can scale, thanks to reduced flooding. In a network with frequent changes, I doubt even BGP can scale. Why? Because there&#39;s another part to scalability: FIB update time. TCAM update time is inherently slow, and gets exponentially slower as your prefixes increase to the hundreds of thousands. IPv6 also will be twice as slow as IPV4. So it doesn&#39;t matter how BGP handles millions of prefix painlessly on control plane, the data-plane still takes a long, long time to update. So the 300m prefixes case that Russ brought up in the presentation, is only good for demo, won&#39;t work in practice. First of all, not sure if there&#39;s enough TCAM space to hold up anywhere near that many routes. AFAIK, there isn&#39;t.</p>\n\n<p>I also got struck with nostalgia reading FB&#39;s BGP use case, maybe because I&#39;m just old-schooled :). When was the last time we saw confederation brought up, let alone used in production? Also, I resonate big time with their overall philosophy, reflected well in each and every step of their design process: build a web-scale DC the same way the Internet is built, with hierarchy and summarization for scale, and keep it simple to the bare minimum. I remember we discussed this too via email the other month Ivan. </p>\n\n<p>I feel sick whenever I hear in Cloud Presentations, things like: nothing scales to our need, so we have to invent our own way. So the Internet is smaller in scale than yours? And their time-tested scalable design principles, along with proven, mature technologies, are no good for you? What arrogance and audacity you have. It&#39;s good and refreshing to know there&#39;re people who still champion the old ways, building network on solid fundamental principles, instead of fanfare and hype.  </p>\n\n<p>Pls keep sharing more stuff like this Ivan. Great work :))!!</p>\n",
         "id": "613",
         "name": "Minh Ha",
         "pub": "2021-05-31T08:38:10",
         "type": "comment"
      }
   ],
   "count": 5,
   "type": "post",
   "url": "2021/05/worth-reading-bgp-large-scale-data-centers.html"
}
