{
   "comments": [
      {
         "date": "24 May 2021 12:57",
         "html": "<p>Why are you referring to only &lsquo;gentlemen&rsquo; in your comments? We women can&rsquo;t understand this? </p>\n",
         "id": "585",
         "name": " Tiris",
         "pub": "2021-05-24T12:57:34",
         "type": "comment"
      },
      {
         "date": "24 May 2021 01:47",
         "html": "<p>I&#39;ve never met anyone who would ask to be called clueless, but I guess there&#39;s a first time for everything ;) Would you like me to rewrite the text to be more inclusive?</p>\n",
         "id": "586",
         "name": "Ivan Pepelnjak",
         "pub": "2021-05-24T13:47:46",
         "type": "comment"
      },
      {
         "date": "25 May 2021 03:07",
         "html": "<p>Maybe Im misremembering, but didn&#39;t Lapuhkov have &quot;real life&quot; experience building out MS&#39;s data center network? </p>\n",
         "id": "587",
         "name": " Josh",
         "pub": "2021-05-25T03:07:20",
         "type": "comment"
      },
      {
         "date": "25 May 2021 01:09",
         "html": "<p>Asked to be CALLED clueless???? Excuse me???  Not sure who you think you are talking to?  I asked why you referred to ONLY TO GENTLEMEN?!?! Editing one word in your article doesn&rsquo;t mean rewriting it! That&rsquo;s clueless and inconsiderate and very disrespectful! </p>\n",
         "id": "590",
         "name": "Tiris ",
         "pub": "2021-05-25T13:09:07",
         "type": "comment"
      },
      {
         "date": "25 May 2021 01:29",
         "html": "<p>@Josh: Petr never said &quot;BGP is the answer to all questions&quot;. He always presented his solution as &quot;I had this specific set of requirements and I found out that based on those requirements it was best to use BGP&quot;.</p>\n\n<p>Look around, and you might notice vendor marketers selling customers BGP-based DC fabric with four switches, or another vendor marketer telling everyone to use BGP and two-way redistribution instead of two routing protocols, or an &quot;engineer&quot; promoting IBGP over EBGP because he desperately wanted to use BGP as the underlay IGP, and his chosen platform couldn&#39;t handle two parallel EBGP address families (IPv4 and EVPN).</p>\n\n<p>Occasionally I get sick-and-tired of people claiming &quot;X is the answer&quot; without even understanding what the question was in the first place.</p>\n",
         "id": "591",
         "name": "Ivan Pepelnjak",
         "pub": "2021-05-25T13:29:24",
         "type": "comment"
      }
   ],
   "count": 5,
   "type": "post",
   "url": "2021/05/worth-reading-rethinking-bgp-data-center.html"
}
