{
   "comments": [
      {
         "date": "07 December 2023 12:14",
         "html": "<p>For anyone who&#39;s interested, there was an in-depth presentation at RIPE 87 on the topic:\nhttps://ripe87.ripe.net/archives/video/1263/</p>\n",
         "id": "2018",
         "name": " dreamer",
         "pub": "2023-12-07T12:14:57",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "07 December 2023 06:30",
               "html": "<p>I&#39;m just wondering if it is sane to build such a vital piece of infrastructure with three completely different vendors. Why even consider it, given all the interop hassle.</p>\n",
               "id": "2021",
               "name": " Erik H",
               "pub": "2023-12-07T18:30:32",
               "ref": "2020",
               "type": "comment"
            },
            {
               "date": "08 December 2023 12:37",
               "html": "<p>Well, it&#39;s two vendors: both Brocade MLXe and Extreme SLX are from a single vendor (Extreme Networks). The SLX is a possible replacement for the older MLXe.</p>\n",
               "id": "2024",
               "name": "Erik Auerswald",
               "pub": "2023-12-08T12:37:42",
               "ref": "2021",
               "type": "comment"
            },
            {
               "date": "08 December 2023 12:04",
               "html": "<p>Two words (actually three): pricing and organic growth. It&#39;s amazing how little money people (= service providers) are willing to put into mission-critical infrastructure like IXPs (or OpenSSL maintenance &#x1F92A;)</p>\n\n<p>https://xkcd.com/2347/ comes to mind &#x1F937;&zwj;&#x2642;&#xFE0F;</p>\n",
               "id": "2022",
               "name": "Ivan Pepelnjak",
               "pub": "2023-12-08T12:04:27",
               "ref": "2021",
               "type": "comment"
            },
            {
               "date": "08 December 2023 11:58",
               "html": "<p>As above, it&#39;s only two vendors, and for many years it was only Brocade/Extreme. It&#39;s only this year they turned up Juniper devices. They had to do something about 100G/400G, and changing vendors was a reasonable choice. https://www.juniper.net/us/en/customers/ams-ix-case-study.html (published 2022, but it&#39;s only this year that Juniper equipment has gone into production there)</p>\n\n<p>Sticking with one vendor forever because you&#39;re scared of interop gives you no negotiating leverage, and may mean you&#39;re stuck - e.g. I don&#39;t think Extreme Networks is shipping any 400G gear, so what do you do? But even if you&#39;ve decided to completely swap to Juniper, you can&#39;t do that in one step. You have to have some interoperability for a while. </p>\n\n<p>I don&#39;t think the XKCD thing is relevant here. It&#39;s not a case of relying on a forgotten utility maintained by a volunteer, this is AMS-IX&#39;s core product. It is everything they do. And it&#39;s not a case of service providers being unwilling to put money into IXPs. AMS-IX is not a charity running on donations. See https://peering.exposed. The SPs and CDNs who are AMS-IX customers are paying a decent amount.</p>\n\n<p>I also don&#39;t think that AMS-IX is quite so mission-critical any more. Yes, it does a fair bit of traffic, but there are multiple other IXPs in Amsterdam. If you really care about your connectivity, you are connected to at least two of those, in addition to a mesh of PNIs and transit connections. </p>\n\n<p>(Background: my employer peers at many locations, including AMS-IX. I do not speak for them, etc etc)</p>\n",
               "id": "2025",
               "name": " Lindsay Hill",
               "pub": "2023-12-08T23:58:23",
               "ref": "2022",
               "type": "comment"
            }
         ],
         "date": "07 December 2023 04:32",
         "html": "<p>After watching the video (thanks dreamer!) and looking at the <a href=\"https://ripe87.ripe.net/presentations/119-AMS-IX_outage_2023_v2.pdf\">slides</a>, I am not sure which of the three mentioned device families (Brocade&sup1; MLXe-16/32, Extreme SLX9850, and Juniper MX10k8) introduced LACP frames into the VPLS network.</p>\n\n<p>MPLS packets should be forwarded based on the label, not on the octets after the label stack, i.e., MPLS encapsulated LACP frames should be forwarded identically to all other MPLS packets inside the MPLS network. I would not expect LACP to ingress a VPLS network <em>by default</em> (many vendors, e.g., <a href=\"https://www.juniper.net/documentation/us/en/software/junos/multicast-l2/topics/topic-map/layer-2-protocol-tunneling.html\">Juniper</a>, use Layer 2 Protocol Tunneling (L2PT) to allow transport of such protocols after specific configuration; Cisco called this <em>Generic Bridge PDU Tunneling (GBPT)</em>).</p>\n\n<p>&sup1; The Brocade MLX routers are part of what Extreme Networks purchased from the Brocade parts Broadcom did not want to keep, as are the SLX routers.</p>\n",
         "id": "2020",
         "name": "Erik Auerswald",
         "pub": "2023-12-07T16:32:39",
         "type": "comment"
      },
      {
         "date": "09 December 2023 11:15",
         "html": "<p>After watching the video I came to the conclusion that they haven&#39;t tested MAC ACL, link failure convergence and interop. Just a disaster waiting to happen. Thorough testing is mandatory in such a setup (maybe they thought they could get through that migration phase without too much effort). For me there are no excuses. It looks to me like poor operational practices. Should not sugarcoat it and beg for understanding.</p>\n",
         "id": "2026",
         "name": "Anonymous",
         "pub": "2023-12-09T11:15:38",
         "type": "comment"
      },
      {
         "date": "10 December 2023 02:00",
         "html": "<p>It seems to me as if the AMS-IX incident report has been improved by adding more details regarding which problems occurred with which router product&sup1;, as can be seen via <a href=\"https://web.archive.org/web/20230000000000*/https://www.ams-ix.net/ams/outage-on-amsterdam-peering-platform\">wayback machine</a>. Naming the problematic router products helps in evaluating whether other networks might be affected by these specific problems. Thanks to AMS-IX!</p>\n\n<p>I think this report is a good example for a <em>public</em> <a href=\"https://sre.google/sre-book/postmortem-culture/\">blame free postmortem</a>. It shows competence and both the ability and intention to learn from problems. Such a report allows <em>others</em> (including me) to learn. This is great! Again, thanks to AMS-IX!</p>\n\n<p>In this case, an issue in the L2 overlay (LACP frames inadvertently transported via VPLS) affected the stability of the L3 underlay (MPLS with OSPF, LDP, and RSVP-TE), i.e., a cascading failure brought down the whole peering LAN. This provides an example where an L3 underlay did <em>not</em> result in better stability for an L2 domain.</p>\n\n<p>&sup1; I remember <em>not</em> seeing specific router products for specific problems when I first read this report. Thus my initial comment that I was not sure which router product forwarded LACP frames.</p>\n",
         "id": "2028",
         "name": "Erik Auerswald",
         "pub": "2023-12-10T14:00:54",
         "type": "comment"
      }
   ],
   "count": 4,
   "type": "post",
   "url": "2023/12/ams-ix-layer-2-strikes-again.html"
}
