{
   "comments": [
      {
         "date": "08 September 2021 05:00",
         "html": "<p>If you&#39;re serious when you say &quot;It looks like I&rsquo;ll have to figure out what WireGuard does as well&quot; then you should absolutely pause everything else and dig into Wireguard. It is a simple, efficient, and flexible VPN protocol.</p>\n\n<p>From a network engineer perspective, it reminds me of a GRE tunnel, but with easy and efficient encryption, and it&#39;s UDP instead of IP 47.</p>\n\n<p>From a security perspective, it uses modern crypto without risk of cipher downgrade or protocol misconfiguration.</p>\n\n<p>From a developer perspective, it&#39;s not much different than configuring SSH sessions.</p>\n\n<p>Also, I had not heard of Innernet and holy smokes does it have potential to be a DMVPN replacement.</p>\n",
         "id": "724",
         "name": " Jeff TP",
         "pub": "2021-09-08T17:00:51",
         "type": "comment"
      },
      {
         "date": "08 September 2021 04:54",
         "html": "<p>There is also vpncloud (https://vpncloud.ddswd.de/docs/) which is peer-to-peer VPN.  I was able to get it running using TAP mode with babel routing protocol (https://www.irif.fr/~jch/software/babel/).</p>\n\n<p>Unfortunately, unlike Wiregard, currently vpncloud is not Linux namespace aware, so we couldn&#39;t do something like encryption/decryption in root network namespace while routing in private namespace.</p>\n",
         "id": "723",
         "name": " James",
         "pub": "2021-09-08T16:54:14",
         "type": "comment"
      },
      {
         "date": "09 September 2021 03:54",
         "html": "<p>Is DMVPN compatibility a strict requirement? What about ADVPN/RFC7018?</p>\n",
         "id": "726",
         "name": "Steve ",
         "pub": "2021-09-09T15:54:17",
         "type": "comment"
      },
      {
         "date": "19 September 2021 02:13",
         "html": "I just stumbled over:<br />\n\n<p>&quot;An open source, self-hosted implementation of the Tailscale coordination server.&quot;</p>\n\n<p>https://github.com/juanfont/headscale</p>\n",
         "id": "738",
         "name": " Michael",
         "pub": "2021-09-19T14:13:47",
         "type": "comment"
      }
   ],
   "count": 4,
   "type": "post",
   "url": "2021/09/dmvpn-open-source.html"
}
