{
   "comments": [
      {
         "date": "30 September 2021 06:50",
         "html": "<p>All networking professional should learn ITU-T G.805 and G.809. Then they would not be surprised. However, lot of them are stopped at the OSI reference model. Then they have difficulties to understand the real word of infinitely embedded overlays and underlays... \nFor an old telco guy, this is nothing new. Just think about a hierarchical TDM network...</p>\n",
         "id": "771",
         "name": " Bela Varkonyi",
         "pub": "2021-09-30T18:50:00",
         "type": "comment"
      },
      {
         "date": "08 October 2021 01:53",
         "html": "<p>Hi Ivan!</p>\n\n<p>I appreciate posting a dedicated blog post on my question.</p>\n\n<p>I totally agree with &ldquo;What problem am I trying to solve?&rdquo; and &ldquo;What is the best tool for the job?&rdquo;.</p>\n\n<p>My context is vSphere with VSAN and 100% custom made automation backend to provision tenants and services in EVPN, EdgeFW, ADC. Alongside a commercial off-the-shelf self-service &quot;cloud management&quot; frontend for end users.</p>\n\n<p>So far i have seen that the Nexus9k BGP EVPN control-plane is far from 100% reliable and it is not hard at all to make it &quot;misbehave&quot; by, for example, pushing wrong or too much config, or deleting objects in the wrong order.\nIn this project this part is dynamic, because it is based on front-end end-user self-service.\nSo in this respect - misbehaving tenant VRF is one problem, but misbehaving vSAN, vSphere cluster, other fundamental infrastructure services is a totally different problem to have. In my view none of the &quot;benefits&quot; that VXLAN/EVPN gives are needed for the infrastructure services, hence skipping further abstraction layers and most importantly dependencies is the best decision.</p>\n\n<p>Does it make sense?</p>\n",
         "id": "783",
         "name": "Borislav Lazarov",
         "pub": "2021-10-08T13:53:13",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2021/09/overlay-underlay-reuse.html"
}
