{
  "comments": [
    {
      "date": "03 September 2018 12:51",
      "html": "You&#39;ve really hit the nail on the head here Ivan (as usual :-).<br /><br />For me the main point is to kill the old &quot;everything 2N redundant&quot; model with fire.<br />N+1 is the only way to scale economically.<br /><br />N+1 bandwidth &amp; N+1 redundancy (&amp; N must be &gt;=2) are really nice (&amp; IMHO operationally necessary) but economics are the driver that will get management to sign off on it.<br /><br />Especially when you&#39;re replacing 2N big expensive $VENDOR chassis with N+1 1u merchant silicon boxes.",
      "id": "7226019376203969319",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Blake",
      "profile": "http://l33.fr",
      "pub": "2018-09-03T12:51:48.349+02:00",
      "ref": "1279982096867526787",
      "type": "comment"
    },
    {
      "date": "03 September 2018 16:17",
      "html": "At least I find that a routed spine-and-leaf network is also easier to understand and debug than the &quot;traditional&quot; three-layer core-aggregation-access design with Spanning Tree and VLANs going all over the place.  A symmetric and regular design is good.  The pain when you have forgotten to add a VLAN to the backup link (normally blocked by STP), and don&#39;t notice until the primary breaks is not.  Or when you have bit errors on the backup link, which are not noticable until you put significant traffic on it, and get 3 Kbyte/s throughput on your TCP streams...<br /><br />Just being able to traceroute and see exactly which way packets take are quite helpful in finding where things break.  (That assumes you are not doing tunneling/overlays, though.)<br /><br />My experience is also that at least OSPF converges much faster after a failure than STP (even Rapid STP) after the STP root fails.<br /><br />There is often more configuration (as in lines in the switch configs) in a routed network than in a bridged network, though, especially when you add a bunch of VRFs to separate various management networks.  But unnumbered links makes things easier (allocating all those /31:s and /127:s and making sure you get the right address at the right end can be a large part of the work of adding a VRF).  And if you subscribe to the automation mantra, that takes out a large part of the rest. :-)<br />",
      "id": "5944525910959494560",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Bellman",
      "profile": null,
      "pub": "2018-09-03T16:17:45.239+02:00",
      "ref": "1279982096867526787",
      "type": "comment"
    },
    {
      "date": "03 September 2018 17:43",
      "html": "No complex leaf and spine design needed because most companies still using mainframes. So 2 switches and 2 routers are enough for them.",
      "id": "3450274396178125828",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2018-09-03T17:43:40.270+02:00",
      "ref": "1279982096867526787",
      "type": "comment"
    }
  ],
  "count": 3,
  "id": "1279982096867526787",
  "type": "post",
  "url": "2018/09/do-we-need-leaf-and-spine-fabrics.html"
}