{
   "comments": [
      {
         "date": "06 September 2018 10:22",
         "html": "Interesting as always, Ivan. Unfortunately we would get stuck at the very first step. Who is a Tier 1 provider? How do you define that? And even if you could, ISPs want to be Tier 1 because of marketing. And they wouldn&#39;t let you view their details of peerings, contracts etc...<br /><br />So... What we are left with is probably automatic filtering based on what is in route databases BUT:<br /><br />ISPs are lazy<br />They care about moving packets not suboptimal routing or security<br />Route databases often aren&#39;t fully accurate<br />Not all ISPs have automated their filters<br /><br />So the unfortunate outcome is that we&#39;ll see route leaks even in the future. Our hope relies upon people like Job Snijders who are passionate about building a better internet.",
         "id": "5800722802665779722",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Daniel Dib",
         "profile": "https://www.blogger.com/profile/05348201047870981278",
         "pub": "2018-09-06T10:22:01.488+02:00",
         "ref": "4359952839459891150",
         "type": "comment"
      },
      {
         "date": "06 September 2018 12:10",
         "html": "I miss the phrase &quot;...is nothing new&quot;. The problem exists for decades but now they gave a name to that thingy.",
         "id": "1091749826776601905",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2018-09-06T12:10:07.757+02:00",
         "ref": "4359952839459891150",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "07 September 2018 11:54",
               "html": "Getting plug-and-play (or plug-and-forget) working correctly and surviving any stupidity the user (or third-party $vendors if you have to cope with them) could throw at it is a really hard problem... as Microsoft discovered years ago. <br /><br />BTW, that&#39;s where &quot;plug-and-pray&quot; comes from. I hope RIFT track record will be infinitely better than that.",
               "id": "4651679160165806360",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "Ivan Pepelnjak",
               "profile": "https://www.blogger.com/profile/13457151406311272386",
               "pub": "2018-09-07T11:54:52.056+02:00",
               "ref": "9162579753181718524",
               "type": "comment"
            },
            {
               "date": "07 September 2018 18:23",
               "html": "Corollary: Viability and merit of an idea is mostly orthogonal to the quality at which it is executed in code ;-)<br /><br />Proof&#39;s in the pudding ;-) Pudding is downloadable in two implementations, feedback welcome ... ",
               "id": "6712623875400439405",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "Tony P",
               "profile": "https://www.blogger.com/profile/07732539097585801151",
               "pub": "2018-09-07T18:23:00.002+02:00",
               "ref": "9162579753181718524",
               "type": "comment"
            }
         ],
         "date": "06 September 2018 20:56",
         "html": "But now, first, Ivan, pray tell, in RIFT we don&#39;t build &quot;plug-and-pray&quot; fabric, we build a &quot;plug-and-forget&quot; ZTP fabric  ;-) <br /><br />Valley free routing (which I call more generically no-zigzag routing, you can easily figure out what I mean, you go north until you change direction and go south which you do with the 0 and +/-, unsurprisingly major principle in RIFT again ;-) is a very desirable, very hard to achieve property unless you have a sense of N-S on the substrate (fabric, AS-mesh, whatever) which preconditions sense of direction (to be bit bloated, you need a partial mesh with a max-upper and lower bound). And hence, if done extremely well you are not even bound by ECMP anymore ;-) <br /><br />I do obviously think for locally provisioned bandwith (such as IP fabrics) this is a natural way to progress and will become stronger with the demise of &quot;artisanal local network configuration skills&quot;. Whether it will be Clos or some variant thereof is not very interesting, routing will adjust, the more &quot;interconnected&quot; your fabric in terms of shortcut the more routing information you&#39;ll have to slosh around @ convergence cost @ failure and so on. For things like WAN &amp; AS meshes this is much, much harder thing to achieve, see also the &quot;peer complex role&quot; route leaking discussions in GROW. Hence I don&#39;t think lots of progress will be made unless some kind of economic cost will be imposed on hot potato routing ;-) <br /><br />Good article ... ",
         "id": "9162579753181718524",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Tony P",
         "profile": "https://www.blogger.com/profile/07732539097585801151",
         "pub": "2018-09-06T20:56:07.668+02:00",
         "ref": "4359952839459891150",
         "type": "comment"
      },
      {
         "date": "19 June 2021 08:58",
         "html": "<p>ahh... i see... thank you for the insight</p>\n",
         "id": "678",
         "name": " theodofilius",
         "pub": "2021-06-19T08:58:43",
         "type": "comment"
      }
   ],
   "count": 4,
   "id": "4359952839459891150",
   "type": "post",
   "url": "2018/09/valley-free-routing.html"
}
