{
   "comments": [
      {
         "date": "14 May 2020 05:06",
         "html": "It sounds to me that the SD-WAN craze has gone through a number of phases over the years:<br />\n\n<p>1 - It&#39;s connection agnostic, let&#39;s get a bunch of DIA&#39;s from different ISP&#39;s and bundle them all together so we can get one fat pipe and not worry about circuit failover. We no longer need our big expensive MPLS circuits, and don&#39;t have to wait 2 months for $Large ISP.</p>\n\n<ol>\n<li><ul>\n<li>Let&#39;s add some security features in the mix. A lot of these devices will be deployed in various locations/branches, we need to add some web filtering and scrubbing at the edge and not have to funnel everything to HQ. Now that many of us are working remote, let&#39;s also incorporate the use of a CASB (Content Access Security Broker) to ensure no matter where you are, office or coffee shop, we have you covered.</li>\n</ul></li>\n<li><ul>\n<li>Now let&#39;s add some more smarts into the mix, instead of having a big, dumb fat pipe, we need to be aware of all of the flows, measure latency of each application end to end. We need application recognition and the ability to prioritize flows/traffic in detail without playing with the many different implementations of QoS.</li>\n</ul></li>\n</ol>\n\n<p>I may have them in the wrong order, or missed some key buzzwords.. but that&#39;s the basic idea. I think it will take time to mature, but for those who like to know exactly what&#39;s going on under the hood, it&#39;s a tough call.</p>\n\n<p>Mario</p>\n",
         "id": "36",
         "name": "Mario",
         "pub": "2020-05-14T17:06:12",
         "type": "comment"
      },
      {
         "date": "14 May 2020 05:49",
         "html": "<p>You pretty much nailed it ;)... all without in-depth documentation of implementation details that would help us troubleshoot it, and often with security holes big enough to drive an Abrams through...</p>\n",
         "id": "37",
         "name": "Ivan Pepelnjak",
         "pub": "2020-05-14T17:49:31",
         "type": "comment"
      },
      {
         "date": "15 May 2020 04:43",
         "html": "<p>Hi Ivan,</p>\n\n<p>Interestingly I was having chat with another fellow engineer today on somewhat along similar lines. In my case the context I was asked about - &quot; Can we move a potential client from 100% MPLS (today) to 100% Internet from Transport perspective with SD-WAN&quot;</p>\n\n<p>My answer was - </p>\n\n<ol>\n<li><p>You can either bring math and science into this (Which most SD-WAN vendors wouldn&#39;t prefer) - As it takes time, resources and makes sales cycle lengthy. </p></li>\n<li><p>Just run a Production POC with Client and figure out</p></li>\n</ol>\n\n<p>Now as you might have imagine, 90% of enterprises in my view and vendors too prefer the 2nd option. </p>\n\n<p>If you look closely , 1st option is more sensible though but in most cases it&#39;s not only vendor but also clients want to go down 2nd path. Part of the equation is not every client has people like Adrian on their side and most clients don&#39;t perhaps even the nuances of Design choices even if we wish to explain them.</p>\n\n<p>But again, on the flip side we as Network Architects shouldn&#39;t get offended if Vendor guy can&#39;t explain in detail a certain feature on functioning. Point being most of Engineers on both Client and Vendors sides are merely Product Engineers and focus into Technology depth is going down in my view since SDN came as one of it&#39;s fame claim was to hide complexity. And IBN perhaps makes that gap wider since as operator I should only focus on policy constructs and no need to look into or care about stuff going in the background.</p>\n\n<p>But otherwise If I were that Vendor guy running presentation for Adrian, I would rather tell him to get this stuff through Semi Production POC and let the solution do the talking for itself.</p>\n\n<p>Since personally I have spoken to people on Client side occasionally which would go into the depth and ask questions around packet flow at HW level including ASIC pipeline, NOS Structure and so forth. And as you can see it&#39;s a never ending story so personally I wouldn&#39;t mind if someone who is presenting to me doesn&#39;t have that depth in most cases as still in real life most Engineers not often go that far.</p>\n\n<p>My 2 Cents...</p>\n",
         "id": "38",
         "name": "A Network Artist",
         "pub": "2020-05-15T04:43:28",
         "type": "comment"
      },
      {
         "date": "19 May 2020 09:41",
         "html": "<p>At at level of absolute sarcasm a cisco router is nothing more than some PDP11 code so give me Linux any day.\nThe question that needs answering is not about SDWAN but do we still need MPLS or branches?  If we don&#39;t need them then we don&#39;t need to replace them.</p>\n",
         "id": "41",
         "name": "Ron Bartels",
         "pub": "2020-05-19T09:41:55",
         "type": "comment"
      }
   ],
   "count": 4,
   "type": "post",
   "url": "2020/05/feedback-another-sdwan-fan.html"
}
