{
   "comments": [
      {
         "date": "04 February 2021 07:30",
         "html": "<p>Hi Ivan, this sentence is not always correct: ....while VMware NSX-T requires all controllers to be in one location.</p>\n\n<p>NSX-T manager appliances running the controller supports also a distributed design option over three locations (typically with three subnets) without or with (preference ) front LB (for management purpose) to avoid in case of a location failure the lost of the majority. For sure all needs to be within supported RTT.</p>\n\n<p>Maybe you consider this in your blog too\nOliver</p>\n\n<p>Maybe </p>\n",
         "id": "381",
         "name": "Oliver Ziltener",
         "pub": "2021-02-04T07:30:54",
         "type": "comment"
      },
      {
         "date": "04 February 2021 07:51",
         "html": "<p>@Oliver: Rechecked NSX-T 3.1 Multisite documentation and it&#39;s in perfect agreement with what I wrote. </p>\n\n<p>If you have a VMware document stating that (A) NSX-T cluster (not NSX-T Federation) can be deployed across three locations and that (B) VMware supports that design, I&#39;d appreciate a pointer. Thank you!</p>\n",
         "id": "383",
         "name": "Ivan Pepelnjak",
         "pub": "2021-02-04T07:51:31",
         "type": "comment"
      },
      {
         "date": "04 February 2021 11:52",
         "html": "<p>Hi Ivan, Vendor public documentation do never show all design options. But I will send you offline a link to a NSX-T multi location (multi site and federation) document. This is a nice Vmware doc about the relevant NSX-T multi location solutions and the starting point for any person working with NSX. \nCheers Oliver</p>\n",
         "id": "385",
         "name": "Oliver Ziltener",
         "pub": "2021-02-04T23:52:09",
         "type": "comment"
      },
      {
         "date": "05 February 2021 01:13",
         "html": "<p>Hi Oliver,</p>\n\n<p>Having to deal with numerous networking vendors in the past, I got the impression that most of them love to over-promise and under-deliver. If a vendor decides not to publish a design document that in itself might indicate the potential quality of that design, and I would never advise anyone to use it. See also https://www.ipspace.net/Manual:Vendors</p>\n\n<p>Cheers, Ivan</p>\n",
         "id": "391",
         "name": "Ivan Pepelnjak",
         "pub": "2021-02-05T13:13:04",
         "type": "comment"
      },
      {
         "date": "06 February 2021 10:14",
         "html": "<p>Hi Ivan, is an official blog or community space from Vmware not a public space? Yes it is in my eyes. Maybe you see it different...\nTo keep everything well documented in the public doc manual area is for every vendor a big challenge. Software cycles are too frequent...</p>\n\n<p>Ivan, as I was not able to find an easy way (ok, searched only a few minutes) to drop you and email offline, so here is the link.</p>\n\n<p>https://communities.vmware.com/t5/VMware-NSX-Documents/NSX-T-3-1-Multi-Location-Design-Guide-Federation-Multisite/ta-p/2810327</p>\n\n<p>It is not only in the networking/IT area, where vendors cannot always match from the technical perspectives what marketing promise. This is a given fact since decades....so i am not worrying too much about it. Have a look to this document and let me know your view. There are a lot of important facts about NSX multi locations solutions. \nCheers Oliver</p>\n",
         "id": "392",
         "name": "Oliver Ziltener",
         "pub": "2021-02-06T10:14:14",
         "type": "comment"
      },
      {
         "date": "06 February 2021 10:33",
         "html": "<p>Dear Oliver, please make up your mind. First it is &quot;<em>vendor public documentation do never show all design options, will send you the link</em>&quot; then it is &quot;<em>is an official blog or community space from VMware not a public space</em>&quot;. Whatever.</p>\n\n<p>Anyway, thanks for the link.</p>\n",
         "id": "393",
         "name": "Ivan Pepelnjak",
         "pub": "2021-02-06T10:33:40",
         "type": "comment"
      }
   ],
   "count": 6,
   "type": "post",
   "url": "2021/02/centralized-control-plane-partition.html"
}
