{
   "comments": [
      {
         "date": "11 February 2021 10:38",
         "html": "<p>Hello Minh, <br />\nAlways a pleasure reading your stuff. You and Ivan are are an explosively powerful mix. :) <br />\nTotally agree with you on small packets. <br />\nA couple of things though for the time being: <br />\nI just want to take a stand for once in defense of the high-end vendors as they are asked for hundreds of sometimes pretty exotic features by their big Service Provider customers and therefore the code and the chipset gets as you pointed out extremely populated with stuff. I have the impression it is inevitable and it&#39;s not just made on purpose to make more money as such.  I reckon they&#39;d rather avoid it if they could. <br />\nThe other thing is if you can open up another blog soon on the interesting. \nstatement: &quot;Self-similar traffic also makes big buffer mostly useless,&quot; :)    </p>\n\n<p>Last thing: I might be naive but our market is in need even more urgently now that the scenario is getting fuzzier and fuzzier of an independent testing facility for functionality AND performance.  Universities should be involved and the vendors too of course. Stringent test procedures and well documented and thus reproducible. In short, proper stuff.   </p>\n\n<p>Cheers/Ciao <br />\nAndrea  </p>\n",
         "id": "398",
         "name": " Andrea Di Donato",
         "pub": "2021-02-11T10:38:33",
         "type": "comment"
      },
      {
         "date": "11 February 2021 11:08",
         "html": "<p>IMIX can also serve as a baseline. It would be better benchmark than for 64B size packets. More important thing is to do multidimensional scale and performance tests on the same OS. Not like unidimensional tests on a tuned OS version per test as some Chinese vendors got used to do it. </p>\n\n<p>In a test with a single feature the performance may not drop significantly. A router OS image packed with many features requires additional CPU cycles to check IF statements and bypass the code, even if it is not turned on but its software module is on the HW line card. Some vendors used a pre-canned OS images to use just the code optimised for a particular tested feature. In reality we turn on many features at the same time and the similar setup should be validated during the test. There are customers who are waiting several years for one official image. Be careful with such vendors.</p>\n",
         "id": "399",
         "name": " Piotr Jablonski",
         "pub": "2021-02-11T11:08:27",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2021/02/importance-switching-small-packets.html"
}
