{
  "comments": [
    {
      "date": "07 May 2018 11:20",
      "html": "Juniper&#39;s solution seems to me like a bricolage with no duct tape.",
      "id": "6460509600673087882",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2018-05-07T11:20:40.050+02:00",
      "ref": "9214390189016274086",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "07 May 2018 17:57",
          "html": "&quot;I still can&#39;t find any reason why EBGP-only EVPN design is viable&quot; &lt;&lt; and people who got it right (the FRR crowd) can&#39;t figure out why anyone would want to run IGBP on top of EBGP (potentially between the same boxes) and pretend each box belongs to two ASNs.<br /><br />In my personal (highly biased, as always) opinion, two designs make sense: IBGP-over-IGP, or EBGP only. There are corner cases that might require IGBP-over-EBGP (humongous number of prefixes on hundreds of switches), everything else seems like vendors fixing their implementation idiosyncrasies with &quot;interesting&quot; designs.",
          "id": "9082429776469527739",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2018-05-07T17:57:08.976+02:00",
          "ref": "2836806007929791660",
          "type": "comment"
        },
        {
          "date": "07 May 2018 18:00",
          "html": "s/IGBP/IBGP/gi - seems like I&#39;m too old to get the acronyms right :(",
          "id": "3752234566149498782",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2018-05-07T18:00:11.606+02:00",
          "ref": "2836806007929791660",
          "type": "comment"
        },
        {
          "date": "07 May 2018 21:30",
          "html": "What exactly they got right in FRR that others didn&#39;t? (apart from not implementing proper multihoming yet)",
          "id": "2615389851768484004",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Alex",
          "profile": "https://www.blogger.com/profile/00644778105219383913",
          "pub": "2018-05-07T21:30:54.404+02:00",
          "ref": "2836806007929791660",
          "type": "comment"
        },
        {
          "date": "07 May 2018 22:44",
          "html": "There&#39;s no right or wrong, it&#39;s always: it depends. His friends at this turtle company found a way to discover BGP neighbors through IPv6 RA messages. They also automatically derive RDs and RTs. Very revolutionary!",
          "id": "6926383902251222080",
          "image": "https://resources.blogblog.com/img/blank.gif",
          "name": "Anonymous",
          "profile": null,
          "pub": "2018-05-07T22:44:15.052+02:00",
          "ref": "2836806007929791660",
          "type": "comment"
        },
        {
          "date": "08 May 2018 06:45",
          "html": "Disclaimer: I made it my mission to help network engineers build stable networks, so I have a certain bias that&#39;s totally different from the perspective of people trying to sell hot new gizmos.<br /><br />&quot;There&#39;s no right or wrong, it&#39;s always: it depends.&quot; &lt;&lt; Agree. However, there&#39;s is better or worse for a particular use case.<br /><br />&quot;His friends at this turtle company found a way to discover BGP neighbors through IPv6 RA messages. They also automatically derive RDs and RTs. &quot; &lt;&lt; I prefer easy-to-understand configurations with as few parameters and data duplication as possible, and I keep wondering why nobody else bothered. You might prefer convoluted configurations and IP addresses that have to be managed somewhere. We might agree to disagree, but that means at least one of us is not completely rational (see https://en.wikipedia.org/wiki/Aumann%27s_agreement_theorem)<br /><br />&quot;Very revolutionary!&quot; &lt;&lt; Revolutionary, Innovative and Disruptive is usually marketing bullshit, and it often means &quot;you&#39;ll have to deal with a zillion bugs nobody found in our half-baked unicorn-powered **** yet&quot;. I prefer Useful and Reliable. As I said above, YMMV.",
          "id": "5120593003408635157",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2018-05-08T06:45:21.769+02:00",
          "ref": "2836806007929791660",
          "type": "comment"
        },
        {
          "date": "08 May 2018 09:33",
          "html": "After reading your comment I thought that FRR has really &quot;got right&quot; something special about EVPN than others didn&#39;t, which I&#39;m not aware of. But unfortunately after digging into Cumulus EVPN documentation I didn&#39;t find any special magic sause.<br /><br />BGP Unnumbered is just the fancy way of establishing BGP session. We might argue about its usefulness - some people might say that it&#39;s the best thing ever since sliced bread, but others might object that it&#39;s just hiding of complexity away from end user. &quot;I would love to see how you explain this to the guy that has to do troubleshooting @ 2AM on Sunday morning&quot; - I&#39;ve been told before. I agree that this feature can really help you drastically simplify configuration ( == simplify your automation during initial deployment), but that only half of the picture. Anyway, in the end it&#39;s just simple BGP session, nothing special about it. I think it&#39;s a little aside of e/i BGP design topic.<br /><br />&quot;They also automatically derive RDs and RTs.&quot; - Nothing special here, according to CL3.6 EVPN documentation everything done exactly the same as in Junos. All major vendors do this already.<br /><br />I keep wondering what you&#39;ll say when FRR guys finally implement iBGP+eBGP design option in their code and start presenting it as another revolution.",
          "id": "6638046280218756176",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Alex",
          "profile": "https://www.blogger.com/profile/00644778105219383913",
          "pub": "2018-05-08T09:33:49.196+02:00",
          "ref": "2836806007929791660",
          "type": "comment"
        },
        {
          "date": "08 May 2018 15:19",
          "html": "Hi Alex,<br /><br />Between the lines your comments sound like &quot;you became a Cumulus fanboy&quot;. As you might know, I practice equal-opportunity snarkiness (= treating every vendor doing something suboptimal the same way). This time Cumulus happens to have the cleanest implementation.<br /><br />More in a separate blog post. In the meantime, try to figure out what&#39;s really wrong with the IBGP-over-EBGP approach and why Juniper pushes it. As a bonus challenge: figure out why Cisco pushes running EVPN EBGP sessions between loopback interfaces.",
          "id": "4491571029713082745",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2018-05-08T15:19:29.016+02:00",
          "ref": "2836806007929791660",
          "type": "comment"
        },
        {
          "date": "08 May 2018 17:01",
          "html": "Hint: you&#39;ll find the answer to one of the questions in the blog post from may 2nd 2018",
          "id": "7045255806596447896",
          "image": "https://resources.blogblog.com/img/blank.gif",
          "name": "Anonymous",
          "profile": null,
          "pub": "2018-05-08T17:01:16.785+02:00",
          "ref": "2836806007929791660",
          "type": "comment"
        }
      ],
      "date": "07 May 2018 14:45",
      "html": "&quot;In Junos, EBGP IP fabric configuration with automatic RT is quite simple, since we can define different local AS for iBGP (EVPN Overlay, RT autogeneration) and eBGP (Underlay).&quot;<br />It seems I&#39;ve seen this before :)<br />I still can&#39;t find any reason why EBGP-only EVPN design is viable. It looks like doing MPLS L3VPN Option B between all your PE routers instead of time-proved iBGP design. If you ever had to manage large-scale option-B peering, you know how fun is this.<br /><br />On a side note, I think it&#39;s worth to point out that Type-4 ES-Import RT communities is special case only for Type-4 EVPN routes, doesn&#39;t really relate to previous discussion and doesn&#39;t use AS numbers.",
      "id": "2836806007929791660",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Alex",
      "profile": "https://www.blogger.com/profile/00644778105219383913",
      "pub": "2018-05-07T14:45:13.107+02:00",
      "ref": "9214390189016274086",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "09 May 2018 12:13",
          "html": "Cisco is doing ECMP based on IGP (OSPF or IS-IS). But IGPs don&#39;t scale well (as you might have heard) except for RIFT and Openfabric. The others are trying to do ECMP based on BGP.",
          "id": "4098975584056760780",
          "image": "https://resources.blogblog.com/img/blank.gif",
          "name": "Anonymous",
          "profile": null,
          "pub": "2018-05-09T12:13:54.847+02:00",
          "ref": "3460997001295973078",
          "type": "comment"
        },
        {
          "date": "16 May 2018 02:43",
          "html": "trying and succeeding i might add",
          "id": "5667669397331589221",
          "image": "https://resources.blogblog.com/img/blank.gif",
          "name": "Luca",
          "profile": null,
          "pub": "2018-05-16T02:43:00.238+02:00",
          "ref": "3460997001295973078",
          "type": "comment"
        }
      ],
      "date": "09 May 2018 10:53",
      "html": "&quot;figure out why Cisco pushes running EVPN EBGP sessions between loopback interfaces.&quot;<br /><br />Is this not because you want to be able to use ECMP? If you use the interface address and your network looks like:<br /><br />A ----- B<br />|  \\ /  |<br />ToR1 ToR2<br />  \\   / <br />   Rack<br /><br />Then if A advertises the EVPN routes from ToR1 with the next hop as ToR1&#39;s interface to A, you won&#39;t be able to split traffic to ToR1 via both A and B (as sending it via A will be a shorter path). So instead, you use the loopback address of the nodes for the eBGP sessions.<br /><br />Is that not true?",
      "id": "3460997001295973078",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2018-05-09T10:53:29.607+02:00",
      "ref": "9214390189016274086",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "22 June 2018 09:34",
          "html": "Life would be as easy as you describe it (and you&#39;re absolutely right) if only:<br /><br />* People wouldn&#39;t start using BGP as an IGP replacement, and then inventing crazy schemes like EBGP-over-EBGP or even worse IBGP-over-EBGP when they hit a wall;<br />* VXLAN ASICs would work like MPLS where you can stitch labels as AS boundary (Inter-AS Option B). Only Cisco can do VXLAN-to-VXLAN bridging, everyone else requires the next hop to remain unchanged.<br /><br />Finally, there&#39;s the &quot;small&quot; problem of automatic RT/RD - great idea, until someone rips out IBGP-over-IGP (the scenario for which EVPN was designed) and plugs in hop-by-hop EBGP (where every PE-switch has a different AS).",
          "id": "1466191337517951803",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2018-06-22T09:34:07.988+02:00",
          "ref": "1390125484546828717",
          "type": "comment"
        }
      ],
      "date": "21 June 2018 15:45",
      "html": "Uhm, is it just me or is this whole &quot;EVPN w/IBGP or EBGP&quot; debate solved the same way you&#39;d scale up any other large network?<br /><br />- each, say, metro area (but IGP area choice is arbitrary depending on the situation; maybe it&#39;s datacenters, maybe countries/regions/whatever) is an ASN, within which you have a single IGP area &amp; IBGP &quot;core full-mesh/edge RR client&quot; hierarchy. IGP is the limit on scale, which to stay quick &amp; reactive you want to keep comfortably under 1000 nodes per IGP domain (however well-tuned link-state IGPs will scale well beyond this, especially if the worst-case latency within the area is low).<br /><br /> - between e.g. metro areas (again, IGP area choice depends on requirements) you run EBGP (or BGP confeds, which amounts to pretty much the same thing) between ASBRs.",
      "id": "1390125484546828717",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Blake",
      "profile": "http://l33.fr",
      "pub": "2018-06-21T15:45:43.000+02:00",
      "ref": "9214390189016274086",
      "type": "comment"
    }
  ],
  "count": 15,
  "id": "9214390189016274086",
  "type": "post",
  "url": "2018/05/using-4-byte-bgp-as-numbers-with-evpn.html"
}