{
   "comments": [
      {
         "comments": [
            {
               "date": "05 February 2026 10:11",
               "html": "<p>Thanks a million!</p>\n",
               "id": "2871",
               "name": " Ivan Pepelnjak",
               "pub": "2026-02-05T10:11:07",
               "ref": "2870",
               "type": "comment"
            }
         ],
         "date": "05 February 2026 10:01",
         "html": "<p>LS-1010 was a further developed version of A100. Cisco has acquired a smaller company (LightStream) to get this product.</p>\n\n<p>LS-1010 was very much different from the competitors, since it had SVC support.</p>\n",
         "id": "2870",
         "name": "Bela Varkonyi",
         "pub": "2026-02-05T10:01:13",
         "type": "comment"
      },
      {
         "date": "05 February 2026 11:42",
         "html": "About the 75xx buses:<br />\n\n<p>&quot;CyBus&mdash;Cisco Extended Bus. A 1.067-gigabits-per-second (Gbps) data bus for\ninterface processors (two CyBuses are used in the Cisco 7507)&quot;</p>\n\n<p>For the Cisco 7513 &quot;The dual-CyBus backplane has 13 slots: six interface processor slots, 0 through 5 (CyBus 0), five interface processor slots, 8 through 12 (CyBus 1)&quot;</p>\n\n<p>I still remember one of my first tag switching POC shortly after I joined Cisco was with a 7200 with special software release (control plane) connected back to back to an ATM LS switch (data plane)</p>\n",
         "id": "2872",
         "name": " Emanuele",
         "pub": "2026-02-05T11:42:22",
         "type": "comment"
      },
      {
         "date": "05 February 2026 07:33",
         "html": "To add on that:<br />\nCell-mode MPLS was heavily dependent of ATM PNNI to enable the routers a dynamic set-up of switched virtual circuits (SVCs) within the ATM network.<br />\nNot sure when exactly PNNI was invented &amp; implemented and who came up with it, but I guess it must have been in the mid-90s...?<br />\n\n<p>PNNI itself is, iirc, in essence nothing more than the ATM-incarnation of CLNS using OSI addressing and IS-IS routing - one of (if not the only one?) the rare cases to meet CLNS in the wild outside of SONET/SDH networks back in late 1990s / early to mid-2000s...</p>\n\n<p>In frame-mode MPLS, ATM SVCs basically became LSPs and LDP (or RSVP) would take care of the &quot;circuit setup&quot;.</p>\n",
         "id": "2875",
         "name": "Christoph",
         "pub": "2026-02-05T19:33:55",
         "type": "comment"
      },
      {
         "date": "05 February 2026 10:03",
         "html": "<p>It&#39;s been a few years, but yeah, I&#39;m pretty sure it was Yakov who was behind Tag Switching.  I&#39;ve also seen a lot of people claiming that MPLS didn&#39;t provide faster forwarding, because it is all done in hardware. However, longest match required 4 lookups in the m-trie that was a 16-8-8 stride with the adjacency table being the 4th in CEF. A single exact match lookup on a label was much faster. In the end, if the forwarding ASIC is fast enough to run wire rate while still performing the 4 lookups, then it becomes moot.</p>\n",
         "id": "2876",
         "name": " Micah",
         "pub": "2026-02-05T22:03:26",
         "type": "comment"
      }
   ],
   "count": 4,
   "type": "post",
   "url": "2026/02/mpls-forwarding-performance.html"
}
