{
   "comments": [
      {
         "date": "12 May 2009 08:21",
         "html": "Do we really need to migrate towards ipv6 especially service provider? I am not able to collect there was some proposed solution where ipv4 depletion issues were raised a new solution was proposed which could save lot of ipv4 addresses.",
         "id": "6815371972713283872",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "shivlu jain",
         "profile": "http://shivlu.blogspot.com",
         "pub": "2009-05-12T08:21:00.000+02:00",
         "ref": "4705809504698473613",
         "type": "comment"
      },
      {
         "date": "12 May 2009 09:33",
         "html": "For multihoming in IPv6 I think we are going to default to what we do now in IPv4. You go get some PI space from RIPE/APNIC/ARIN etc and do BGP with your upstream, hierarchical addressing be dammed.",
         "id": "450562116156322409",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2009-05-12T09:33:00.000+02:00",
         "ref": "4705809504698473613",
         "type": "comment"
      },
      {
         "date": "12 May 2009 11:06",
         "html": "Yes, you've missed something.  It's been possible to get PI IPv6 space for quite some time, and the whole 'hierarchical' business went away quite some time ago.<br /><br />This produces other issues, which the LISP effort is intended to address (pardon the pun) via locator/EID separation:<br /><br />http://tools.ietf.org/html/draft-farinacci-lisp-12",
         "id": "5428156029190366428",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Roland Dobbins",
         "profile": "https://www.blogger.com/profile/06517186494484977438",
         "pub": "2009-05-12T11:06:00.000+02:00",
         "ref": "4705809504698473613",
         "type": "comment"
      },
      {
         "date": "12 May 2009 13:07",
         "html": "Amount of hype and lack of production-grade functionality surrounding the whole IPv6 business is staggering. It appears to me that all the goals that IPv6 set from beginning are being scrapped, one by one, as they were all solutions in a search of a problem.<br /><br />Anyone remembers \"advanced QoS\" that was supposed to be implemented wiyh IPv6? Not to mention the whole aggregation, that is now being scrapped, because people finally noticed the elephant?<br /><br />Apparently, noone noticed 800-pound gorilla, yet. The one that is not compatible with IPv4 in any reasonable way?<br /><br />On the other hand, when we started running out of ASN space, we added 2 byes and off we go. Why on earth can't we just do the same thing for IP addresses? Add 4 bytes, expand addresses to 64 bits, let them be compatible with IPv4 (0.0.0.0.A.B.C.D), call it IPv5 and to hell with the whole IPv6 business.",
         "id": "3416997760557881216",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Marko Milivojević",
         "profile": "https://www.blogger.com/profile/04119820131776913727",
         "pub": "2009-05-12T13:07:00.000+02:00",
         "ref": "4705809504698473613",
         "type": "comment"
      },
      {
         "date": "12 May 2009 14:00",
         "html": "I am so looking forward to the ipocalypse. As a freelance consultant, I can smell the money! Whoopee!",
         "id": "3730479019662146012",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Etherealmind",
         "profile": "http://etherealmind.com",
         "pub": "2009-05-12T14:00:00.000+02:00",
         "ref": "4705809504698473613",
         "type": "comment"
      },
      {
         "date": "12 May 2009 14:45",
         "html": "I somehow suspect that's the exact driving source behind the whole IPv6. In fact, that's the only one that makes sense, come to think of it.<br /><br />Oh, God. I want to be telco vendor when I grow up!",
         "id": "8511164713398918677",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Marko Milivojević",
         "profile": "https://www.blogger.com/profile/04119820131776913727",
         "pub": "2009-05-12T14:45:00.000+02:00",
         "ref": "4705809504698473613",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "22 December 2013 19:12",
               "html": "The most exciting feature for the end user is the freedom from the slavery of NAT and port forwarding. Sure, you can use NAT in IPv6 if you want, but dealing with UPnP and all sorts of VPN hacks was so annoying.",
               "id": "4772916450929158529",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "garegin",
               "profile": "https://www.blogger.com/profile/14508392154453584343",
               "pub": "2013-12-22T19:12:49.328+01:00",
               "ref": "8709139370418936644",
               "type": "comment"
            }
         ],
         "date": "12 May 2009 15:45",
         "html": "I do the old Picard facepalm (google it) when I read these comments. Granted some are fine (I must be talking about yours!) but most are well... facepalm material.<br /><br />The PI space is solved. You can get PI space in IPv6. Sure the rules are stricter but that's for a reason - long term scalability. This strictness helps enforce better network design. For the vast majority of cases, the people who *think* they require multihoming should just put their servers in colocation datacentres instead. Even if their precious server only has 1 IP, that IP is extremely reachable through all the different peers the CoLO ISP peers with. Also - the central placement of the server in the colo reduces latency and avails more bandwidth. Not to mention security, power redundancy, environmental conditioning etc.<br /><br />Also when you think 'outside the square' you'll find that a lot of the layer3 redundancy of PI space is actually solved at the application layer. Mail servers have MX preference values for redundancy. DNS lookups can return multiple A records. HSRP/VRRP/GLBP can work very will in place of BGP multihoming for client PCs.<br /><br />If we take the breastmilk of PI space away, then the babies will scream for a while, but applications will become smarter to fill the void and people will be forced into better network design.<br /><br />Onto another issue. Almost everyone seems to think of the expanded address space for IPv6 and somehow thing that's all there is too it. For me that's almost the least exciting aspect. I'm more excited by the simplified 64-bit aligned headers with no unnecessary checksumming, and the stripping out of broadcasts and intermediate router fragmentation, and the usefulness of the flow label.<br /><br />Expanding the address space of IPv6 is like putting a new coat of paint on an old Ford Pinto. We need to trash that and start driving the luxury vehicles of IPv6.",
         "id": "8709139370418936644",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2009-05-12T15:45:00.000+02:00",
         "ref": "4705809504698473613",
         "type": "comment"
      },
      {
         "date": "12 May 2009 15:47",
         "html": "^^ I meant \"Expanding the address space of IPv4\" sorry",
         "id": "4611914546126312172",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2009-05-12T15:47:00.000+02:00",
         "ref": "4705809504698473613",
         "type": "comment"
      },
      {
         "date": "12 May 2009 16:58",
         "html": "I'll bite.<br /><br />Luxury vehicles that require us to dump and throw away perfectly operational and working networks that we have been building for decades? Somehow I ain't seeing that. Reminds me of how ATM was there to save the world.<br /><br />Now, on another note. You mention all sorts of workarounds for the inherent problem with IPv6; basically defending the shortcomings of it, recommending such complex solutions for simple problem of multihoming. The very essence of good networks - simplicity, will be thrown away, just so IPv6 evangelists can live up to the expectations.<br /><br />Now, I don't want to sound pompeous, inflamatory, or like a troll, but I have been in this industry for about 15 years. I have read and looked at IPv6 for at least 10. It's always just around the corner and aafter each one, we are faced with another obstacle and another IPv4-like workaround for the problems. I just remembered DHCP. The original idea called for no DHCP, because autoconfiguration would take care of that. Then someone with actual operational experience pointed out to thinkers that DHCP is a must. Then we have ugly port of DHCP. <br /><br />What about MPLS? How does that work with IPv6? Sure, you don't need MPLS, as address space is so huge, there is no need for MPLS VPN's say thinkers. Experienced engineers say \"what about traffic separation?\". Oh, that. Let's invent 6VPN, but that requires IPv4 infrastructure, because we really don't know how to do label switching for IPv6... and so on.<br /><br />No, sorry. It's *far* from operational readiness. Far, far, from it.",
         "id": "5342883077231289881",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Marko Milivojević",
         "profile": "https://www.blogger.com/profile/04119820131776913727",
         "pub": "2009-05-12T16:58:00.000+02:00",
         "ref": "4705809504698473613",
         "type": "comment"
      },
      {
         "date": "12 May 2009 17:00",
         "html": "Sorry, it's 6PE, not 6VPN. Silly me.",
         "id": "1709171871741850799",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Marko Milivojević",
         "profile": "https://www.blogger.com/profile/04119820131776913727",
         "pub": "2009-05-12T17:00:00.000+02:00",
         "ref": "4705809504698473613",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "22 December 2013 19:33",
               "html": "we don&#39;t need DHCP in IPv4 either. For home users DHCP is prevalent only because of NAT in routers. In a simple LAN, the hosts can autoassign everything through zeroconf/mDNS. As far as I understand you <b>need</b> DHCP in PXE booting. So v6 won&#39;t help you there.",
               "id": "3469237214582635544",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "garegin",
               "profile": "https://www.blogger.com/profile/14508392154453584343",
               "pub": "2013-12-22T19:33:50.843+01:00",
               "ref": "356061083749713573",
               "type": "comment"
            }
         ],
         "date": "13 May 2009 08:36",
         "html": "I'll bite back.<br /><br />An IPv4 network close to address allocation exhaustion, held together with a whole bunch of NAT sticky-tape, about to collapse under the weight of its own routing tables (almost 300000 and growing!) whilst happily fragmenting packets and unnecessarily doing checksumming to boot is NOT the essence of a good network.<br /><br />Now to your criticisms.<br />DHCP - The autoconfiguration of IPv6 works fine in a lot of instances but there are times when you need DHCP for some setups. So what? The DHCPv6 doesn't seem any better or worse that DHCP for V4 so I don't see the issue.<br /><br />MPLS. Remember the \"M\" in MPLS stands for \"multiprotocol\". MPLS should be able to take IPv6 fine. And IPv6 can but used for next hop reachability (OSPFv3) and also LDP for v6. I suspect what you're describing is a limitation of Cisco and not of IPv6.",
         "id": "356061083749713573",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2009-05-13T08:36:00.000+02:00",
         "ref": "4705809504698473613",
         "type": "comment"
      },
      {
         "date": "14 May 2009 13:54",
         "html": "IMHO LDPv6 is in draft only, so it's far away from implementing",
         "id": "6744362153242620289",
         "image": "https://resources.blogblog.com/img/blank.gif",
         "name": "Anonymous",
         "profile": null,
         "pub": "2009-05-14T13:54:00.000+02:00",
         "ref": "4705809504698473613",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "23 December 2013 18:25",
               "html": "That draft might have solved simple cases, but it got nowhere in the last 2 years.",
               "id": "2969441807520224906",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "Ivan Pepelnjak",
               "profile": "https://www.blogger.com/profile/13457151406311272386",
               "pub": "2013-12-23T18:25:59.301+01:00",
               "ref": "6897870675164172861",
               "type": "comment"
            }
         ],
         "date": "23 December 2013 17:22",
         "html": "I wonder if the whole v6 multihoming issue is a made moot by the introduction of this? http://tools.ietf.org/html/draft-troan-multihoming-without-nat66-01<br />BTW does this site have a light markup support like textile. It is kind of annoying using html for comments.",
         "id": "6897870675164172861",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "garegin",
         "profile": "https://www.blogger.com/profile/14508392154453584343",
         "pub": "2013-12-23T17:22:05.582+01:00",
         "ref": "4705809504698473613",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "16 October 2023 08:45",
               "html": "<p>Yeah, SCTP was a known solution for decades. Unfortunately, it requires application-level changes due to the broken socket API. See:</p>\n\n<ul>\n<li>https://blog.ipspace.net/2009/08/what-went-wrong-socket-api.html</li>\n<li>https://blog.ipspace.net/2009/08/what-went-wrong-sctp.html</li>\n</ul>\n",
               "id": "1972",
               "name": "Ivan Pepelnjak",
               "pub": "2023-10-16T08:45:12",
               "ref": "1971",
               "type": "comment"
            }
         ],
         "date": "15 October 2023 10:43",
         "html": "<p>Related to linked posts, and recently updated, so I&#39;m putting this here - hope that is okay.</p>\n\n<p>SCTP allows for multihoming. And I found that SCTP over IPv6 was smooth sailing - see my blog post on this - https://milind.ravindranath.com/sctp-on-the-internet-baby-out-with-the-bathwater/</p>\n",
         "id": "1971",
         "name": " Milind R",
         "pub": "2023-10-15T22:43:01",
         "type": "comment"
      }
   ],
   "count": 14,
   "id": "4705809504698473613",
   "type": "post",
   "url": "2009/05/lack-of-ipv6-multihoming-elephant-in.html"
}
