{
  "comments": [
    {
      "date": "08 March 2012 10:16",
      "html": "A few hundred servers could easily fit on 4 or 5 proper ESXi hosts... why go through all the trouble? All you need is a pair of redundant switches and even a regular vSwitch would be fine :)<br /><br />Or are you talking about a few hundred ESXi hosts? in that case, would it still be SMB?",
      "id": "2553844548224698773",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Duncan",
      "profile": null,
      "pub": "2012-03-08T10:16:17.513+01:00",
      "ref": "6181537726036406964",
      "type": "comment"
    },
    {
      "date": "08 March 2012 12:34",
      "html": "Actually I had a few hundred physical servers in mind (the 4-5 ESXi hosts scenario is boring). Whether that&#39;s still SMB depends on the definition of M in the acronym :D",
      "id": "5347666916610347927",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ivan Pepelnjak",
      "profile": null,
      "pub": "2012-03-08T12:34:27.314+01:00",
      "ref": "6181537726036406964",
      "type": "comment"
    },
    {
      "date": "08 March 2012 14:36",
      "html": "LOL",
      "id": "2728796675529617606",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Duncan",
      "profile": null,
      "pub": "2012-03-08T14:36:28.125+01:00",
      "ref": "6181537726036406964",
      "type": "comment"
    },
    {
      "date": "08 March 2012 18:23",
      "html": "The trick is to not use spines...",
      "id": "7454163902955095665",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Wes Felter",
      "profile": null,
      "pub": "2012-03-08T18:23:30.945+01:00",
      "ref": "6181537726036406964",
      "type": "comment"
    },
    {
      "date": "08 March 2012 21:48",
      "html": "While everyone has their own set of definitions for SMB, IMHO, it is well below a &quot;few hundred&quot; physical servers.  It&#39;s very easy to count the clients that I&#39;ve seen have more than 200 phy hosts out of 250+ clients.  Regardless, I did say something along the same lines a few weeks back about vsphere/controller integration: <br />http://www.jedelman.com/1/post/2012/01/future-openflowsdn-applications.html - Thanks again for plugging it in your interesting links blog!  <br /><br />That type of integration is clutch for any OF/SDN vendor to win out in the SMB AND Enterprise quite simply because VMWare dominates in those market segments.<br /><br />Love the focus on the smaller customers though.",
      "id": "1850257770966239181",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "@jedelman8",
      "profile": null,
      "pub": "2012-03-08T21:48:33.958+01:00",
      "ref": "6181537726036406964",
      "type": "comment"
    },
    {
      "date": "10 March 2012 02:38",
      "html": "Yes, OpenFlow is a slam dunk in SMB.  Now, who&#39;s running the ONF again? Uh oh..",
      "id": "5172198016162733746",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Brad Hedlund",
      "profile": null,
      "pub": "2012-03-10T02:38:26.489+01:00",
      "ref": "6181537726036406964",
      "type": "comment"
    },
    {
      "date": "26 April 2012 14:59",
      "html": "Given my experiences with SMB-scale datacetners, there will be few VLANs, a couple of dozen at most. They have 100 or fewer physical servers. To achive proper VM mobility, most of their few VLANs are going to need to be defined on all of the (relatively few) switches in the small data-center.<br /><br />OpenFlow is a solution looking for a problem in this sort of SMB environment, and something like TRILL with a good centralized configuration management tool is much more attractive.<br /><br />SMBs typically have &quot;IT generalists&quot; on staff, not network specialists. Typically a few combination DBA/server/network engineers, who also have a little software development responsibility to boot. These folks need simple plug-and-play behavior more than anything else, and I suspect any OpenFlow-based solution will not be &quot;simple&quot; to implement for a long while.<br /><br />It&#39;s all well and good to have some consultants come in during implementation, but an SMB will not pay those same consultants long-term for maintenance and upgrades, so simplicity and maintainability is a primary business driver.<br /><br />This is why SMBs love VMware: vCenter is the closest thing to a &quot;single pane of glass&quot; for management the IT industry has ever produced, especially if your storage vendor has plug-ins. And it&#39;s quite simple to keep it running.",
      "id": "970680447519080282",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ryan Malayter",
      "profile": null,
      "pub": "2012-04-26T14:59:17.008+02:00",
      "ref": "6181537726036406964",
      "type": "comment"
    },
    {
      "date": "03 May 2012 15:19",
      "html": "Totally agree with you. OpenFlow would make sense if someone would implement a controller almost as a plug-in for vCenter (+ an OVF appliance) and sell the switches with color-coded cables to ensure proper wiring :D",
      "id": "2080239042654886199",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ivan Pepelnjak",
      "profile": null,
      "pub": "2012-05-03T15:19:30.348+02:00",
      "ref": "6181537726036406964",
      "type": "comment"
    }
  ],
  "count": 8,
  "id": "6181537726036406964",
  "type": "post",
  "url": "2012/03/openflow-perfect-tool-to-build-smb-data.html"
}