{
   "comments": [
      {
         "comments": [
            {
               "date": "11 February 2025 06:42",
               "html": "<p>Thank you. That &quot;sort of&quot; makes sense in the same way that I had to lie to many other devices that they should use a fake native VLAN, it&#39;s just that you have to create an extra fake subinterface on IOSv.</p>\n",
               "id": "2525",
               "name": "Ivan Pepelnjak",
               "pub": "2025-02-11T18:42:58",
               "ref": "2522",
               "type": "comment"
            }
         ],
         "date": "11 February 2025 03:19",
         "html": "<p>In IOS-XE (and IIRC in classic IOS, don&#39;t know for IOSv) you can configure a subinterface with vlan 1 tagging <em>if</em> there is already another subinterface with another vlan configured as native :</p>\n\n<p>interface GigabitEthernet0/0/1.700\n encapsulation dot1q 700 native\ninterface GigabitEthernet0/0/1.1\n encapsulation dot1q 1</p>\n\n<p>If you delete the Gi0/0/1.700, the native keyword is automagically added back on the Gi0/0/1.1 (and brokes whatever you tried to achieve) ... there should always be one native ! :-)</p>\n",
         "id": "2522",
         "name": " bjo",
         "pub": "2025-02-11T15:19:56",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "11 February 2025 06:41",
               "html": "<p>Well, TBH, most of the devices I tried to persuade to tag VLAN 1 had no <em>problems</em> tagging it, it was just that I had to try really hard to convince them to do so ;)</p>\n",
               "id": "2524",
               "name": "Ivan Pepelnjak",
               "pub": "2025-02-11T18:41:19",
               "ref": "2523",
               "type": "comment"
            },
            {
               "date": "11 February 2025 07:04",
               "html": "<p>For the mentioned examples VLAN 1 is special in that it already exists in the factory defaults. But, VLAN ID 1 is not so special that tagging or not would be handled differently to other VLAN IDs (COMWARE and VRP also support <em>trunk</em> ports with a native VLAN, but the <em>hybrid</em> configuration does away with this idea).</p>\n\n<p>A configuration examples for the obsolete Enterasys switches would be: <code>set vlan egress 1 ge.2.2 tagged</code></p>\n\n<p>For EXOS this would be: <code>configure vlan 1 add ports 2 tagged</code></p>\n\n<p>For any other VLAN ID, just replace the &quot;1&quot; with the other ID, the command is the same.</p>\n\n<p>On those switches, I never use(d) <em>any</em> untagged VLAN on an inter switch link (aka &quot;trunk&quot;). L2 protocol data units without VLAN tag work just fine on such links.</p>\n\n<p>In practice, I usually remove(d) VLAN 1 from every port, i.e., <code>clear vlan egress 1 *.*.*</code> on Enterasys and <code>configure vlan 1 delete ports all</code> on EXOS. (Yes, from factory defaults this removes all VLANs from all ports. One then adds what is really intended for static use.)</p>\n",
               "id": "2526",
               "name": "Erik Auerswald",
               "pub": "2025-02-11T19:04:03",
               "ref": "2524",
               "type": "comment"
            }
         ],
         "date": "11 February 2025 04:39",
         "html": "<p>Other vendor devices have no problem tagging VLAN 1, e.g., the old Enterasys switches, Extreme EXOS, HPE COMWARE (with hybrid ports), and Huawei VRP. Even Broadcom FASTPATH (found on some Quanta switches, for example) supports this.</p>\n\n<p>A VLAN interface on Linux always means &quot;tagged&quot;, including for VLAN ID 1 (that is probably the reason for the Cumulus behavior).</p>\n",
         "id": "2523",
         "name": "Erik Auerswald",
         "pub": "2025-02-11T16:39:04",
         "type": "comment"
      },
      {
         "date": "19 May 2025 11:49",
         "html": "<p>&quot;VLAN 1 wurde somit zum Standard-VLAN (das hei&szlig;t: das ist es, was wir f&uuml;r nicht markierte Pakete verwenden).&quot;</p>\n\n<p>Mir scheint dieser Artikel mit seiner seltsamen Sprache automatisch &uuml;bersetzt zu sein, und so kommt es wohl zu solchen Aussagen. In der IT-Sprache gibt es ein &quot;Default VLAN&quot; (das ist hier wohl mit &quot;Standard-VLAN&quot; gemeint), es wird &quot;getaggt&quot; und nicht markiert und das VLAN ohne Tags hei&szlig;t &quot;Native VLAN&quot; - und ist NICHT das &quot;Standard-VLAN&quot;.</p>\n",
         "id": "2638",
         "name": " Stefano Fereri",
         "pub": "2025-05-19T23:49:15",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2025/02/tagged-vlan-1.html"
}
