{
  "comments": [
    {
      "date": "09 June 2016 17:46",
      "html": "Agree with this completely. When we built out a few data centers and had the opportunity to do greenfield architecture, we looked very closely at our internal MPLS design and decided to run BGP over it. There was a fair amount of hesitation from the support staff, but we got through it. Primarily, we showed them a sample config and they were surprised at how simple it was... if I recall, they had been looking at a carrier&#39;s example of a BGP/MPLS config, which was far more complex. Since then, the entire WAN/LAN/edge is BGP. And against general recommendations, each campus or data center zone (production, development, etc...) has its own ASN. We found the configs and hassles of EBGP peering to be much simpler than IBGP peering. And we found it much easier to shift traffic around via prepend statement modifications during maintenance. With OSPF, messing with costs and priorities is fine, but you need to know the cost of all your paths, otherwise you&#39;ll get unintended results. BGP we rarely run into unexpected behavior. Just resist the urge to use all of the knobs BGP provides and the configs are relatively simple. It&#39;s not the solution for every problem, but we have no regrets now that it&#39;s been in place for several years.",
      "id": "4076028335936125355",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Unknown",
      "profile": "https://www.blogger.com/profile/01335898315678692950",
      "pub": "2016-06-09T17:46:42.045+02:00",
      "ref": "1163217313901716472",
      "type": "comment"
    },
    {
      "date": "09 June 2016 17:51",
      "html": "Always a good idea to know your tools, by that I mean experiment with them and actually take the time to read about them. Case in point I&#39;ve been using ping and traceroute for years, but all I knew about them was how to run them and read the results. When you take the time to read and learn about them  you really appreciate what they can and cannot do.  BTW I&#39;m terrified of any routing protocol actually more terrified of printing out the show commands and having to interpret them. But I only look at that maybe once a year.",
      "id": "596379838730251997",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "DourCdn",
      "profile": "https://www.blogger.com/profile/11864545777285752230",
      "pub": "2016-06-09T17:51:35.659+02:00",
      "ref": "1163217313901716472",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "09 June 2016 19:30",
          "html": "Thank you. Fixed.",
          "id": "3360402309062463771",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2016-06-09T19:30:17.018+02:00",
          "ref": "8067190009084381021",
          "type": "comment"
        },
        {
          "date": "16 June 2016 06:00",
          "html": "I&#39;m guessing there was a battle between the words &quot;within&quot; and &quot;throughout&quot; with both sides taking casualties, eh?",
          "id": "639031062474556666",
          "image": "https://resources.blogblog.com/img/blank.gif",
          "name": "Anonymous",
          "profile": null,
          "pub": "2016-06-16T06:00:28.888+02:00",
          "ref": "8067190009084381021",
          "type": "comment"
        }
      ],
      "date": "09 June 2016 19:22",
      "html": "Hi Ivan,<br /><br />&quot;If you have to carry a large set of prefixes without your routing domain...&quot;<br />I think here you meant &#39;within your routing domain.<br /><br />/Mohammad",
      "id": "8067190009084381021",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Unknown",
      "profile": "https://www.blogger.com/profile/15452464039180688994",
      "pub": "2016-06-09T19:22:13.766+02:00",
      "ref": "1163217313901716472",
      "type": "comment"
    },
    {
      "date": "10 June 2016 16:48",
      "html": "I think that OSPF is more complex than BGP. I always need to remeber the SLA types in the google, and the way to filter a prefix can be different depending of the SLA type.",
      "id": "5463135232350359405",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Unknown",
      "profile": "https://www.blogger.com/profile/04534992851403817890",
      "pub": "2016-06-10T16:48:40.319+02:00",
      "ref": "1163217313901716472",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "12 June 2016 15:43",
          "html": "Of course RR can influence B - by sending identical prefix with higher local preference or two more-specific prefixes with no-advertise community. In any case, it helps if you configure &quot;bgp advertise-best-external&quot;.<br /><br />IIRC some service providers implemented ideas along these lines more than a decade ago, and there was at least a product (if not more) out there doing something similar. Alas, the memories faded...",
          "id": "5721530762403937949",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2016-06-12T15:43:24.752+02:00",
          "ref": "6255695645479711589",
          "type": "comment"
        }
      ],
      "date": "12 June 2016 01:46",
      "html": "&quot;... instead of solving the problem the right way: building a policy server (call it an SDN controller to make marketers ecstatic) that acts as a BGP route reflector ...&quot;<br /><br />I don&#39;t think this would work.<br />At least not as simple as you might think it would be.<br /><br />Suppose this topology:<br />foreign peer A - my eBGP speaker B - my Route Reflector C, acting as policy server - my iBGP speakers D, E and F.<br /><br />Your idea would work fine for routers C, D, E and F. But what about eBGP speaker B ? It receives a prefix P from A. Advertises P to RR C. RR C applies policies to P. RR C advertises P to D, E and F. Works fine.<br /><br />But router B would not be subject to the policies of RR C. That would only work if B would not install prefix P in its BRIB, but only advertise it to RR C. Then RR C applies policies, and should advertise back to B. Then B can install the prefix P it got from RR C into its BRIB.<br /><br />A bit convoluted. And you&#39;ll need to really change the behaviour of BGP implementations for this to work. Which might mean this can&#39;t be introduced gradually, but requires all routers to be upgraded. Or using flag-days. Or a migration-scheme that is even harder than plain BGP.<br /><br />Nice rough idea. But it would require some extra thinking to make it work.",
      "id": "6255695645479711589",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Henk",
      "profile": null,
      "pub": "2016-06-12T01:46:38.460+02:00",
      "ref": "1163217313901716472",
      "type": "comment"
    },
    {
      "date": "17 June 2016 00:54",
      "html": "I believe BGP is one of the easiest and simplest routing protocol, and its also very predicatable. I prefer to use it over others when and where possible.",
      "id": "7894271220696523354",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Vaibhav",
      "profile": "http://www.nowebsiteavailable.com",
      "pub": "2016-06-17T00:54:55.484+02:00",
      "ref": "1163217313901716472",
      "type": "comment"
    },
    {
      "date": "22 February 2017 22:28",
      "html": "Is there a good (historical) summary of all the BGP RFCs, knobs and features. I&#39;m interested in fully learning the protocol. I&#39;d also like to get a perspective of what makes BGP in the DC simpler (so a diff between all the rules required for peering and transit networks and the smaller needs of a L3 DC).",
      "id": "1878288550276257235",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "nminwalla",
      "profile": "https://www.blogger.com/profile/15966716907431213800",
      "pub": "2017-02-22T22:28:25.717+01:00",
      "ref": "1163217313901716472",
      "type": "comment"
    }
  ],
  "count": 10,
  "id": "1163217313901716472",
  "type": "post",
  "url": "2016/06/is-bgp-really-that-complex.html"
}