{
  "comments": [
    {
      "date": "20 February 2009 17:32",
      "html": "Hi Ivan,<BR/><BR/>Very interesting observation, looking at the modulo to determine if these share the same root cause.<BR/>I created a list of longest ASpaths per day, starting with February 1st.<BR/>I added a feature that checks if number of prepends matches the low-order 8 bits of the offending AS number. Indicating that it's likely caused by the same bug.<BR/>The list can be found here: <BR/>  <BR/>http://bgpmon.net/maxASpath.php<BR/><BR/>Interesting is that the first time this was observed was actually on February 9th. I didn't hear anyone talk about that. However I do know that one of my upstreams experienced BGP problems (flaps) exactly at the time of the update. <BR/><BR/>Keep up the good work,<BR/> Andree",
      "id": "4422103255532028132",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2009-02-20T17:32:00.000+01:00",
      "ref": "871102671162332435",
      "type": "comment"
    },
    {
      "date": "20 February 2009 18:25",
      "html": "Fantastic tool. Will you post it to NANOG mailing list?<BR/><BR/>The huge impact on the Internet was caused by a Cisco bug, which was only triggered if the AS-path length was close enough to 255 and the AS-path prepending was used. <BR/><BR/>Obviously someone in the core was doing just the right amount of prepending to reset the BGP sessions and trigger the flood.<BR/><BR/>The first time the offending AS was far enough from the core that the eventual flaps were not noticed (although there had to be some non-IOS boxes in the path for you to get the AS-path length of 257).",
      "id": "5971723993551307619",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Ivan Pepelnjak",
      "profile": "https://www.blogger.com/profile/13457151406311272386",
      "pub": "2009-02-20T18:25:00.000+01:00",
      "ref": "871102671162332435",
      "type": "comment"
    }
  ],
  "count": 2,
  "id": "871102671162332435",
  "type": "post",
  "url": "2009/02/root-cause-analysis-oversized-as-paths.html"
}