{
  "comments": [
    {
      "date": "11 February 2009 09:28",
      "html": "Ivan,<BR/><BR/>thanks for dispelling the bull, as you always do. (It seems that some people do want to become the gold standard for \"tabloid press\" in networking.)<BR/><BR/>I might add that the attack also requires that the relays – that is, the single attacker, or the controlled zombies – are configured to use a DNS resolver that not only allows source IP spoofing, but is also willing to accept recursive queries from anyone in the network, including the victim.<BR/><BR/>As usual, the majority of resolvers do fit the criterion, as most administrators are too scared of BIND to configure it properly. Or, worse yet, in 2009 they are still running a single BIND instance for both the role of DNS server (to publish their own records) and the role of recursive resolver/cache (to perform full DNS resolutions for clients), so they simply <EM>must</EM> accept request from anyone.<BR/><BR/>As usual, some of the alternatives (including djbdns) are safe by default. But then again, an organization needs software such as BIND to justify dedicated hardware and craftsmen for DNS operation… :)",
      "id": "8319509009901083208",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "e.p.",
      "profile": "https://www.blogger.com/profile/16500553605448159568",
      "pub": "2009-02-11T09:28:00.000+01:00",
      "ref": "699982892380474554",
      "type": "comment"
    },
    {
      "date": "11 February 2009 17:44",
      "html": "Unfortunately, the attack does not require DNS servers that accept recursive queries.<BR/><BR/>You just need a large enough set of domains (you can get them from your web log files) and mapping between the domains and authoritative name servers (you do lookup for the domain's NS record). <BR/><BR/>Once you have this data, start sending large number of DNS queries with fake source IP addresses to the name servers. Each one of them <I>has to</I> reply to all queries for the domains for which it's an authority.",
      "id": "6918600863143589835",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Ivan Pepelnjak",
      "profile": "https://www.blogger.com/profile/13457151406311272386",
      "pub": "2009-02-11T17:44:00.000+01:00",
      "ref": "699982892380474554",
      "type": "comment"
    },
    {
      "date": "14 March 2009 16:27",
      "html": "---sending large number of DNS queries with fake source IP ----<BR/><BR/><BR/>is it even possible? i thought nobody could do that... how can someone do that?",
      "id": "5527122734702664690",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2009-03-14T16:27:00.000+01:00",
      "ref": "699982892380474554",
      "type": "comment"
    },
    {
      "date": "14 March 2009 18:18",
      "html": "Unfortunately numerous ISPs still don't have anti-spoofing filters on their customer-facing interfaces. If everyone would implement those filters, Internet would definitely be a safer place.",
      "id": "1895771843617453721",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "Ivan Pepelnjak",
      "profile": "https://www.blogger.com/profile/13457151406311272386",
      "pub": "2009-03-14T18:18:00.000+01:00",
      "ref": "699982892380474554",
      "type": "comment"
    }
  ],
  "count": 4,
  "id": "699982892380474554",
  "type": "post",
  "url": "2009/02/yellow-journalism-at-work-previously.html"
}