{
   "comments": [
      {
         "comments": [
            {
               "date": "03 May 2022 05:08",
               "html": "<p>Thank you! Updated the blog post.</p>\n",
               "id": "1202",
               "name": " Ivan Pepelnjak",
               "pub": "2022-05-03T17:08:05",
               "ref": "1197",
               "type": "comment"
            }
         ],
         "date": "03 May 2022 01:35",
         "html": "<p>Hi Ivan,</p>\n\n<p>as for footnote #3: I don&#39;t know what happend to the H3C company, but the products are still alive under HPE. Named &quot;FlexFabric&quot; (Datacenter) and &quot;FlexNetworks&quot; (Campus). The still run the ComwareOS (Version 7 now) and support EVPN/VXLAN. \nA hardware refresh happend last autumn. I know a few customer who use them in the campus or &#39;datacenter&#39; (10ish racks + VLANs) and the whole reason they use them is because &quot;We buy them every time&quot;. \nAruba launched a new SwitchOS (Aruba AOS-CX) a few years ago and they aim to built one OS for Access to Core to Datacenter. Works quite well for standard use cases including EVPN/VXLAN. \nBTW: Both Comware 7 and Aruba AOS-CX are available for virtualization, the last one free of charge.  </p>\n",
         "id": "1197",
         "name": " Philipp",
         "pub": "2022-05-03T13:35:42",
         "type": "comment"
      },
      {
         "date": "03 May 2022 06:37",
         "html": "<p>It would be good to understand why TRILL/SPB failed so we can avoid making the same mistake again. It seems that network vendors were blindsided by the much faster development velocity of the hypervisor/OS/cloud vendors.</p>\n",
         "id": "1203",
         "name": "Wes Felter",
         "pub": "2022-05-03T18:37:03",
         "type": "comment"
      },
      {
         "date": "03 May 2022 06:50",
         "html": "<p>Hi Ivan</p>\n\n<p>The extreme SPBM is alive and kicking.\nYou should ask Roger Lapuh for update&hellip;Extreme evolve the solution with ZTP Fabric ,ISIS Multi area &hellip;factors from CPE size to chassis.\nYes they do something different and that&rsquo;s IMO refreshing!!</p>\n",
         "id": "1204",
         "name": " Shay",
         "pub": "2022-05-03T18:50:07",
         "type": "comment"
      },
      {
         "date": "03 May 2022 07:39",
         "html": "A few comments regarding SPB:<br />\n\n<p>The Alcatel-Lucent Enterprise (ALE) OmniSwitch series and Extreme Networks VSP/ERS series (formerly Avaya and before that Nortel) are still supporting SPB with active production deployments. Extreme did not kill it after the Avaya acquisition and is still pushing it as Extreme FabricConnect. ALE is more quiet, but isn&#39;t showing any signs of deprecating it either. Both vendors support additional L3VPN capabilities on top of L2 virtualization regular 802.1aq/SPB provides. I wouldn&#39;t count on full interoperability between their implementations though.</p>\n\n<p>Nokia inherited an SPB implementation from the Alcatel-Lucent Service Provider line (SR series). I don&#39;t know if there are/were any significant production deployments. HPE/H3C had an implementation on some ComWare gear, but it&#39;s considered a legacy feature.</p>\n\n<p>Standardization efforts in the IETF seem to have halted completely (e.g. https://datatracker.ietf.org/doc/draft-unbehagen-spb-ip-ipvpn/ and https://datatracker.ietf.org/doc/draft-unbehagen-lldp-spb/). I don&#39;t if that&#39;s due to IETF politics or the vendors simply losing interest. On the IEEE side, at least some efforts seem to be going on https://1.ieee802.org/tsn/802-1qcj/ but who knows, as IEEE is mostly a walled garden.</p>\n\n<p>Although SPB is still a Layer 2 technology, there is a certain charm about its elegance and simplicity: A single IS-IS control plane for STP/Unicast Underlay Routing/Multicast Underlay Routing/Unicast Overlay Routing/Multicast Overlay Routing. VXLAN EVPN is much much more complicated in this regard.</p>\n\n<p>At least in campus networks SPB is still worth a consideration, if you&#39;re willing to accept niche vendors. VXLAN EVPN hasn&#39;t really reached budget-friendly access switches yet, there are budget-friendly SPBM switches available though.</p>\n",
         "id": "1205",
         "name": "Sebastian Schrader",
         "pub": "2022-05-03T19:39:50",
         "type": "comment"
      }
   ],
   "count": 4,
   "type": "post",
   "url": "2022/05/cisco-fabric-path-and-friends.html"
}
