{
   "comments": [
      {
         "date": "03 September 2020 11:19",
         "html": "<p>In my opinion one can start protecting critical network infrastructure from the very beginning. </p>\n\n<p>We know what are DNS servers for protected host, don&rsquo;t we? We know as well that usually local DNS server are forwarders. </p>\n\n<p>So it is possible to filter in host security policy outgoing DNS to permitted servers only. The same applies to NTP servers. </p>\n",
         "id": "110",
         "name": " Boris ",
         "pub": "2020-09-03T11:19:36",
         "type": "comment"
      },
      {
         "date": "03 September 2020 02:41",
         "html": "<p>Good blog!</p>\n\n<p>I have a cynical comment to make: I have NEVER found a customer application team that can tell me all the servers they are using, their IP addresses, let alone the ports they use. The <em>few</em> times I&#39;ve gotten actual documentation produced by the vendor who installed the app or the in-house team who wrote the app, the alleged documentation covers things like DB schemes, but not network flows. </p>\n\n<p>It&#39;s worse than that. My coworkers tell me that actually tracking down app owners is all too often excruciatingly painful, in part because their is no list of owners and contact info. And often they don&#39;t know much other than their next support or license renewal date. </p>\n\n<p>This not only hinders making FW rules, but it really hinders troubleshooting app problems. Yet no site I&#39;ve seen is pro-active about it. </p>\n\n<p>This has made me a big believer in products like Tetration and <strong>getting the actual flows documented to secure the servers and be ready in advance of application troubleshooting</strong>.</p>\n",
         "id": "111",
         "name": " Pete Welcher",
         "pub": "2020-09-03T14:41:23",
         "type": "comment"
      },
      {
         "date": "03 September 2020 06:14",
         "html": "<p>My company have customer. They had external audit and auditors reported lack of OS based firewall (multiple types of OSes). Nowadays customer have security rules at OS level but almost any application issue during new implementations etc leads in first step to blame network team for communication problems. </p>\n",
         "id": "112",
         "name": " Piotr",
         "pub": "2020-09-03T18:14:32",
         "type": "comment"
      },
      {
         "date": "03 September 2020 10:46",
         "html": "<p>I personally don&#39;t think that built-in or AV/Host-based firewall solution is reliable.i saw that how the System admin/Application developer turn off the OS/Host-based firewall because he/she think that it is the reason that some App-Stack is not working and think that any error in their APP is because of host firewall.also any breach to the OS can lead to turning of the built-in firewall by the intruder (i saw how intruder cripple the AV/HIPS agent on the OS that even re-installing the agent didn&#39;t work and we re-install the whole OS from the backup).for me the firewall should be always implemented in the network and out-of-the-box.again for me the micro-segmentation is better to be implemented  out-of the hypervisor as threat like VM-Escape is possible and common (many of them are zero-day and unknown) .if technology like VEPA (Ivan wrote about it years ago) supported on hypervisor we can put back security in Network-switch hardware (I know the TCAM limitation but the performance is much much better than OVS+DPDK and other fancy/impossible to implement Kernel-Bypass/Offload methods) .i think the vendor like Vmware don&#39;t like the technology like VEPA because they want to sell NSX.i tired 2 months to find a decent micro-segmentation solution for Vpshere without any success.everything is VMware world end with NSX.</p>\n",
         "id": "113",
         "name": " A.A",
         "pub": "2020-09-03T22:46:45",
         "type": "comment"
      },
      {
         "date": "03 September 2020 11:06",
         "html": "<p>In my experience using the Flow Data like NETFLOW can help to find how those App-Stack are communicating whit each other and then place the ACL for enforcement. last week i was tasked to put some VACL in Web-APP DMZ VLAN.i asked the App-Developers and those who support Applications that is there any connectivity between those Web-Servers ? they told me there is not any connection between those Web-server for sure and they only need to talk with their back-end DB that is on another VLAN/Segment protected by a classical Multi-Context-Firewall.i checked my Netflow logs for the last 3 months and i find too many API calls between those Web-servers on DMZ.if i trust those guys ,  i cloud create full disaster that could make the whole business down.after telling them that there are too many API calls , they said really ?</p>\n",
         "id": "114",
         "name": "A.A",
         "pub": "2020-09-03T23:06:37",
         "type": "comment"
      }
   ],
   "count": 5,
   "type": "post",
   "url": "2020/09/considerations-host-based-firewalls.html"
}
