{
   "comments": [
      {
         "date": "24 November 2021 05:54",
         "html": "<p>MPLS-T is more like classical ATM permanent VC.\nMPLS LDP is more like soft PVC in ATM.\nMPLS with RSVP/TE is more like PNNI in ATM.\nThe control planes are very similar and somewhat re-invented only. The big difference is the dropping of SAR, since at gigabit seeds it does not have enough advantage on managing the jitter, like it is absolutely beneficial at kilobit speeds. </p>\n\n<p>For me packet switching and VC are not contradictory. The term &quot;virtual&quot; denotes the usage of packet switching for simulating a TDM-style circuit behavior from the upper layers perspective. \nHow on earth could you do VC without an underlying packet switching?\nIn that sense ATM is also packet switching, just the packets are called &quot;cells&quot;.</p>\n\n<p>GMPLS can control classical physical, non-virtual circuits. Pure MPLS would not in the stricter term, if we do not limit it to the control plane, but we take it together with its data plane specifications.</p>\n\n<p>Centralized SDN is also nothing new. Just the reincarnation of telephone switch management through the DCN. Plus using IP instead of X.25/OSI and some trendier fashionable protocols instead of the old ITU-T X.stuff. But the basic architecture is very similar.\nThere are a lot of small networks where centralized SDN would not have a big problem. For example, the whole Hungarian telco network. Of course, this would be different in China... :-)</p>\n\n<p>Anycast might be limited by routing policies. It is easy in a private network. On the public Internet, you should not originate other addresses than what you really own. Otherwise, the other ISPs might filter your advertisements as security issues. This could be also be a problem in a multi-AS, multi-provider MPLS network that might limit the anycast scoping to special peering agreements. \nYou have a similar problem with mobile hosts or networks. It would not work by default in the public Internet. </p>\n",
         "id": "872",
         "name": "Bela Varkonyi",
         "pub": "2021-11-24T17:54:17",
         "type": "comment"
      }
   ],
   "count": 1,
   "type": "post",
   "url": "2021/11/anycast-principles.html"
}
