{
   "comments": [
      {
         "date": "13 November 2021 10:22",
         "html": "<p>Masterpiecie from an ingnorant in economics. Wasted 10min of my life. I suggest read some economic books first.</p>\n",
         "id": "845",
         "name": " Mike",
         "pub": "2021-11-13T10:22:26",
         "type": "comment"
      },
      {
         "date": "13 November 2021 12:33",
         "html": "<p>At that point I would love to see the owner of this blog answering in his (famous) line of questioning:</p>\n\n<p>What is Bitcoin?</p>\n\n<p>What problems is Bitcoin trying to solve?</p>\n\n<p>Does it (technologically) scale the way Bitcoin is trying to solve those problems?</p>\n",
         "id": "846",
         "name": "Anonymous",
         "pub": "2021-11-13T12:33:43",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "17 November 2021 12:13",
               "html": "<p>People waste energy for other stupid or disingenuous purposes like caf&eacute;s trying to heat open space with gas stoves or billionaires flying private jets to Davos to discuss climate... this does not disqualify bitcoin specifically.</p>\n",
               "id": "854",
               "name": " Matija",
               "pub": "2021-11-17T12:13:39",
               "ref": "848",
               "type": "comment"
            },
            {
               "date": "19 November 2021 03:04",
               "html": "<p>You seem lost. \nYeah Bitcoin is not the only waste of energy there is. Did i claim that? This article was about Bitcoin, hence (very obviously) i only commented on that. \nThat aside i don&#39;t think a Davos meeting wastes energy at the scale of above the energy consumption of a small industrial country like the Netherlands. That&#39;s the energy consumption of private households of 17 million people plus public facilities plus the whole economy. Not encompassing the energy and resource consumption of the hardware specifically built for bitcoin mining. </p>\n",
               "id": "858",
               "name": "Sam",
               "pub": "2021-11-19T15:04:53",
               "ref": "854",
               "type": "comment"
            }
         ],
         "date": "13 November 2021 05:17",
         "html": "<p>That wasn&#39;t a good article at all. \nHere are some actual things wrong with Bitcoin: </p>\n\n<ul>\n<li><p>As goes for all cryptocurrencies, there is no need for it as a currency. You want any currency to be stable and backed by a monetary authority that provides for that financial stability. Soon as you have a monetary authority, you are not in need of distributed ledger anymore. \nSee : https://eprint.iacr.org/2017/375.pdf\nAnd maybe also some humour: https://www.nytimes.com/2021/05/20/opinion/cryptocurrency-bitcoin.html</p></li>\n<li><p>Yearly energy consumption of Bitcoin mining that exists because of its Proof of Work Mechanism for transaction verification is estimated 116 TWh. In case anyone did not get the note within the last century, we are in a climate crisis (first UN climate convention was in 1979). <br />\nSee also: https://ccaf.io/cbeci/index</p></li>\n<li><p>Third reason(s) are its many technical deficencies. Just shortly the most important ones: The number of minable bitcoins is limited to approximately 21 million and the number of transactions are limited to 7 per second</p></li>\n</ul>\n\n<p>Summarisingly it&#39;s a well thought-out pyramid scam that keeps on being alive as a speculation object for people without conscience or awareness for its energy consumption, and with a lot of copycats trying to make quick money the same way.</p>\n",
         "id": "848",
         "name": " Sam",
         "pub": "2021-11-13T17:17:25",
         "type": "comment"
      },
      {
         "date": "14 November 2021 04:38",
         "html": "<p>&quot;In all of history, it is extremely doubtful that anybody has ever walked into a U.S. government office and demanded their gold in exchange for dollars.&quot;</p>\n\n<p>Fascinating...</p>\n\n<p>https://www.bullionstar.com/blogs/ronan-manly/british-requests-for-3-billion-in-us-treasury-gold-the-trigger-that-closed-the-gold-window</p>\n",
         "id": "850",
         "name": " ",
         "pub": "2021-11-14T04:38:16",
         "type": "comment"
      },
      {
         "date": "15 November 2021 04:43",
         "html": "<p>I&#39;ve never own Cryptos, and while the exponential increase in ROI of Cryptos in the past year looks enticing, I don&#39;t intend to get into it as I focus on different areas. In terms of technicality, all Blockchain Cryptos suffer from problems as pointed out above by Sam, plus scalability issues any networker worth his salt can easily recognize:</p>\n\n<p>https://cointelegraph.com/news/blockchain-scalability-current-challenges-and-potential-solutions</p>\n\n<p>So as a technology, Bitcoin and Blockchain are just meh, and it will probably never be a widely accepted currency. Proponents know this full well, so now they&#39;ve changed their tone, positioning it as a store of value. Whatever, that&#39;s not the point. The point is: BTC and cryptos in general, will be here to stay, due to 1) the simple fact that they&#39;re now seen as a fertile ground for Hedge fund managers to move their billion-dollar casino over, and 2)people are so f**king fed up with lying and autocratic govts, they will get into Blockchain to make money, using Greater Fool&#39;s Theory. </p>\n\n<p>Anyone who has missed these 2 important points, will never understand why Crypto will stubbornly remain in the market; it has nothing to do with the viability of technology, and everything to do with psychology. Of course prices will crash at some point, but the same thing applies to all classes of assets through cycles of markets. But with so many billionaires and big funds backing Crypto, no way it&#39;s gonna go away for good. It will keep returning, in one form or another.</p>\n\n<p>But Avery&#39;s article got worse; I&#39;d leave him alone if he didn&#39;t bring up markets/economics, but he&#39;s in way over his head and is an insult to people of intellect in the field. I&#39;ll give the guy full credit for being dumb, illiterate and selective-posting/cherry-picking, and zero credit for honesty and humility. Anyone who understands Finance and Markets will have to ask this guy: Do you even lift? </p>\n\n<p>Some examples:</p>\n\n<p>&quot;Gold is a stupid inconvenient currency that&#39;s worse than paper..&quot;</p>\n\n<p>Gold goes way further back into the history of money than fiat money. That&#39;s why after thousands of years, it&#39;s now positioned automatically in most people&#39;s minds as money, and due to the Lindy&#39;s effect, it won&#39;t be unseated. Deal with it. Gold doesn&#39;t lose value unlike Fiat, that&#39;s why it&#39;s been traditionally used throughout the ages as a store of value, an inflation hedge. Don&rsquo;t believe me? Look how gold prices keep going up when govts have been printing money since last year. </p>\n\n<p>In theory, a country&rsquo;s foreign exchange reserves were redeemable into gold when a holder presented them to the issuing country. The British requesting 3 billion dollars converted to gold is one example. To give a quote from the Death of Money, which I have read in its entirety:</p>\n\n<p>&quot;For central banks, the debate is over&mdash;gold is money. Today central banks are acquiring gold as a reserve asset at a pace not seen since the early 1970s, and this scramble for gold has profound implications for the future role of every currency, especially the U.S. dollar... Beginning in 2010, central banks became net buyers, with purchases rising sharply from less than 100 tonnes in 2010 to over 500 tonnes in 2012. In the ten-year span from 2002 to 2012, the shift from net sales to net purchases was over 1,000 tonnes per year, an amount greater than one-third of annual global mining output. Increasingly, gold is moving directly from mines to central bank vaults.&quot;</p>\n\n<p>&quot;Believing in the gold standard is disbelieving in capitalism&quot;</p>\n\n<p>What a fuckwit! Making money is no way unique to Capitalism. True Capitalism is about free market, entrepreneurship, hard work, and meritocracy. </p>\n\n<p>&quot;You produced actual value, and that value can be measured, and that measurement is called money. You made money. Out of nothing.&quot;</p>\n\n<p>See how he contradicts himself right there. You produce goods and services, and get money in return for that. It&#39;s not out of nothing. </p>\n\n<p>&quot;Compare with digging up useless coloured rocks and then hiding them in a fortress so nobody can see them. Those people make the economy go round?&quot;</p>\n\n<p>Big time! Mining requires a lot of components, and it generates jobs for people in other sectors, which in turn, creates goods and services in yet other areas, and the circle keeps expanding. This guy must have been on Acid trip when writing these lines, or he&#39;s totally illiterate about economy, or both.</p>\n\n<p>&quot;If the gold standard worked, the 1930s depression wouldn&#39;t have happened, and we couldn&#39;t have recovered, period, from the recent banking crisis.&quot;</p>\n\n<p>Classic cherry-picking from a simplistic idiot. Economy is a quintessential example of complex system where the sum is different from the parts, so complex problems like the Great Depression has complex causes. Have a read at this article for a better analysis of the true cause(s):</p>\n\n<p>https://www.forbes.com/sites/ralphbenko/2014/04/28/is-james-rickards-right-about-a-coming-monetary-apocalypse/?sh=8045bb1a493e</p>\n\n<p>The short version is Central Banks blundering and interfering with market mechanism -- which is the antithesis of Capitalism&#39;s price discovery -- among other causes including regime uncertainty. Rickards spent 35 yrs on Wall Street and was the lawyer of LTCM Fund -- LTCM caused the 1997&#39;s Financial Crisis that was on the verge of bringing down the whole world&#39;s financial system -- so he got skin in the game and knew far more about real market history and mechanisms than most useless economists, some of whom are clearly Avery&#39;s false idols. And sorry to disabuse him, but no, technically we&rsquo;re not recovered from the 2008 crisis. It might be over for the likes of him and his former employer Google who benefit from out-of-control money printing that inflates asset prices at the expense of the working class, but it&rsquo;s not over for the latter. The wealth gap has increased, all thanks to loose monetary policy. And partly because of that, people jump into Crypto.  </p>\n\n<p>&quot;The ability of governments to print (and destroy) money is a key tool in economic management.&quot;</p>\n\n<p>Easier said than done. Look how much money was printed between 2008-2013 following the global financial crisis. How much of it has been destroyed? What happened when the Fed was trying to raise rate early 2018? The Dow crashed instantaneously and so badly they had to reverse their stance. This is the price of detaching from a gold standard. Sooner or later it leads to out-of-control money printing, massive debt that&#39;s totally unpayable &ndash; check the ratio of debt vs GDP now in Japan and the US for ex, and hyperinflation. Look around. How much money has been printed since last year, and what did it lead to? Price hike in commodities everywhere you look, inflation everywhere and working-class people getting poorer. So much for a stupid theory devised by dumb-ass economists and implemented by their govt buddies. </p>\n\n<p>The economy would be in much better shape if economists were disallowed to give advice on economic policies. They should stick to what they do best: fooling around with fancy math and rubbish theories like Efficient Market theory, Random Walk, Rational Market Behaviour, Game theory, MMT etc. LTCM was run by 2 Nobel prize winners in Economics, and it almost destroyed the whole Financial System. And don&#39;t forget the subprime crisis in 2007. So when it comes to economists, I&rsquo;ll take Buffett&rsquo;s stance: &ldquo;Every company that has an economist working for him has one employee too many.&rdquo; Economics is mostly charlatanism, and what they teach in schools is mainly poison. </p>\n\n<p>Last but not least, government interference is against Capitalism, so he&#39;s shooting himself in the foot again with this point. Dumb-f**ked policies led to the creation of a massive derivative market, which Buffett called weapons of mass destruction. Credit Default Swap, a derivative product, was what contributed to the severity of subprime crash. </p>\n\n<p>What&rsquo;s big govt? It&rsquo;s call Socialism/Communism. Govts don&rsquo;t know shit about running the economy, so they should 1)be small and 2)get out of the way of  Markets. </p>\n",
         "id": "851",
         "name": "Minh",
         "pub": "2021-11-15T04:43:02",
         "type": "comment"
      },
      {
         "date": "11 July 2025 02:54",
         "html": "<p>&#xFEFF;I was scammed of $179,000 worth of bitcoin with a scam forest investment unknowingly then, I didn&rsquo;t know what to do.. I felt like committing suicide, but fortunately for me, my friend introduced me to a cyber crime investigator Mr Darek who also helps in recovering lost invested funds, After working with him, to my greatest surprise, in just few days I got all my lost funds back, and he only took just 15% out of the recovered funds, if you have been scammed with fake forex you don&rsquo;t need to be scared or worried, because you can also reach him on his email: (darekrecoverys@gmail.com)\n&#xFEFF;He will recover your lost bitcoins back fast and smoothly...</p>\n",
         "id": "2701",
         "name": " Latricka Shell",
         "pub": "2025-07-11T14:54:48",
         "type": "comment"
      }
   ],
   "count": 6,
   "type": "post",
   "url": "2021/11/worth-reading-bitcoin-fail.html"
}
