{
   "comments": [
      {
         "date": "13 November 2021 10:22",
         "html": "<p>Masterpiecie from an ingnorant in economics. Wasted 10min of my life. I suggest read some economic books first.</p>\n",
         "id": "845",
         "name": " Mike",
         "pub": "2021-11-13T10:22:26",
         "type": "comment"
      },
      {
         "date": "13 November 2021 12:33",
         "html": "<p>At that point I would love to see the owner of this blog answering in his (famous) line of questioning:</p>\n\n<p>What is Bitcoin?</p>\n\n<p>What problems is Bitcoin trying to solve?</p>\n\n<p>Does it (technologically) scale the way Bitcoin is trying to solve those problems?</p>\n",
         "id": "846",
         "name": "Anonymous",
         "pub": "2021-11-13T12:33:43",
         "type": "comment"
      },
      {
         "date": "13 November 2021 05:17",
         "html": "<p>That wasn&#39;t a good article at all. \nHere are some actual things wrong with Bitcoin: </p>\n\n<ul>\n<li><p>As goes for all cryptocurrencies, there is no need for it as a currency. You want any currency to be stable and backed by a monetary authority that provides for that financial stability. Soon as you have a monetary authority, you are not in need of distributed ledger anymore. \nSee : https://eprint.iacr.org/2017/375.pdf\nAnd maybe also some humour: https://www.nytimes.com/2021/05/20/opinion/cryptocurrency-bitcoin.html</p></li>\n<li><p>Yearly energy consumption of Bitcoin mining that exists because of its Proof of Work Mechanism for transaction verification is estimated 116 TWh. In case anyone did not get the note within the last century, we are in a climate crisis (first UN climate convention was in 1979). <br />\nSee also: https://ccaf.io/cbeci/index</p></li>\n<li><p>Third reason(s) are its many technical deficencies. Just shortly the most important ones: The number of minable bitcoins is limited to approximately 21 million and the number of transactions are limited to 7 per second</p></li>\n</ul>\n\n<p>Summarisingly it&#39;s a well thought-out pyramid scam that keeps on being alive as a speculation object for people without conscience or awareness for its energy consumption, and with a lot of copycats trying to make quick money the same way.</p>\n",
         "id": "848",
         "name": " Sam",
         "pub": "2021-11-13T17:17:25",
         "type": "comment"
      },
      {
         "date": "14 November 2021 04:38",
         "html": "<p>&quot;In all of history, it is extremely doubtful that anybody has ever walked into a U.S. government office and demanded their gold in exchange for dollars.&quot;</p>\n\n<p>Fascinating...</p>\n\n<p>https://www.bullionstar.com/blogs/ronan-manly/british-requests-for-3-billion-in-us-treasury-gold-the-trigger-that-closed-the-gold-window</p>\n",
         "id": "850",
         "name": " ",
         "pub": "2021-11-14T04:38:16",
         "type": "comment"
      }
   ],
   "count": 4,
   "type": "post",
   "url": "2021/11/worth-reading-bitcoin-fail.html"
}
