{
   "comments": [
      {
         "date": "01 December 2020 09:10",
         "html": "<p>End-to-end high-availability is always the best, I fully agree. That is why in safety critical networks we have ED-137 linked session, or the 4-times-simulcasted ARTAS radar streams. </p>\n\n<p>What is funny that even in-chassis redundancy in network devices still does not work well after three decades of development. We have daily problems that this feature or that feature is broken when there is an automated failover from one processor to the other. The background synchronization is difficult and they did no want to create a full transaction journalling, since that is expensive.</p>\n\n<p>If you have to implement high-availability in the infrastructure, then it is a sign that the applications are not designed very well for this purpose. Keep in mind that your infrastructure HA solution is just a compensation control for the weaknesses of the application.</p>\n",
         "id": "271",
         "name": "Bela Varkonyi",
         "pub": "2020-12-01T09:10:52",
         "type": "comment"
      },
      {
         "date": "01 December 2020 01:10",
         "html": "<p>How to solve then the TCP session state problem on load balancer or server if they go down so that the end-user doesn&#39;t have to press the reload button? (Ignoring the question for a moment if it&#39;s worth solving this problem or not.)</p>\n",
         "id": "273",
         "name": "Anonymous",
         "pub": "2020-12-01T13:10:03",
         "type": "comment"
      },
      {
         "date": "01 December 2020 03:50",
         "html": "<p>@Anonymous: Nobody has managed to migrate an existing TCP session to another server (at least I&#39;m not aware of that). It&#39;s not just the state of various TCP counters and windows, the second server would have to know what the first server already did with the request(s).</p>\n\n<p>The only solution is to have an application-level library that understands that TCP is <strong>not</strong> a 100% reliable transport protocol and acts accordingly.</p>\n\n<p>@Bela: I love the &quot;infrastructure HA is just a compensation control for application weaknesses&quot;. Thanks a million!</p>\n",
         "id": "274",
         "name": "Ivan Pepelnjak",
         "pub": "2020-12-01T15:50:04",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2020/12/50-shades-high-availability.html"
}
