{
   "comments": [
      {
         "date": "10 December 2020 03:05",
         "html": "<p>This is not really a surprise for me. Your comments apply to almost any CS topic that students learn at university. On one hand universities courses aim at giving to the students courses on the principles that last for many years and illustrate them on actual technologies, knowing that when the students graduate the popular technology might have changed. The main thing that students learn at university is to become better learners by having a wide background. If industry accepts that and provides some training/mentoring when students start their professional career, both students and industry benefit. If industry believes that students will be immediately skilled to the current technology, the result will be far from perfect...  </p>\n",
         "id": "301",
         "name": "Olivier Bonaventure",
         "pub": "2020-12-10T15:05:25",
         "type": "comment"
      },
      {
         "date": "11 December 2020 08:34",
         "html": "<p>Ivan. Great observations! No matter that fundamentals matter, the target audience for physics (of DWDM wavelegths etc.) is too small and the content is most probably too specific even for Computer Science students. Well, some queueing theory ... maybe more applicable both in networking as well as in software. I agree - the internal mentored programs are the ones that finally put all the pieces together, put them in the context of what the network engineers will really face, and add some people skills on top of that - so that they feel comfortable when encountering problems and customers :-)</p>\n",
         "id": "303",
         "name": "Marjan Bradesko",
         "pub": "2020-12-11T08:34:28",
         "type": "comment"
      },
      {
         "date": "11 December 2020 10:45",
         "html": "<p>Ivan, nice observation. Fundamental concepts are essential! My data sharing experience at university was paper-tape and punch cards ..... and now.....in only half of a lifetime. :-)</p>\n",
         "id": "304",
         "name": " TugoB",
         "pub": "2020-12-11T10:45:16",
         "type": "comment"
      },
      {
         "date": "20 December 2020 04:44",
         "html": "<p>Hi all, <br />\nUniversity gives you the skills you need in order to deal with complexity. University cannot provide the granularity and the verticality a good networking course requires.  That&#39;s a company&#39;s duty and it&#39;s thus mandatory for a company to train employees. I remember being surprised at seeing the best programmers being people with a background in philosophy or physics (!!) when I was in Italy. <br />\nAlso, there&#39;s a massive difference between the pragmatic approach of the Anglo-Saxon universities and the theoretical/pure approach of European universities with no multiple-choice exams but old fashion written and oral parts for any of the exams. I am more than convinced that the best approach ever is for a company to hire youngsters with a pure/theoretical academic knowledge and to provide networking training rather than cutting corners (training is perceived as a cost rather than an investment..) by looking for someone half-baked networking-certified as part of a pragmatical/practical degree course itself. <br />\nThis is how human brain works afterall - this is not new as it is what neurosciences say and what we see applied in neural-networks/deep-learning with the issue of overfitting vs generalisation. Doing a whatever deep/vertical networking course at university and giving up on or stealing time to theory is detrimental since that leads to overfitting. What I mean is that you end up with half-baked graduates/employees since they have overfitted on the CCNA whatever data as such !!! The damage is that companies think they need no training or little training or, even worse, they are trained but they are not as trainable as someone with a strong theory knowledge as they have overfitted on the CCNA course since they &lsquo;memorised&rsquo; it. They lack the required generalisation skill that only a pure theoretical university degree can give you. So, no corner-cutting please to save money as it&rsquo;s not a savings at all. Do employ a graduate with a strong classical/pure academic knowledge and then send him/her on an Ivan&#39;s course for instance and your company will fly !!!!!  </p>\n\n<p>Cheers/Ciao  </p>\n\n<p>Andrea   </p>\n",
         "id": "323",
         "name": " andrea di donato",
         "pub": "2020-12-20T16:44:16",
         "type": "comment"
      },
      {
         "date": "23 March 2021 12:48",
         "html": "<p>There are some schools out there who have recognized this gap and try to balance network fundamentals (full courses dedicated to CCNA/CCNP) with computer science fundamentals and problem solving. For example, in Canada there&#39;s a joint public  university/college program:  https://bitdegree.ca/index.php?Program=NET</p>\n",
         "id": "494",
         "name": "AnonymousNetworker",
         "pub": "2021-03-23T00:48:27",
         "type": "comment"
      }
   ],
   "count": 5,
   "type": "post",
   "url": "2020/12/networking-fundamentals-comp-sci.html"
}
