{
   "comments": [
      {
         "date": "10 December 2020 03:05",
         "html": "<p>This is not really a surprise for me. Your comments apply to almost any CS topic that students learn at university. On one hand universities courses aim at giving to the students courses on the principles that last for many years and illustrate them on actual technologies, knowing that when the students graduate the popular technology might have changed. The main thing that students learn at university is to become better learners by having a wide background. If industry accepts that and provides some training/mentoring when students start their professional career, both students and industry benefit. If industry believes that students will be immediately skilled to the current technology, the result will be far from perfect...  </p>\n",
         "id": "301",
         "name": "Olivier Bonaventure",
         "pub": "2020-12-10T15:05:25",
         "type": "comment"
      },
      {
         "date": "11 December 2020 08:34",
         "html": "<p>Ivan. Great observations! No matter that fundamentals matter, the target audience for physics (of DWDM wavelegths etc.) is too small and the content is most probably too specific even for Computer Science students. Well, some queueing theory ... maybe more applicable both in networking as well as in software. I agree - the internal mentored programs are the ones that finally put all the pieces together, put them in the context of what the network engineers will really face, and add some people skills on top of that - so that they feel comfortable when encountering problems and customers :-)</p>\n",
         "id": "303",
         "name": "Marjan Bradesko",
         "pub": "2020-12-11T08:34:28",
         "type": "comment"
      },
      {
         "date": "11 December 2020 10:45",
         "html": "<p>Ivan, nice observation. Fundamental concepts are essential! My data sharing experience at university was paper-tape and punch cards ..... and now.....in only half of a lifetime. :-)</p>\n",
         "id": "304",
         "name": " TugoB",
         "pub": "2020-12-11T10:45:16",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2020/12/networking-fundamentals-comp-sci.html"
}
