{
   "comments": [
      {
         "date": "08 December 2020 11:57",
         "html": "<p>Have you looked at Suzieq since you had us on your show? https://github.com/netenglabs/suzieq. I think it&#39;s a better platform for gathering that kind of data than Ansible. I looked quickly at your examples and I think Suzieq already collects that data. It then stores it in a vendor neutral format, and allows you to easily ask questions, rather than having to write your own code. I think it&#39;s great for integrating into automation as pre/post check, but we need to do a better job of documenting how that would work and the advantages.</p>\n\n<p>cheers,\nJustin</p>\n",
         "id": "298",
         "name": " Justin Pietsch",
         "pub": "2020-12-08T23:57:08",
         "type": "comment"
      },
      {
         "date": "10 December 2020 07:10",
         "html": "<p>Hi Justin! You know I love Suzieq, and if anyone ever asks me about a generic data gathering framework, Ansible would be pretty far down the list.</p>\n\n<p>However, sometimes you need information from the device to validate your data model, or you want to do post-deployment validation using the same tool, or you want to grab some data and create a report without investing into yet-another platform, or...</p>\n\n<p>In those cases, the hammer lying nearby is just what you need, even when you&#39;re dealing with squeaky disc brakes ;)</p>\n",
         "id": "302",
         "name": "Ivan Pepelnjak",
         "pub": "2020-12-10T19:10:31",
         "type": "comment"
      },
      {
         "date": "12 December 2020 11:21",
         "html": "It feels like you are trying to be practical : ) I appreciate your point of view and agree its good to let people know how to do these things. In general, I think this kind of data gathering is more general and people shouldn&#39;t think of it as one-off, they should figure out how to get this kind of data all the time.<br />\n\n\n",
         "id": "310",
         "name": "Justin Pietsch",
         "pub": "2020-12-12T23:21:07",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2020/12/updated-ansible-parsing-content.html"
}
