{
  "comments": [
    {
      "date": "02 November 2011 22:02",
      "html": "I actually believe the Native OpenFlow Nirvana could be attained in datacenters space in not so distant future.  (I mean the routing/switching infrastructure, not loadbalancers, stateful firewalls and the like)<br /><br />First, OOB management is fairly common in DC environments (as you pointed out QFabric uses a similar approach), so this requirement is not a big deal.  Second, I&#39;m sure at least some the ONF players recognize the importance of &quot;fast control loops&quot; and we will see mechanisms supporting offload of these to dumb switches in OF1.x or 2.y.  Third, as OF is still in its infancy, I would not worry too much about vendor extensions - if successful, they may eventually make it to the standard OpenFlow spec before we start building our &quot;nirvana DC&quot;.<br /><br />There&#39;s still an issue of communicating with the non-OF world, to which we may see some interesting solutions, Juniper&#39;s integrated approach being one of, especially when combined with BGP speaking DC edge enabling granular control of traffic flows in/out of the DC.  For large distributed networks this could also provide the required inter-DC failure domain separation with a stable routing protocol implementation.",
      "id": "4193886688193511715",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Michal Zawirski",
      "profile": null,
      "pub": "2011-11-02T22:02:51.464+01:00",
      "ref": "7647906309183857376",
      "type": "comment"
    },
    {
      "date": "03 November 2011 03:52",
      "html": "I&#39;ve been really enjoying your OpenFlow discussion on this blog and on the Packet Pushers podcast - thanks!",
      "id": "6865396730760161539",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Mike Courtney",
      "profile": null,
      "pub": "2011-11-03T03:52:24.273+01:00",
      "ref": "7647906309183857376",
      "type": "comment"
    },
    {
      "date": "08 November 2011 08:21",
      "html": "Excellent article (as always) and what I like most is a magnificient view of my native city at night :)",
      "id": "565734425096023644",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Kirill",
      "profile": null,
      "pub": "2011-11-08T08:21:13.888+01:00",
      "ref": "7647906309183857376",
      "type": "comment"
    }
  ],
  "count": 3,
  "id": "7647906309183857376",
  "type": "post",
  "url": "2011/11/openflow-deployment-models.html"
}