{
  "comments": [
    {
      "date": "29 November 2011 21:49",
      "html": "I want to point out that many Cloud Environments do leverage solutions like vSphere DRS and as such you will see migrations within a cloud environment. Yes you might guarantee an X amount of resource to a tenant, but these resources are carved out of a Cluster of Hosts and this cluster will need to be balanced to increase the ROI for the provider and guarantee resources.",
      "id": "4327137794817430110",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Duncan Epping",
      "profile": null,
      "pub": "2011-11-29T21:49:03.617+01:00",
      "ref": "1630150333619988114",
      "type": "comment"
    },
    {
      "date": "29 November 2011 22:53",
      "html": "Agree with Duncan here. vSphere-based cloud environments are increasingly implementing automatic live migration using VMware DRS. This typically happens with maturity: as the provider implements capacity management techniques like overcommitment and going forward spot markets, etc. If not common today, this is a design pattern that will continue to increase not decrease. VMware is continuing to build cloud management systems assuming DRS best to assume it&#39;ll be present in datacenter designs for the forseeable future.",
      "id": "5687499113306534340",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Irfan Ahmad",
      "profile": null,
      "pub": "2011-11-29T22:53:19.005+01:00",
      "ref": "1630150333619988114",
      "type": "comment"
    },
    {
      "date": "30 November 2011 05:03",
      "html": "Agreeing with Ivan -- can&#39;t compare apples with oranges.  If I could sum up my experience -- tradeoffs are required when the optimization of physical spaces (DC, rack, compute, storage, etc) and the optimization of network spaces (subnets, vlans, vpns, etc) cannot be aligned.  This problem is encountered by everyone that need to produce economies of scale with their space, storage, compute and network assets.",
      "id": "8032519085375743233",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "FullMesh",
      "profile": null,
      "pub": "2011-11-30T05:03:56.267+01:00",
      "ref": "1630150333619988114",
      "type": "comment"
    },
    {
      "date": "30 November 2011 10:24",
      "html": "Ivan, agreed with your analysis although (as Duncan / Irfan) I have to say your assumption about cloud mobility may be not totally true. I believe what you are describing is the Amazon model where there is a fix amount of resources that you are buying (and you are charged for). Not this is true for CPU and Memory but it is really the Network and the Storage the subsystems where you experience the famous neighborhood problem (http://alan.blog-city.com/has_amazon_ec2_become_over_subscribed.htm). To the point where users decide to buy larger instances just to avoid having to share a server with other people that could cause the noise. <br /><br />I am not bashing Amazon at all. It is just one of the model you can implement a cloud. There are other models of creating a cloud where you can sell capacity to an end user and enforce SLAs on all subsystems (CPU / Memory / Disks / Networks) by using a mix of guarantees, shares, DRS, mobility etc etc etc. <br /><br />As you said it depends. It really depends what you are doing. There isn&#39;t a one size fits all here. Some people call the latter the &quot;Enterprise&quot; way to do it whereas other people call the former the &quot;Real Cloud&quot; way to do things. <br /><br />Honestly, I can&#39;t give a s**t about the definitions any more... I am just trying to stay on what customers want. <br /><br />Massimo.",
      "id": "4944251685689312076",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2011-11-30T10:24:40.370+01:00",
      "ref": "1630150333619988114",
      "type": "comment"
    },
    {
      "date": "30 November 2011 10:25",
      "html": "Sorry Ivan, forgot to put down my name and company in the previous post. Well you probably figured that out ;)",
      "id": "8834100512230210093",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Massimo Re Ferre' (VMware)",
      "profile": null,
      "pub": "2011-11-30T10:25:29.763+01:00",
      "ref": "1630150333619988114",
      "type": "comment"
    },
    {
      "date": "30 November 2011 11:29",
      "html": "The moment I&#39;ve seen &quot;Massimo&quot; at the end, you lost your invisibility cloak ;) Thanks for the comment!",
      "id": "6205936428034497182",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Ivan Pepelnjak",
      "profile": null,
      "pub": "2011-11-30T11:29:10.681+01:00",
      "ref": "1630150333619988114",
      "type": "comment"
    },
    {
      "date": "30 November 2011 12:35",
      "html": "LOL",
      "id": "5218552759565064176",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Massimo Re Ferre' (VMware)",
      "profile": null,
      "pub": "2011-11-30T12:35:59.033+01:00",
      "ref": "1630150333619988114",
      "type": "comment"
    }
  ],
  "count": 7,
  "id": "1630150333619988114",
  "type": "post",
  "url": "2011/11/virtual-switches-from-simple-to.html"
}