{
  "comments": [
    {
      "date": "06 January 2014 23:19",
      "html": "Somebody who gets paid real money left that comment only few days ago? That idiot should be fired immediately",
      "id": "1261817448124152406",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2014-01-06T23:19:31.968+01:00",
      "ref": "3973234917500235696",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "07 January 2014 23:20",
          "html": "P2P SIP.<br /><br />Doesn&#39;t exist at all though, despite how flamingly obvious it is.<br /><br />In every client I&#39;ve looked at, when support is advertised at all it turns out to be either fictitious, or IPv4-only. This despite the ugly latency problems that going through a registrar introduces.<br /><br />I find it more than a little suspicious, really. There seems to be absolutely phenomenal resistance on the part of client developers to doing SIP without a registrar, even though the not-inconsiderable bandwidth the registrars consume generally gets paid for either out of their own pockets or those of their sponsors. Just who the hell goes that far out of their way to insist that strangers take their money, whether they want to or not?<br /><br />Nobody, that&#39;s who.<br /><br />So I&#39;m forced to consider that maybe there&#39;s something more going on here than meets the eye. It&#39;s not too hard to guess at it, either. Who would want to get in the middle of all those conversations? Who is known to have compromised SIP&#39;s biggest proprietary rival, Skype? Yeah.",
          "id": "8034868925061686104",
          "image": "https://resources.blogblog.com/img/blank.gif",
          "name": "Anonymous",
          "profile": null,
          "pub": "2014-01-07T23:20:56.686+01:00",
          "ref": "8207124799353561882",
          "type": "comment"
        }
      ],
      "date": "07 January 2014 05:03",
      "html": "There are a *lot* of networking engineers out there who don&#39;t understand IPv6, don&#39;t want to understand IPv6 and are really digging their heels in.<br /><br />We need a truly great IPv6 only app or service to really drive adoption,",
      "id": "8207124799353561882",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Alf Watt",
      "profile": "http://istumbler.net",
      "pub": "2014-01-07T05:03:58.739+01:00",
      "ref": "3973234917500235696",
      "type": "comment"
    },
    {
      "date": "12 January 2014 05:41",
      "html": "Ivan and others. I think you misunderstood my comment. My point wasn&#39;t that IPv6 deployment would not be expanded as time goes on. It was about the <b>form</b> which it would take. Few are certain of the eventual winning style of deployment (dual stack, tunneling, various forms of NAT). <br />Notice my communism analogy. Marxists (and Ivan&#39;s native Yugoslavia has a few prominent ones) are quite certain of its eventual arrival, but are hesitant to predict it in its details.<br />To be honest, I was merely parroting my teacher who said that a few months ago. He said that IPv6 will probably not become dominant in the US.",
      "id": "7733554455898414023",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "garegin",
      "profile": "https://www.blogger.com/profile/14508392154453584343",
      "pub": "2014-01-12T05:41:16.790+01:00",
      "ref": "3973234917500235696",
      "type": "comment"
    },
    {
      "date": "28 February 2014 21:47",
      "html": "I was told when I was building networks for the Military in the 90s that v6 was a mandatory project with a deadline of 2008. :) Long since passed and probably isn&#39;t doing barely any.",
      "id": "5173457102601733871",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2014-02-28T21:47:48.964+01:00",
      "ref": "3973234917500235696",
      "type": "comment"
    }
  ],
  "count": 5,
  "id": "3973234917500235696",
  "type": "post",
  "url": "2014/01/ipv6-deployment-religion-and-reality.html"
}