{
  "comments": [
    {
      "comments": [
        {
          "date": "07 July 2015 08:13",
          "html": "Think about how you&#39;d do it across Internet where the only thing you know is the default route and your IP address. You can always convert an MPLS/VPN WAN into something that looks like Internet.",
          "id": "1831503083801634959",
          "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
          "name": "Ivan Pepelnjak",
          "profile": "https://www.blogger.com/profile/13457151406311272386",
          "pub": "2015-07-07T08:13:42.851+02:00",
          "ref": "3936874983144140466",
          "type": "comment"
        }
      ],
      "date": "07 July 2015 07:58",
      "html": "Assuming you use MPLS-WAN, and ISP&#39;s MPLS network is not controlled by your controller, how can you get away with not running routing protocols with your service provider?",
      "id": "3936874983144140466",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2015-07-07T07:58:13.636+02:00",
      "ref": "2848749096460022267",
      "type": "comment"
    },
    {
      "date": "16 July 2015 21:18",
      "html": "I have read your post with interest; let me comment as you requested regarding whether QoS routing protocols exist. ADARA Networks has developed a QoS-based routing protocol (DLSP - Dynamic Link-State Routing Protocol) for its SD-WAN platform. ADARA markets this platform through Hewlett Packard as well as others. I worked with J.J. Garcia-Luna-Aceves who developed DUAL, the basis of Cisco’s EIGRP, and as the inventor of DLSP, I can state that a QoS routing protocol does exist and is scalable without the issues you cite. DLSP computes the link metrics (latency, bandwidth, available bandwidth, loss) dynamically and periodically, and is a true multi-hop/multipath routing protocol, being able to compute multiple paths of unequal cost to the same destination. It is tightly integrated with the forwarding engine, which maps flows to paths according to 1) the path costs, 2) the utilization of the paths, and 3) the QoS requirements of the application. Unlike EIGRP, all the possible paths towards the destination network can be used simultaneously with no routing loops. DLSP does not require any configuration.   No traffic engineering configuration is required, the user only needs to specify the QoS requirements (bandwidth, latency, priority) of the application. (An application is identified using one of the following parameters or through a combination of parameters: port number, IP address, network address, DSCP value, or DPI rule). DLSP (and the multipath flow-based forwarding engine) can be used both on overlay networks and  physical underlay networks. DLSP is extensible, meaning the metrics which it can use can be modified, unlike traditional legacy routing protocols.",
      "id": "7147202160492404195",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Marcelo Spohn, PhD - Chief Scientist ADARA Networks",
      "profile": "http://www.adaranetworks.com",
      "pub": "2015-07-16T21:18:32.105+02:00",
      "ref": "2848749096460022267",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "11 September 2015 13:55",
          "html": "Dan, DLSP is emerging as a candidate for global standard. You can get a White Paper on DLSP in http://www.adaranetworks.com/news-white-paper.php.<br />",
          "id": "2904974186528950435",
          "image": "https://resources.blogblog.com/img/blank.gif",
          "name": "Marcelo Spohn",
          "profile": "http://www.adaranetworks.com",
          "pub": "2015-09-11T13:55:38.914+02:00",
          "ref": "1895001179261239542",
          "type": "comment"
        }
      ],
      "date": "04 August 2015 17:30",
      "html": "Marcelo is DLSP open standard? Can you please give a link with more information or to a whitepaper...<br />",
      "id": "1895001179261239542",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Dan",
      "profile": null,
      "pub": "2015-08-04T17:30:41.049+02:00",
      "ref": "2848749096460022267",
      "type": "comment"
    }
  ],
  "count": 5,
  "id": "2848749096460022267",
  "type": "post",
  "url": "2015/07/routing-protocols-and-sd-wan-apples-and.html"
}