{
   "comments": [
      {
         "comments": [
            {
               "date": "15 September 2019 14:10",
               "html": "I hope I know enough about identifying and making tradeoffs, so I would be perfectly glad to make the one you describe (and did many times in the past).<br /><br />Unfortunately in this particular case it&#39;s a tradeoff between &quot;paying a price of quality airline while getting random performance&quot; (yeah, you can even pay for business class random performance) versus &quot;actually flying with a quality airline but not out of a Slovenian airport&quot; because for reasons unfathomable to me quality airlines fly from all nearby airports (Trieste, Graz, Vienna, Zagreb, Venice) but not from Ljubljana, so it all transforms into &quot;do I waste time waiting for some random time at the local airport&quot; versus &quot;do I waste somewhat-predictable amount of time driving to some other airport&quot;.",
               "id": "5665243511725012328",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "Ivan Pepelnjak",
               "profile": "https://www.blogger.com/profile/13457151406311272386",
               "pub": "2019-09-15T14:10:04.239+02:00",
               "ref": "652516576524956633",
               "type": "comment"
            }
         ],
         "date": "15 September 2019 11:15",
         "html": "You have to made a trade off between higher priced flight tickets (quality airlines) or your valuable time. Think of what you could do with the wasted time instead (opportunity costs).",
         "id": "652516576524956633",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Anonymous",
         "profile": "https://www.blogger.com/profile/17892204563666956100",
         "pub": "2019-09-15T11:15:03.161+02:00",
         "ref": "1352420551694111161",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "15 September 2019 16:41",
               "html": "I know you&#39;re trying to be helpful, but I&#39;ve been around the block a few times and had to run my own business, so went through all the considerations we&#39;re having several times.<br /><br />Just for fun, here are the facts as I see them:<br /><br />* There are two airlines that would be interested in Zurich-Ljubljana route: Swiss and Adria<br />* Swiss has direct daily flights to Graz which has approximately half the number of passengers Ljubljana has;<br />* Adria has three daily flights to Zurich, and at least before they started messing up everything those flights were pretty full;<br />* Swiss had daily flights to Ljubljana a few years back and they were almost fully booked because pricing was comparable and everyone loved flying Swiss instead of Adria;<br />* Swiss discontinued their flights;<br />* Adria is still flying to Zurich three times a day (sometimes taking the scenic route).<br /><br />Whichever way I look I can&#39;t find a business explanation that would match all these data points.",
               "id": "7186971512872719066",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "Ivan Pepelnjak",
               "profile": "https://www.blogger.com/profile/13457151406311272386",
               "pub": "2019-09-15T16:41:16.607+02:00",
               "ref": "2843698961345982913",
               "type": "comment"
            }
         ],
         "date": "15 September 2019 14:56",
         "html": "The unfathomable reason(s) might come from the unprofitable direct course Zurich-Ljubljana (vice versa) from the perspective of the airlines. How often is the airplane booked out? The demand from the customers for this direct course might be low.<br />So the solution might be to fly to a nearby airport and take the bus or train from there to get to Ljubljana. With this strategy you might have the best cost-benefit ratio.",
         "id": "2843698961345982913",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Anonymous",
         "profile": "https://www.blogger.com/profile/17892204563666956100",
         "pub": "2019-09-15T14:56:32.490+02:00",
         "ref": "1352420551694111161",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "22 September 2019 08:48",
               "html": "Great analogy, thank you!<br /><br />In the meantime, it looks like the outsiders with nothing to say (= the passengers) won&#39;t have to endure this family agony for much longer. The first dominoes have already fallen.",
               "id": "3807418725581293287",
               "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
               "name": "Ivan Pepelnjak",
               "profile": "https://www.blogger.com/profile/13457151406311272386",
               "pub": "2019-09-22T08:48:48.131+02:00",
               "ref": "4919639438128974954",
               "type": "comment"
            }
         ],
         "date": "22 September 2019 08:44",
         "html": "My bet is that Star Alliance is trying to help Adria out by giving them monopoly over certain routes, e.g. LJU-ZRH. This is not different to a family giving a struggling family member a hand out. But there must come the time when family says enough is enough and cut off the handouts to those who are either incompetent or taking advantage of family&#39;s good will. There must come the time when even the closest of families throws out those members who don&#39;t contribute to the common objective. Has this time come for Adria?",
         "id": "4919639438128974954",
         "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
         "name": "Slaussie",
         "profile": "https://www.blogger.com/profile/16242167553236920153",
         "pub": "2019-09-22T08:44:34.246+02:00",
         "ref": "1352420551694111161",
         "type": "comment"
      }
   ],
   "count": 3,
   "id": "1352420551694111161",
   "type": "post",
   "url": "2019/09/if-you-travel-to-slovenia-you-should.html"
}
