{
  "comments": [
    {
      "date": "10 December 2015 12:18",
      "html": "All I could think when reading this was how these were somewhat naive suggestions from a business perspective.  Nobody in their right mind does &quot;fashionable&quot; things when dealing with infrastructures that are required to be solid, dependable and robust.<br /><br />Nobody wants to be &quot;that guy&quot; who bought into vendor hot air and implemented some sort of control plane abstraction or some sort of stretched infrastructure that one day goes wrong, or melts and your vendor is looking at you with a blank stare.<br /><br />The reason the infrastructures we have are the way they are is because they are stable and known quantities.<br /><br />You&#39;d have to be a sociopath to sit and think &quot;hey ill do this fashionable new thing and look like a networking rockstar, if the infrastructure comes crashing down, loses the company money, and moreover peoples jobs who work on the coalface, it&#39;ll be fine, at least i did the fashionable thing....&quot;<br /><br />Or would you rather be the guy that did everything with proven technology, best practice from solutions that are proven, and making sure your design is as simple as possible so that documentation is completed (which isnt unusual for the majority of us) and perhaps not some obscene vendor lock-in doesnt happen when you have to scale this up and your current vendor is putting the thumbscrews on you.<br /><br />We are here to support the business and bring value, not make it our playground for new fancy unproven things, if those technologies mature into something that isnt going to make anyone nervous, then great, they&#39;ll get used by people who arent startups or cornerstone cases, im certainly not going to be sat writing an RCA into how this new technology somehow made my loadbalancers melt........ ",
      "id": "8621211100533616069",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "John",
      "profile": null,
      "pub": "2015-12-10T12:18:41.990+01:00",
      "ref": "7479874916926361314",
      "type": "comment"
    },
    {
      "date": "10 December 2015 17:19",
      "html": "Ivan, any chance you want to chime in here: https://www.reddit.com/r/sysadmin/comments/3vx6wh/stretched_datacenter_topology/",
      "id": "4452727284506530487",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2015-12-10T17:19:32.372+01:00",
      "ref": "7479874916926361314",
      "type": "comment"
    },
    {
      "date": "10 December 2015 17:33",
      "html": "&quot;Enterprise IT managers sometimes act like small kids. They don’t want to hear that they have people- and process problems, and love to believe that the next magical bit of technology will solve whatever it is that bothers them. Vendors obviously love to explore these cravings and sell them ever-more-complex solutions.&quot;<br /><br />Me IRL. I just went down the OTV, LISP, F5, Vmotion rabbit hole. Thankfully once the quotes came back that solution was cost prohibitive. ",
      "id": "7257701799141304625",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2015-12-10T17:33:21.439+01:00",
      "ref": "7479874916926361314",
      "type": "comment"
    },
    {
      "date": "11 December 2015 00:46",
      "html": "everybody has a fashion",
      "id": "8574917348976812178",
      "image": "https://resources.blogblog.com/img/blank.gif",
      "name": "Anonymous",
      "profile": null,
      "pub": "2015-12-11T00:46:22.368+01:00",
      "ref": "7479874916926361314",
      "type": "comment"
    },
    {
      "date": "11 December 2015 03:19",
      "html": "The point is that managers would prefer to put a patch in the network (say F5 irule) rather than fix the root problem. Same with streaching L2 people believe we will shave piles of $$$ on servers by doing some network magic and they know everyone will forget how demanded the magic when it breaks",
      "id": "3543045975955539009",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "ccie3555",
      "profile": "https://www.blogger.com/profile/04873425418670951769",
      "pub": "2015-12-11T03:19:45.429+01:00",
      "ref": "7479874916926361314",
      "type": "comment"
    },
    {
      "comments": [
        {
          "date": "09 January 2016 14:38",
          "html": "I think there are probably plenty of people out there who use some sort of layer 2 circuit to facilitate a migration. <br /><br />DR/SRM via stretched layer 2 can be avoided these days by building virtual routers into the deployment. Vmware NSX/SRM looks like it handles it on paper.<br /><br />Doing a DIY job with Quagga or Vyos etc is probably also an option.<br />",
          "id": "4784126955449587836",
          "image": "https://resources.blogblog.com/img/blank.gif",
          "name": "Mark Tees",
          "profile": null,
          "pub": "2016-01-09T14:38:01.932+01:00",
          "ref": "7870600415892883297",
          "type": "comment"
        }
      ],
      "date": "15 December 2015 19:52",
      "html": "Ivan, surely you realize that &quot;<i>Amazon VPC, Microsoft Azure or Bing, Google, Facebook</i>&quot; are not the norm. Most of us work with enterprise, academia, and government, where apps are built fast and sloppy and IT is left to provide scale and fault tolerance.<br /><br />Frankly, I&#39;ve found L2 extension to be extremely helpful for short-term network upgrades and migrations, and long-term DR/SRM networks. Just like a load-balancer, L2 extension can create a great app environment for a fraction of the cost of building the apps &quot;right.&quot;<br /><br />I&#39;ll admit that Live Migration at distance is a dumb idea (cost-to-value is much too high). But L2 extension as a network tool is here to stay -- at least until our customers start using dockers instead of wearing them!<br />",
      "id": "7870600415892883297",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "lcw",
      "profile": "https://www.blogger.com/profile/10562240567667879482",
      "pub": "2015-12-15T19:52:03.887+01:00",
      "ref": "7479874916926361314",
      "type": "comment"
    },
    {
      "date": "31 January 2016 23:13",
      "html": "Totally agree with you. Inter-site firewall cluster it&#39;s a marketing driver for a selling DCI solutions and etc. It&#39;s not a best way for DR situation. Most of the cases related with DR concerned with catastrophic scenarios. Therefore the better way it&#39;s to have few separated FW clusters and pretty simple failover based on classic routing signalling schemes. Other disadvantages with stretched cluster: the single failure domain (most of the cases - control-plane), architectural and hardware bottlenecks (for example shared resources for a handle active states, sessions, configuration and etc.), operations (upgrade software, configuration, hardware etc.). Sometimes cluster technologies could be a root cause for a network instability (flapping, brain splitting, vendor software bugs etc). <br /><br />&quot;Resiliency isn’t just about having multiple components; it’s also about isolation of failure domains.&quot; - Russ White",
      "id": "8275932104382152834",
      "image": "https://lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35",
      "name": "iivasiliev",
      "profile": "https://www.blogger.com/profile/06668533494100263056",
      "pub": "2016-01-31T23:13:56.967+01:00",
      "ref": "7479874916926361314",
      "type": "comment"
    }
  ],
  "count": 8,
  "id": "7479874916926361314",
  "type": "post",
  "url": "2015/12/the-grumpy-old-network-architects-and.html"
}