{
   "comments": [
      {
         "comments": [
            {
               "date": "10 January 2024 06:01",
               "html": "<p>Hello Ivan. Thank you for your contribution over the years.\nIt&#39;s unfortunate that I get to know about you when you have ended the the subscription services for yout online courses. I would have benefited alot. But Goodluck with your knew endeavors\nCheers</p>\n",
               "id": "2068",
               "name": " Ayub Kabeba",
               "pub": "2024-01-10T06:01:35",
               "ref": "1906",
               "type": "comment"
            }
         ],
         "date": "01 September 2023 02:35",
         "html": "All I can say is: thank you!<br />\n\n\n",
         "id": "1906",
         "name": " Pere",
         "pub": "2023-09-01T14:35:13",
         "type": "comment"
      },
      {
         "date": "05 September 2023 06:59",
         "html": "<p>All I would like to say Ivan is &quot; Thank You very much &quot; for your materials and efforts over the years. You took a very different approach for educating people as compared to becoming just another popular vendor training house.</p>\n\n<p>I am sure many engineers will always have this in their mind including myself that You played a crucial role in their career success as Network Engineer.</p>\n",
         "id": "1911",
         "name": "A Tech Artist",
         "pub": "2023-09-05T06:59:07",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "02 October 2023 07:07",
               "html": "<p>&gt; Is there anyway we can access self paced online courses.</p>\n\n<p>If you bought one of them before September 1st you still have full access. You can&#39;t buy them anymore though.</p>\n\n<p>&gt; What&#39;s the future looks like for these courses or is it lost in time.</p>\n\n<p>Some of the materials might be made part of standard subscription. No detailed plans/timelines yet.</p>\n\n<p>Hope this helps, Ivan</p>\n",
               "id": "1946",
               "name": "Ivan Pepelnjak",
               "pub": "2023-10-02T07:07:14",
               "ref": "1944",
               "type": "comment"
            }
         ],
         "date": "01 October 2023 12:55",
         "html": "<p>Hi,</p>\n\n<p>Is there anyway we can access self paced online courses.</p>\n\n<p>What&#39;s the future looks like for these courses or is it lost in time.</p>\n\n<p>Regards,\nTanveer ahamed</p>\n",
         "id": "1944",
         "name": " Tanveer ahamed",
         "pub": "2023-10-01T12:55:56",
         "type": "comment"
      },
      {
         "comments": [
            {
               "date": "19 January 2024 01:00",
               "html": "<p>Hi Ivan, I missed your announcement about the last day of buying a subscription, and now it is too late to repurchase it. Is there any chance for me to subscribe again since I don&rsquo;t want to miss out on this excellent opportunity to get a bunch of fantastic content from you indefinitely? It would be much appreciated.</p>\n",
               "id": "2076",
               "name": "Adis Cato",
               "pub": "2024-01-19T01:00:13",
               "ref": "2041",
               "type": "comment"
            },
            {
               "date": "19 January 2024 11:29",
               "html": "<p>@Adis: Unfortunately, there&#39;s nothing I can do. The payment infrastructure has been shut down for good (see also https://blog.ipspace.net/2024/01/goodbye-ipspace-subscription.html).</p>\n",
               "id": "2077",
               "name": "Ivan Pepelnjak",
               "pub": "2024-01-19T11:29:32",
               "ref": "2076",
               "type": "comment"
            },
            {
               "date": "19 January 2024 01:04",
               "html": "<p>Well, I had to give it a try :)\nI want to thank you for all the knowledge you shared with us and wish you all the best in the future.</p>\n\n<p>Sretno Ivane!</p>\n",
               "id": "2079",
               "name": " Adis",
               "pub": "2024-01-19T13:04:49",
               "ref": "2077",
               "type": "comment"
            }
         ],
         "date": "12 December 2023 05:36",
         "html": "<p>I look forward to reduced thoughts from refreshed Ivan! </p>\n\n<p>When I&#39;m burnt out on networking, I pivot to transportation -- bikes, buses, pedestrians, intersection design, traffic signals, lane widths, etc. There are lots of interesting parallels to digital networking but a much more satisfying connection to humanity.</p>\n\n<p>If you are looking for networking topics to geek out on, I think the trend of adding metadata to ethernet frames is pretty cool. Inband Network Telemetry uses it. So do techniques for path selection and guaranteeing in-order delivery for AI/ML workloads (https://www.youtube.com/watch?v=MV491nrm0fs). I suspect the ultra ethernet consortium (UEC) is all over metadata standards.</p>\n",
         "id": "2041",
         "name": " Craig",
         "pub": "2023-12-12T17:36:52",
         "type": "comment"
      },
      {
         "date": "08 February 2024 10:32",
         "html": "<p>thank you for all this work and for sharing this knowledge with us as simply as possible.\ntake care , all the best!</p>\n",
         "id": "2088",
         "name": "MigR's",
         "pub": "2024-02-08T10:32:11",
         "type": "comment"
      }
   ],
   "count": 5,
   "type": "post",
   "url": "2023/09/lifetime-ipspace-subscription.html"
}
