{
   "comments": [
      {
         "date": "25 November 2023 11:52",
         "html": "<p>There&#39;s a reason why Cisco is giving out a lot of free CE credits for recertification lately. Still you have to invest time into their products. Seems demand is heading to certifications from cloud providers where Cisco has no foothold.</p>\n",
         "id": "2000",
         "name": "Anonymous",
         "pub": "2023-11-25T11:52:31",
         "type": "comment"
      },
      {
         "date": "27 November 2023 10:36",
         "html": "<p>I let mine lapse last year.  I&#39;d held it since 2015 and at the time if felt like a massive achievement to have got through it, when I came to recertify this time around I just couldn&#39;t see the value in it vs putting time into AWS/Azure.  </p>\n\n<p>It just doesn&#39;t feel (to me at least) as relevant as it did ten years ago.</p>\n",
         "id": "2001",
         "name": "John",
         "pub": "2023-11-27T10:36:09",
         "type": "comment"
      },
      {
         "date": "01 February 2024 08:22",
         "html": "<p>I got my CCNP in 2006. I finally let it go in 2023. That is really too long to recert that. I was not gaining anything new every 3 years. It just got more expensive to take a test, and at the end it felt more like a DEVops/Cisco marketing exam. I don&#39;t miss it, and I am also in my mid-fifties. I don&#39;t see the point of certifications at my age. I have a CISSP left and I have no problems letting that one go either. The only thing I think about now is getting the &quot;F&quot; out of this rat race and retiring!</p>\n\n<p>At my current job they had class A, B, and C internal addressing, a wireless network that could not access corp resources, over provisioned links for the traffic and no backups. I totally rebuilt that network personally (including rack and stack) put them on a 10.100.x.x network, setup a corp wireless with SSO, and DOT1X with EAP-TLS and now I just put my feet up on the desk. Very scalable, and will never got down due to bad practices. All that without a CCNP. I&#39;m doing fine. </p>\n",
         "id": "2084",
         "name": " Jeff",
         "pub": "2024-02-01T20:22:32",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2023/11/worth-reading-going-ccnp-emeritus.html"
}
