{
   "comments": [
      {
         "comments": [
            {
               "date": "26 May 2025 09:23",
               "html": "<p>ncclient seems to be nothing more than an underdocumented wrapper around NETCONF, so doing it &quot;across all those platforms&quot; shouldn&#39;t be too hard (in theory).</p>\n\n<p>And yes, I can totally relate to your wonderful experience with the noSQL crowd. I was struck by that particular strain of Kool-Aid years ago, implemented something simple in MongoDB and regretted it ever since.</p>\n",
               "id": "2642",
               "name": " Ivan Pepelnjak",
               "pub": "2025-05-26T09:23:46",
               "ref": "2641",
               "type": "comment"
            }
         ],
         "date": "26 May 2025 09:09",
         "html": "<p>Well, someone appreciates my (sometimes thoughtful) rants I see ;-) </p>\n\n<p>ncclient? uff, wasn&#39;t aware of that. Looks a bit ambitious across all those platforms. </p>\n\n<p>I&#39;m using pyez we maintain since about forever, especially when I muck together some complex python machinery bringing up large topologies over kathara/cRPD and need to shake some routers to get interesting scale effects ;-) But hey, I&#39;m about 99.99% juniper biased and I love the culture installed here from day one of proper modelling, XML everywhere, NETCONF and good engineering tooling. </p>\n\n<p>Yes, the more complexity, the more AI the more the &quot;squishy&quot; (you know what I mean) stuff in JSON will start to catch people (and for that gRPC). There is a <em>tons</em> of difference between NULL/undefined and 0 and a set is not a list either and the more complex the model the more any object to any object mapping is necessary in proper models ;-) As you can deduce I&#39;m also big proponent of thrift though of course gRPC is for the moment all the rage due to its &quot;simplicity&quot;. </p>\n\n<p>All boils down to what database folks learned painfully but learned qujickly going from ISAM to SQL (with the resulting noSQL movement which moved the schema from datqabse into the &quot;code&quot; with some performance gains often [but hey, ACID and transactions are old fashion, right ;-)] paid by much harder maintainance). However, in databases corrupting or loosing one byte looses you the job and hence people learn much quicker that proper algebra allows to reason properly and hence ensure correctness. In networking, eeeehem, we just send things one more time and hope for the best ;-) </p>\n",
         "id": "2641",
         "name": " Tony P",
         "pub": "2025-05-26T09:09:53",
         "type": "comment"
      },
      {
         "date": "26 May 2025 02:52",
         "html": "<p>&gt;ChatGPT generated a correct XPath expression to count the number of IS-IS adjacencies in the Junos show isis adjacency XML printout and flawless Python code to go with it.</p>\n\n<p>That&#39;s rather neat. </p>\n\n<p>Enjoying these rants-to-blog posts. Keep them coming, Dr. P &amp; Ivan.</p>\n",
         "id": "2643",
         "name": " Mark Prosser",
         "pub": "2025-05-26T14:52:49",
         "type": "comment"
      }
   ],
   "count": 2,
   "type": "post",
   "url": "2025/05/repost-xml-advantages.html"
}
