{
   "comments": [
      {
         "comments": [
            {
               "date": "12 June 2024 03:47",
               "html": "<p>You&#39;re absolutely right, thank you. I wanted to mention a separate network for the backup traffic, but unfortunately, I decided to skip that topic. Will fix ;)</p>\n",
               "id": "2289",
               "name": "Ivan Pepelnjak",
               "pub": "2024-06-12T15:47:06",
               "ref": "2288",
               "type": "comment"
            },
            {
               "date": "12 June 2024 03:56",
               "html": "<p>Thats the way. We always called that the servicenet, because it was not only for backups but also for other services all servers needed but where not really meant for the frontend. See, if you have bunch of SAP/Web/DB/whatever servers from different customers, you need to make sure the updates work properly, the backups, NTP, licensing, monitoring and a lot of other stuff maybe (totally depends on systems, apps, customer). It&#39;s way easier to seperate this traffic from the production network to the servicenet and deal with it in there. For security reasons we always used private VLANs in there, just no server could talk to any other server on that network. Everything ends at the servicenet-firewall, but you also could use a router and ACLs to keep them from accessing each other and consider buying a smaller firewall. Then you&#39;d have more throughput. </p>\n",
               "id": "2290",
               "name": " Daniel S",
               "pub": "2024-06-12T15:56:55",
               "ref": "2289",
               "type": "comment"
            }
         ],
         "date": "12 June 2024 10:16",
         "html": "<p>I have an old-style, robust solution if you have a central backup server.</p>\n\n<p>It is based on my experience that many of such servers to be backed up have unused ethernet ports.</p>\n\n<p>Just connect the backup server to a simple front-end switch (maybe some leftover) and connect to the unused port of each server to be backed up using a direct optical cable from this front-end switch to the target server. </p>\n\n<p>No complexity, no race conditions with the primary traffic. Keep it simple...</p>\n",
         "id": "2288",
         "name": "Bela Varkonyi",
         "pub": "2024-06-12T10:16:48",
         "type": "comment"
      }
   ],
   "count": 1,
   "type": "post",
   "url": "2024/06/mythical-use-cases.html"
}
