{
   "comments": [
      {
         "date": "17 October 2021 11:29",
         "html": "<p>Excellent write-up. There are three different things that need to be looked at: Functionality, security and operations (configuration). And not all of them can be attributed to the same person. In terms of commercial products if configured properly, the problem is the lack of proper quality assurance. FIPS and NIAP fail to properly evaluate products and their security. For Common Criteria it depends on the Security Target and the evaluation depth. The entire system is broken, including the evaluation by NIST and NIAP.\nWhile Layer 8 (user) might contribute to security and functionality issues by suboptimal behavior, it all starts with the products themselves.</p>\n",
         "id": "799",
         "name": " Christoph Jaggi",
         "pub": "2021-10-17T11:29:11",
         "type": "comment"
      },
      {
         "date": "19 October 2021 09:19",
         "html": "<p>I believe the trigger point is when it becomes a large human safety issue, like passenger aircraft systems e.g. Boeing max. \nWhen a self-driving car kills someone, where will the butt-kicking chain end, CEO or developer? or has it already happened?</p>\n\n<p>I vaguely recall an old article about the A320, the first fly by wire airliner. The story as I remember is that there are two software systems that were developed by two independent teams that weren&#39;t allowed to interact with each other in any way. </p>\n",
         "id": "802",
         "name": " gdanielson",
         "pub": "2021-10-19T09:19:38",
         "type": "comment"
      },
      {
         "date": "26 October 2021 10:07",
         "html": "<p>(replying to myself I know, but just saw this from Elon Musk. Surely it&#39;s just a question of sooner rather than later)</p>\n\n<p>&gt;Seeing some issues with 10.3, so rolling back to 10.2 temporarily. \n&gt;\n&gt;Please note, this is to be expected with beta software. It is impossible to\n&gt;test all hardware configs in all conditions with internal QA, hence public\n&gt;beta.</p>\n\n<p>https://twitter.com/elonmusk/status/1452345284483235841</p>\n",
         "id": "815",
         "name": "gdanielson",
         "pub": "2021-10-26T22:07:40",
         "type": "comment"
      }
   ],
   "count": 3,
   "type": "post",
   "url": "2021/10/worth-reading-professional-liability.html"
}
